export interface Option {
  value: string;
  label: string;
  children?: Option[];
}

export const kpOptions: Option[] = [
  {
    label: "数与代数",
    value: "数与代数",
    children: [
      {
        label: "数与式",
        value: "数与式",
        children: [
          {
            label: "有理数",
            value: "有理数",
            children: [
              {
                label: "理解负数的意义",
                value: "理解负数的意义",
                children: [
                  {
                    label: "正数、负数定义",
                    value: "正数、负数定义",
                  },
                  {
                    label: "相反意义的量",
                    value: "相反意义的量",
                  },
                  {
                    label: "0的特殊含义",
                    value: "0的特殊含义",
                  },
                ],
              },
              {
                label: "理解有理数的意义",
                value: "理解有理数的意义",
                children: [
                  {
                    label: "有理数的定义",
                    value: "有理数的定义",
                  },
                  {
                    label: "有理数的分类",
                    value: "有理数的分类",
                  },
                ],
              },
              {
                label: "能用数轴上的点表示有理数",
                value: "能用数轴上的点表示有理数",
                children: [
                  {
                    label: "数轴的定义",
                    value: "数轴的定义",
                  },
                  {
                    label: "数轴的画法",
                    value: "数轴的画法",
                  },
                  {
                    label: "用数轴上的点表示有理数",
                    value: "用数轴上的点表示有理数",
                  },
                  {
                    label: "根据数轴上点的位置判断符号大小",
                    value: "根据数轴上点的位置判断符号大小",
                  },
                  {
                    label: "数轴上两点间距离",
                    value: "数轴上两点间距离",
                  },
                  {
                    label: "数轴上点的平移",
                    value: "数轴上点的平移",
                  },
                  {
                    label: "数轴上找原点",
                    value: "数轴上找原点",
                  },
                  {
                    label: "数轴上点的翻折",
                    value: "数轴上点的翻折",
                  },
                  {
                    label: "数轴上整点覆盖问题",
                    value: "数轴上整点覆盖问题",
                  },
                  {
                    label: "数轴上动点问题-追击问题",
                    value: "数轴上动点问题-追击问题",
                  },
                  {
                    label: "数轴上动点问题-相遇问题",
                    value: "数轴上动点问题-相遇问题",
                  },
                  {
                    label: "数轴上动点问题-往返问题",
                    value: "数轴上动点问题-往返问题",
                  },
                  {
                    label: "数轴上动点问题-线段间关系问题",
                    value: "数轴上动点问题-线段间关系问题",
                  },
                  {
                    label: "数轴上动点问题-其他问题",
                    value: "数轴上动点问题-其他问题",
                  },
                  {
                    label: "数轴上的规律探究",
                    value: "数轴上的规律探究",
                  },
                  {
                    label: "与数轴有关的新定义",
                    value: "与数轴有关的新定义",
                  },
                ],
              },
              {
                label: "能比较有理数的大小",
                value: "能比较有理数的大小",
                children: [
                  {
                    label: "有理数比较大小-作商法",
                    value: "有理数比较大小-作商法",
                  },
                  {
                    label: "有理数比较大小-作差法",
                    value: "有理数比较大小-作差法",
                  },
                  {
                    label: "有理数比较大小-利用有理数正负性",
                    value: "有理数比较大小-利用有理数正负性",
                  },
                  {
                    label: "有理数比较大小-利用数轴",
                    value: "有理数比较大小-利用数轴",
                  },
                ],
              },
              {
                label: "借助数轴理解相反数和绝对值的意义",
                value: "借助数轴理解相反数和绝对值的意义",
                children: [
                  {
                    label: "相反数的定义",
                    value: "相反数的定义",
                  },
                  {
                    label: "相反数的性质",
                    value: "相反数的性质",
                  },
                  {
                    label: "相反数的几何意义",
                    value: "相反数的几何意义",
                  },
                  {
                    label: "绝对值的定义",
                    value: "绝对值的定义",
                  },
                  {
                    label: "绝对值的代数意义",
                    value: "绝对值的代数意义",
                  },
                  {
                    label: "绝对值的几何意义",
                    value: "绝对值的几何意义",
                  },
                ],
              },
              {
                label: "掌握求有理数的相反数和绝对值的方法",
                value: "掌握求有理数的相反数和绝对值的方法",
                children: [
                  {
                    label: "相反数的定义",
                    value: "相反数的定义",
                  },
                  {
                    label: "相反数的性质",
                    value: "相反数的性质",
                  },
                  {
                    label: "相反数的几何意义",
                    value: "相反数的几何意义",
                  },
                  {
                    label: "绝对值的定义",
                    value: "绝对值的定义",
                  },
                  {
                    label: "绝对值的代数意义",
                    value: "绝对值的代数意义",
                  },
                  {
                    label: "绝对值的几何意义",
                    value: "绝对值的几何意义",
                  },
                  {
                    label: "有理数的符号判定",
                    value: "有理数的符号判定",
                  },
                  {
                    label: "多重符号化简",
                    value: "多重符号化简",
                  },
                  {
                    label: "绝对值的非负性",
                    value: "绝对值的非负性",
                  },
                  {
                    label: "绝对值综合",
                    value: "绝对值综合",
                  },
                  {
                    label: "|a|/a的化简",
                    value: "|a|/a的化简",
                  },
                  {
                    label: "结合数轴化简绝对值",
                    value: "结合数轴化简绝对值",
                  },
                  {
                    label: "已知范围化简绝对值",
                    value: "已知范围化简绝对值",
                  },
                  {
                    label: "利用题设条件推理化简绝对值",
                    value: "利用题设条件推理化简绝对值",
                  },
                  {
                    label: "利用绝对值求最值",
                    value: "利用绝对值求最值",
                  },
                  {
                    label: "零点分段法",
                    value: "零点分段法",
                  },
                ],
              },
              {
                label: "理解乘方的意义",
                value: "理解乘方的意义",
                children: [
                  {
                    label: "有理数乘方的定义",
                    value: "有理数乘方的定义",
                  },
                  {
                    label: "偶次幂的非负性",
                    value: "偶次幂的非负性",
                  },
                  {
                    label: "完全平方非负性",
                    value: "完全平方非负性",
                  },
                ],
              },
              {
                label:
                  "掌握有理数的加、减、乘、除、乘方及简单的混合运算(以三步以内为主)",
                value:
                  "掌握有理数的加、减、乘、除、乘方及简单的混合运算(以三步以内为主)",
                children: [
                  {
                    label: "有理数的加法法则",
                    value: "有理数的加法法则",
                  },
                  {
                    label: "有理数加法运算",
                    value: "有理数加法运算",
                  },
                  {
                    label: "有理数的减法法则",
                    value: "有理数的减法法则",
                  },
                  {
                    label: "有理数减法运算",
                    value: "有理数减法运算",
                  },
                  {
                    label: "有理数加减混合运算",
                    value: "有理数加减混合运算",
                  },
                  {
                    label: "确定几个数和或差的符号",
                    value: "确定几个数和或差的符号",
                  },
                  {
                    label: "有理数的乘法法则",
                    value: "有理数的乘法法则",
                  },
                  {
                    label: "有理数乘法运算",
                    value: "有理数乘法运算",
                  },
                  {
                    label: "有理数的除法法则",
                    value: "有理数的除法法则",
                  },
                  {
                    label: "有理数除法运算",
                    value: "有理数除法运算",
                  },
                  {
                    label: "有理数乘除混合运算",
                    value: "有理数乘除混合运算",
                  },
                  {
                    label: "有理数四则混合运算",
                    value: "有理数四则混合运算",
                  },
                  {
                    label: "有理数乘方运算",
                    value: "有理数乘方运算",
                  },
                  {
                    label: "含乘方的有理数混合运算",
                    value: "含乘方的有理数混合运算",
                  },
                  {
                    label: "倒数的定义",
                    value: "倒数的定义",
                  },
                  {
                    label: "负倒数的定义",
                    value: "负倒数的定义",
                  },
                  {
                    label: "裂项",
                    value: "裂项",
                  },
                  {
                    label: "整体换元",
                    value: "整体换元",
                  },
                  {
                    label: "错位相减",
                    value: "错位相减",
                  },
                  {
                    label: "等差数列求和",
                    value: "等差数列求和",
                  },
                  {
                    label: "程序框图",
                    value: "程序框图",
                  },
                ],
              },
              {
                label: "理解有理数的运算律",
                value: "理解有理数的运算律",
                children: [
                  {
                    label: "有理数加法的运算律",
                    value: "有理数加法的运算律",
                  },
                  {
                    label: "有理数的乘法运算律",
                    value: "有理数的乘法运算律",
                  },
                ],
              },
              {
                label: "能运用运算律简化运算",
                value: "能运用运算律简化运算",
                children: [
                  {
                    label: "有理数加法的运算律",
                    value: "有理数加法的运算律",
                  },
                  {
                    label: "有理数的乘法运算律",
                    value: "有理数的乘法运算律",
                  },
                  {
                    label: "提取公因",
                    value: "提取公因",
                  },
                  {
                    label: "凑整",
                    value: "凑整",
                  },
                  {
                    label: "凑零",
                    value: "凑零",
                  },
                  {
                    label: "连锁约分",
                    value: "连锁约分",
                  },
                  {
                    label: "分组求和",
                    value: "分组求和",
                  },
                  {
                    label: "拆添项",
                    value: "拆添项",
                  },
                ],
              },
              {
                label: "能运用有理数的运算解决简单问题",
                value: "能运用有理数的运算解决简单问题",
                children: [
                  {
                    label: "填数字问题（幻方）",
                    value: "填数字问题（幻方）",
                  },
                  {
                    label: "有理数加减法与实际问题",
                    value: "有理数加减法与实际问题",
                  },
                  {
                    label: "有理数乘除法与实际问题",
                    value: "有理数乘除法与实际问题",
                  },
                ],
              },
            ],
          },
          {
            label: "实数",
            value: "实数",
            children: [
              {
                label: "了解无理数和实数",
                value: "了解无理数和实数",
                children: [
                  {
                    label: "无理数的定义",
                    value: "无理数的定义",
                  },
                  {
                    label: "实数的定义",
                    value: "实数的定义",
                  },
                  {
                    label: "两个数运算后判断是否为无理数",
                    value: "两个数运算后判断是否为无理数",
                  },
                  {
                    label: "无理数运算与参数问题",
                    value: "无理数运算与参数问题",
                  },
                ],
              },
              {
                label: "知道实数由有理数和无理数组成",
                value: "知道实数由有理数和无理数组成",
                children: [
                  {
                    label: "实数分类",
                    value: "实数分类",
                  },
                ],
              },
              {
                label: "了解实数与数轴上的点一一对应",
                value: "了解实数与数轴上的点一一对应",
                children: [
                  {
                    label: "实数与数轴",
                    value: "实数与数轴",
                  },
                ],
              },
              {
                label: "能用数轴上的点表示实数",
                value: "能用数轴上的点表示实数",
                children: [
                  {
                    label: "实数与数轴",
                    value: "实数与数轴",
                  },
                ],
              },
              {
                label: "能比较实数的大小",
                value: "能比较实数的大小",
                children: [
                  {
                    label: "无理数大小的比较",
                    value: "无理数大小的比较",
                  },
                ],
              },
              {
                label: "能借助数轴理解相反数和绝对值的意义",
                value: "能借助数轴理解相反数和绝对值的意义",
                children: [
                  {
                    label: "实数与相反数、绝对值和倒数",
                    value: "实数与相反数、绝对值和倒数",
                  },
                ],
              },
              {
                label: "会求实数的相反数和绝对值。",
                value: "会求实数的相反数和绝对值。",
                children: [
                  {
                    label: "实数与相反数、绝对值和倒数",
                    value: "实数与相反数、绝对值和倒数",
                  },
                ],
              },
              {
                label: "了解平方根、算术平方根、立方根的概念",
                value: "了解平方根、算术平方根、立方根的概念",
                children: [
                  {
                    label: "算术平方根的定义",
                    value: "算术平方根的定义",
                  },
                  {
                    label: "平方根的定义",
                    value: "平方根的定义",
                  },
                  {
                    label: "立方根的定义",
                    value: "立方根的定义",
                  },
                  {
                    label: "算术平方根的双重非负性",
                    value: "算术平方根的双重非负性",
                  },
                  {
                    label: "由算术平方根求参数的值",
                    value: "由算术平方根求参数的值",
                  },
                  {
                    label: "由平方根求参数的值",
                    value: "由平方根求参数的值",
                  },
                  {
                    label: "由立方根求参数的值",
                    value: "由立方根求参数的值",
                  },
                  {
                    label: "平方根与算术平方根的区别与联系",
                    value: "平方根与算术平方根的区别与联系",
                  },
                  {
                    label: "立方根与平方根的区别与联系",
                    value: "立方根与平方根的区别与联系",
                  },
                  {
                    label: "非负性的应用",
                    value: "非负性的应用",
                  },
                  {
                    label: "平方根和立方根综合",
                    value: "平方根和立方根综合",
                  },
                  {
                    label: "n次方根",
                    value: "n次方根",
                  },
                  {
                    label: "分数指数幂",
                    value: "分数指数幂",
                  },
                ],
              },
              {
                label: "会用根号表示数的平方根、算术平方根、立方根",
                value: "会用根号表示数的平方根、算术平方根、立方根",
                children: [
                  {
                    label: "算术平方根的定义",
                    value: "算术平方根的定义",
                  },
                  {
                    label: "平方根的定义",
                    value: "平方根的定义",
                  },
                  {
                    label: "立方根的定义",
                    value: "立方根的定义",
                  },
                  {
                    label: "开平方",
                    value: "开平方",
                  },
                  {
                    label: "开立方",
                    value: "开立方",
                  },
                  {
                    label: "平方根和立方根综合",
                    value: "平方根和立方根综合",
                  },
                ],
              },
              {
                label: "了解乘方与开方互为逆运算",
                value: "了解乘方与开方互为逆运算",
                children: [
                  {
                    label: "开平方",
                    value: "开平方",
                  },
                  {
                    label: "开立方",
                    value: "开立方",
                  },
                  {
                    label: "利用平方根解方程",
                    value: "利用平方根解方程",
                  },
                  {
                    label: "利用立方根解方程",
                    value: "利用立方根解方程",
                  },
                ],
              },
              {
                label: "会用平方运算求百以内完全平方数的平方根",
                value: "会用平方运算求百以内完全平方数的平方根",
                children: [
                  {
                    label: "开平方",
                    value: "开平方",
                  },
                ],
              },
              {
                label:
                  "会用立方运算求千以内完全立方数(及对应的负整数) 的立方根",
                value:
                  "会用立方运算求千以内完全立方数(及对应的负整数) 的立方根",
                children: [
                  {
                    label: "开立方",
                    value: "开立方",
                  },
                ],
              },
              {
                label: "会用计算器计算平方根和立方根",
                value: "会用计算器计算平方根和立方根",
                children: [
                  {
                    label: "计算器的使用",
                    value: "计算器的使用",
                  },
                  {
                    label: "平方根中小数点移动规律的应用",
                    value: "平方根中小数点移动规律的应用",
                  },
                  {
                    label: "立方根中小数点移动规律的应用",
                    value: "立方根中小数点移动规律的应用",
                  },
                ],
              },
              {
                label: "能用有理数估计一个无理数的大致范围",
                value: "能用有理数估计一个无理数的大致范围",
                children: [
                  {
                    label: "无理数的估算",
                    value: "无理数的估算",
                  },
                  {
                    label: "无理数的整数、小数部分",
                    value: "无理数的整数、小数部分",
                  },
                ],
              },
              {
                label: "了解近似数",
                value: "了解近似数",
                children: [
                  {
                    label: "近似数",
                    value: "近似数",
                  },
                  {
                    label: "精确数位",
                    value: "精确数位",
                  },
                  {
                    label: "有效数字",
                    value: "有效数字",
                  },
                ],
              },
              {
                label: "在解决实际问题中，能用计算器进行近似计算",
                value: "在解决实际问题中，能用计算器进行近似计算",
                children: [
                  {
                    label: "计算器的使用",
                    value: "计算器的使用",
                  },
                ],
              },
              {
                label: "会按问题的要求进行简单的近似计算",
                value: "会按问题的要求进行简单的近似计算",
                children: [
                  {
                    label: "近似数",
                    value: "近似数",
                  },
                  {
                    label: "精确数位",
                    value: "精确数位",
                  },
                  {
                    label: "实数基础运算",
                    value: "实数基础运算",
                  },
                ],
              },
              {
                label: "了解二次根式、最简二次根式的概念",
                value: "了解二次根式、最简二次根式的概念",
                children: [
                  {
                    label: "二次根式的定义",
                    value: "二次根式的定义",
                  },
                  {
                    label: "二次根式有意义的条件",
                    value: "二次根式有意义的条件",
                  },
                  {
                    label: "最简二次根式",
                    value: "最简二次根式",
                  },
                  {
                    label: "同类二次根式",
                    value: "同类二次根式",
                  },
                  {
                    label: "二次根式的性质",
                    value: "二次根式的性质",
                  },
                  {
                    label: "根据同类二次根式的定义求参数",
                    value: "根据同类二次根式的定义求参数",
                  },
                  {
                    label: "已知二次根式的值为整数确定字母的取值范围",
                    value: "已知二次根式的值为整数确定字母的取值范围",
                  },
                  {
                    label: "把根号外的因式化到根号内",
                    value: "把根号外的因式化到根号内",
                  },
                ],
              },
              {
                label: "了解二次根式(根号下仅限于数)加、减、乘、除运算法则",
                value: "了解二次根式(根号下仅限于数)加、减、乘、除运算法则",
                children: [
                  {
                    label: "二次根式的乘法",
                    value: "二次根式的乘法",
                  },
                  {
                    label: "二次根式的除法",
                    value: "二次根式的除法",
                  },
                  {
                    label: "二次根式的乘除混合运算",
                    value: "二次根式的乘除混合运算",
                  },
                  {
                    label: "二次根式的加减以及混合运算",
                    value: "二次根式的加减以及混合运算",
                  },
                  {
                    label: "二次根式比较大小",
                    value: "二次根式比较大小",
                  },
                  {
                    label: "分母、分子有理化",
                    value: "分母、分子有理化",
                  },
                ],
              },
              {
                label: "会用二次根式、最简二次根式进行简单的四则运算",
                value: "会用二次根式、最简二次根式进行简单的四则运算",
                children: [
                  {
                    label: "二次根式的四则混合运算",
                    value: "二次根式的四则混合运算",
                  },
                  {
                    label: "二次根式的巧算",
                    value: "二次根式的巧算",
                  },
                  {
                    label: "含二次根式的实数的运算",
                    value: "含二次根式的实数的运算",
                  },
                  {
                    label: "二次根式与分式有意义综合",
                    value: "二次根式与分式有意义综合",
                  },
                  {
                    label: "二次根式与数轴综合",
                    value: "二次根式与数轴综合",
                  },
                  {
                    label: "二次根式的综合应用",
                    value: "二次根式的综合应用",
                  },
                  {
                    label: "多重二次根式",
                    value: "多重二次根式",
                  },
                  {
                    label: "根式的恒等变形",
                    value: "根式的恒等变形",
                  },
                  {
                    label: "二次根式直接化简求值",
                    value: "二次根式直接化简求值",
                  },
                  {
                    label: "二次根式降幂求值",
                    value: "二次根式降幂求值",
                  },
                  {
                    label: "已知范围的二次根式化简求值",
                    value: "已知范围的二次根式化简求值",
                  },
                  {
                    label: "利用二次根式非负性化简求值",
                    value: "利用二次根式非负性化简求值",
                  },
                  {
                    label: "二次根式的化简求值——共轭二次根式类",
                    value: "二次根式的化简求值——共轭二次根式类",
                  },
                  {
                    label: "二次根式的化简求值——利用完全平方",
                    value: "二次根式的化简求值——利用完全平方",
                  },
                  {
                    label: "二次根式的化简求值——倒数型构造",
                    value: "二次根式的化简求值——倒数型构造",
                  },
                  {
                    label: "根式的整数、小数部分",
                    value: "根式的整数、小数部分",
                  },
                ],
              },
            ],
          },
          {
            label: "代数式",
            value: "代数式",
            children: [
              {
                label: "借助现实情境了解代数式，进一步理解用字母表示数的意义",
                value: "借助现实情境了解代数式，进一步理解用字母表示数的意义",
                children: [
                  {
                    label: "代数式的定义",
                    value: "代数式的定义",
                  },
                  {
                    label: "代数式的书写规则",
                    value: "代数式的书写规则",
                  },
                  {
                    label: "代数式的分类",
                    value: "代数式的分类",
                  },
                ],
              },
              {
                label: "能分析具体问题中的简单数量关系，并用代数式表示",
                value: "能分析具体问题中的简单数量关系，并用代数式表示",
                children: [
                  {
                    label: "列代数式",
                    value: "列代数式",
                  },
                ],
              },
              {
                label: "能根据特定的问题查阅资料，找到所需的公式",
                value: "能根据特定的问题查阅资料，找到所需的公式",
                children: [
                  {
                    label: "列代数式",
                    value: "列代数式",
                  },
                ],
              },
              {
                label: "会把具体数代入代数式进行计算",
                value: "会把具体数代入代数式进行计算",
                children: [
                  {
                    label: "整式加减化简求值-直接代入化简求值",
                    value: "整式加减化简求值-直接代入化简求值",
                  },
                  {
                    label: "程序框图",
                    value: "程序框图",
                  },
                ],
              },
              {
                label: "了解整数指数幂的意义和基本性质",
                value: "了解整数指数幂的意义和基本性质",
                children: [
                  {
                    label: "零指数幂",
                    value: "零指数幂",
                  },
                  {
                    label: "负整数指数幂",
                    value: "负整数指数幂",
                  },
                  {
                    label: "含零次幂的实数的运算",
                    value: "含零次幂的实数的运算",
                  },
                  {
                    label: "含负指数幂的实数的运算",
                    value: "含负指数幂的实数的运算",
                  },
                ],
              },
              {
                label: "会用科学记数法表示数(包括在计算器上表示)",
                value: "会用科学记数法表示数(包括在计算器上表示)",
                children: [
                  {
                    label: "科学记数法的定义",
                    value: "科学记数法的定义",
                  },
                  {
                    label: "科学记数法：表示较大的数",
                    value: "科学记数法：表示较大的数",
                  },
                  {
                    label: "科学记数法：表示较小的数",
                    value: "科学记数法：表示较小的数",
                  },
                  {
                    label: "由科学记数法求原数",
                    value: "由科学记数法求原数",
                  },
                ],
              },
              {
                label: "理解整式的概念",
                value: "理解整式的概念",
                children: [
                  {
                    label: "整式的定义",
                    value: "整式的定义",
                  },
                  {
                    label: "单项式的定义",
                    value: "单项式的定义",
                  },
                  {
                    label: "单项式的系数",
                    value: "单项式的系数",
                  },
                  {
                    label: "单项式的次数",
                    value: "单项式的次数",
                  },
                  {
                    label: "多项式的定义",
                    value: "多项式的定义",
                  },
                  {
                    label: "多项式的项",
                    value: "多项式的项",
                  },
                  {
                    label: "多项式的次数",
                    value: "多项式的次数",
                  },
                  {
                    label: "按要求写出单项式",
                    value: "按要求写出单项式",
                  },
                  {
                    label: "按要求写出多项式",
                    value: "按要求写出多项式",
                  },
                  {
                    label: "同类项的定义",
                    value: "同类项的定义",
                  },
                  {
                    label: "由单项式的次数和系数求参数的值",
                    value: "由单项式的次数和系数求参数的值",
                  },
                  {
                    label: "由多项式的项和次数求参数的值",
                    value: "由多项式的项和次数求参数的值",
                  },
                  {
                    label: "由同类项求参数的值",
                    value: "由同类项求参数的值",
                  },
                  {
                    label: "多项式升幂降幂排列",
                    value: "多项式升幂降幂排列",
                  },
                ],
              },
              {
                label: "掌握合并同类项和去括号的法则",
                value: "掌握合并同类项和去括号的法则",
                children: [
                  {
                    label: "合并同类项",
                    value: "合并同类项",
                  },
                  {
                    label: "整式的添括号、去括号",
                    value: "整式的添括号、去括号",
                  },
                ],
              },
              {
                label: "能进行简单的整式加减运算",
                value: "能进行简单的整式加减运算",
                children: [
                  {
                    label: "整式加减",
                    value: "整式加减",
                  },
                  {
                    label: "整式加减的综合",
                    value: "整式加减的综合",
                  },
                  {
                    label: "整式比较大小",
                    value: "整式比较大小",
                  },
                  {
                    label: "整式加减-无关项求值",
                    value: "整式加减-无关项求值",
                  },
                  {
                    label: "错误计算问题",
                    value: "错误计算问题",
                  },
                  {
                    label: "整式加减与几何图形的应用",
                    value: "整式加减与几何图形的应用",
                  },
                  {
                    label: "整式加减与实际问题的应用",
                    value: "整式加减与实际问题的应用",
                  },
                  {
                    label: "整式加减化简求值-直接代入化简求值",
                    value: "整式加减化简求值-直接代入化简求值",
                  },
                  {
                    label: "整式加减化简求值-整体代入化简求值",
                    value: "整式加减化简求值-整体代入化简求值",
                  },
                  {
                    label: "整式加减化简求值-降次化简求值",
                    value: "整式加减化简求值-降次化简求值",
                  },
                  {
                    label: "整式加减化简求值-条件化简求值",
                    value: "整式加减化简求值-条件化简求值",
                  },
                  {
                    label: "去绝对值化简整式",
                    value: "去绝对值化简整式",
                  },
                  {
                    label: "利用特殊值解决高次展开式问题",
                    value: "利用特殊值解决高次展开式问题",
                  },
                ],
              },
              {
                label:
                  "能进行简单的整式乘法运算(多项式乘法仅限于 一次式之间和一次式与二次式的乘法)",
                value:
                  "能进行简单的整式乘法运算(多项式乘法仅限于 一次式之间和一次式与二次式的乘法)",
                children: [
                  {
                    label: "同底数幂的乘法",
                    value: "同底数幂的乘法",
                  },
                  {
                    label: "幂的乘方",
                    value: "幂的乘方",
                  },
                  {
                    label: "积的乘方",
                    value: "积的乘方",
                  },
                  {
                    label: "同底数幂的除法",
                    value: "同底数幂的除法",
                  },
                  {
                    label: "同底数幂的乘法的逆用",
                    value: "同底数幂的乘法的逆用",
                  },
                  {
                    label: "利用同底数幂乘法的巧算",
                    value: "利用同底数幂乘法的巧算",
                  },
                  {
                    label: "幂的乘方的逆用",
                    value: "幂的乘方的逆用",
                  },
                  {
                    label: "利用幂的乘方比较大小",
                    value: "利用幂的乘方比较大小",
                  },
                  {
                    label: "积的乘方的逆用",
                    value: "积的乘方的逆用",
                  },
                  {
                    label: "利用积的乘方的巧算",
                    value: "利用积的乘方的巧算",
                  },
                  {
                    label: "同底数幂的除法的逆用",
                    value: "同底数幂的除法的逆用",
                  },
                  {
                    label: "单项式乘单项式",
                    value: "单项式乘单项式",
                  },
                  {
                    label: "单项式乘多项式",
                    value: "单项式乘多项式",
                  },
                  {
                    label: "多项式乘多项式",
                    value: "多项式乘多项式",
                  },
                  {
                    label: "单项式除以单项式",
                    value: "单项式除以单项式",
                  },
                  {
                    label: "多项式除以单项式",
                    value: "多项式除以单项式",
                  },
                  {
                    label: "幂的综合运算",
                    value: "幂的综合运算",
                  },
                  {
                    label: "整式乘除与实际问题",
                    value: "整式乘除与实际问题",
                  },
                  {
                    label: "整式乘除化简求值-直接代入化简求值",
                    value: "整式乘除化简求值-直接代入化简求值",
                  },
                  {
                    label: "整式乘除化简求值-整体代入化简求值",
                    value: "整式乘除化简求值-整体代入化简求值",
                  },
                  {
                    label: "整式乘除化简求值-降次化简求值",
                    value: "整式乘除化简求值-降次化简求值",
                  },
                  {
                    label: "整式乘除化简求值-条件化简求值",
                    value: "整式乘除化简求值-条件化简求值",
                  },
                  {
                    label: "整式乘除-无关项求值",
                    value: "整式乘除-无关项求值",
                  },
                  {
                    label: "整式乘除的综合",
                    value: "整式乘除的综合",
                  },
                  {
                    label: "已知因式分解结果求参数",
                    value: "已知因式分解结果求参数",
                  },
                  {
                    label: "多项式除以多项式",
                    value: "多项式除以多项式",
                  },
                  {
                    label: "大除法",
                    value: "大除法",
                  },
                  {
                    label: "综合除法和余数定理",
                    value: "综合除法和余数定理",
                  },
                ],
              },
              {
                label: "理解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²",
                value: "理解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²",
                children: [
                  {
                    label: "平方差公式的计算",
                    value: "平方差公式的计算",
                  },
                  {
                    label: "完全平方公式的计算-不含分式",
                    value: "完全平方公式的计算-不含分式",
                  },
                  {
                    label: "完全平方公式的计算-含分式",
                    value: "完全平方公式的计算-含分式",
                  },
                ],
              },
              {
                label:
                  "了解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²的几何背景",
                value:
                  "了解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²的几何背景",
                children: [
                  {
                    label: "平方差公式的几何背景",
                    value: "平方差公式的几何背景",
                  },
                  {
                    label: "完全平方公式的几何背景",
                    value: "完全平方公式的几何背景",
                  },
                ],
              },
              {
                label:
                  "能利用乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²进行简单的计算和推理",
                value:
                  "能利用乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²进行简单的计算和推理",
                children: [
                  {
                    label: "应用平方差公式进行简便运算",
                    value: "应用平方差公式进行简便运算",
                  },
                  {
                    label: "应用完全平方进行简便运算",
                    value: "应用完全平方进行简便运算",
                  },
                  {
                    label: "利用乘法公式计算",
                    value: "利用乘法公式计算",
                  },
                  {
                    label: "利用完全平方式求参数的值",
                    value: "利用完全平方式求参数的值",
                  },
                  {
                    label: "配方思想的运用",
                    value: "配方思想的运用",
                  },
                  {
                    label: "配方求最值",
                    value: "配方求最值",
                  },
                  {
                    label: "乘法公式的综合运用",
                    value: "乘法公式的综合运用",
                  },
                  {
                    label: "完全平方非负性",
                    value: "完全平方非负性",
                  },
                  {
                    label: "和与差的立方公式",
                    value: "和与差的立方公式",
                  },
                  {
                    label: "高次方公式",
                    value: "高次方公式",
                  },
                ],
              },
              {
                label:
                  "能用提公因式法、公式法(直接利用公式不超过二次)进行因 式分解(指数为正整数)",
                value:
                  "能用提公因式法、公式法(直接利用公式不超过二次)进行因 式分解(指数为正整数)",
                children: [
                  {
                    label: "判断是否可以因式分解",
                    value: "判断是否可以因式分解",
                  },
                  {
                    label: "判断因式分解结果是否正确",
                    value: "判断因式分解结果是否正确",
                  },
                  {
                    label: "因式分解的一般步骤",
                    value: "因式分解的一般步骤",
                  },
                  {
                    label: "公因式",
                    value: "公因式",
                  },
                  {
                    label: "利用提公因式法因式分解",
                    value: "利用提公因式法因式分解",
                  },
                  {
                    label: "利用平方差公式因式分解",
                    value: "利用平方差公式因式分解",
                  },
                  {
                    label: "利用完全平方公式因式分解",
                    value: "利用完全平方公式因式分解",
                  },
                  {
                    label: "提公因式+平方差",
                    value: "提公因式+平方差",
                  },
                  {
                    label: "提公因式+完全平方",
                    value: "提公因式+完全平方",
                  },
                  {
                    label: "公式法综合应用",
                    value: "公式法综合应用",
                  },
                  {
                    label: "利用立方和与立方差公式因式分解",
                    value: "利用立方和与立方差公式因式分解",
                  },
                  {
                    label: "实数范围内因式分解",
                    value: "实数范围内因式分解",
                  },
                  {
                    label: "二次项系数为±1的十字相乘",
                    value: "二次项系数为±1的十字相乘",
                  },
                  {
                    label: "二次项系数不为±1的十字相乘",
                    value: "二次项系数不为±1的十字相乘",
                  },
                  {
                    label: "系数为整式的十字相乘",
                    value: "系数为整式的十字相乘",
                  },
                  {
                    label: "与提公因式结合的十字相乘",
                    value: "与提公因式结合的十字相乘",
                  },
                  {
                    label: "分组分解—四项式",
                    value: "分组分解—四项式",
                  },
                  {
                    label: "分组分解—五项式",
                    value: "分组分解—五项式",
                  },
                  {
                    label: "分组分解—六项式",
                    value: "分组分解—六项式",
                  },
                  {
                    label: "重组重解",
                    value: "重组重解",
                  },
                  {
                    label: "双十字相乘法",
                    value: "双十字相乘法",
                  },
                  {
                    label: "换元法",
                    value: "换元法",
                  },
                  {
                    label: "拆添项法",
                    value: "拆添项法",
                  },
                  {
                    label: "待定系数法",
                    value: "待定系数法",
                  },
                  {
                    label: "选主元法",
                    value: "选主元法",
                  },
                  {
                    label: "因式定理",
                    value: "因式定理",
                  },
                  {
                    label: "整体思想法",
                    value: "整体思想法",
                  },
                  {
                    label: "特殊值法",
                    value: "特殊值法",
                  },
                  {
                    label: "对称多项式",
                    value: "对称多项式",
                  },
                  {
                    label: "轮换对称多项式",
                    value: "轮换对称多项式",
                  },
                  {
                    label: "因式分解的应用",
                    value: "因式分解的应用",
                  },
                ],
              },
              {
                label: "了解分式和最简分式的概念",
                value: "了解分式和最简分式的概念",
                children: [
                  {
                    label: "分式的定义",
                    value: "分式的定义",
                  },
                  {
                    label: "分式有意义的条件",
                    value: "分式有意义的条件",
                  },
                  {
                    label: "最简分式",
                    value: "最简分式",
                  },
                  {
                    label: "分式值为0",
                    value: "分式值为0",
                  },
                  {
                    label: "按要求写分式",
                    value: "按要求写分式",
                  },
                  {
                    label: "分式为特殊值",
                    value: "分式为特殊值",
                  },
                  {
                    label: "分式值为正负数",
                    value: "分式值为正负数",
                  },
                  {
                    label: "分式值为其他（非负数等）的未知数",
                    value: "分式值为其他（非负数等）的未知数",
                  },
                ],
              },
              {
                label: "能利用分式的基本性质进行约分和通分",
                value: "能利用分式的基本性质进行约分和通分",
                children: [
                  {
                    label: "最简公分母",
                    value: "最简公分母",
                  },
                  {
                    label: "分式的基本性质",
                    value: "分式的基本性质",
                  },
                  {
                    label: "分式基本性质的运用—分子分母系数化为整数",
                    value: "分式基本性质的运用—分子分母系数化为整数",
                  },
                  {
                    label: "分式基本性质的运用—未知数扩大或缩小",
                    value: "分式基本性质的运用—未知数扩大或缩小",
                  },
                  {
                    label: "分式约分",
                    value: "分式约分",
                  },
                  {
                    label: "分式通分",
                    value: "分式通分",
                  },
                  {
                    label: "倒数通分",
                    value: "倒数通分",
                  },
                  {
                    label: "分式裂项",
                    value: "分式裂项",
                  },
                ],
              },
              {
                label: "能对简单的分式进行加、减、乘、除运算",
                value: "能对简单的分式进行加、减、乘、除运算",
                children: [
                  {
                    label: "分式乘法运算",
                    value: "分式乘法运算",
                  },
                  {
                    label: "分式除法运算",
                    value: "分式除法运算",
                  },
                  {
                    label: "分式乘方运算",
                    value: "分式乘方运算",
                  },
                  {
                    label: "分式乘除混合运算",
                    value: "分式乘除混合运算",
                  },
                  {
                    label: "分式乘除、乘方混合运算",
                    value: "分式乘除、乘方混合运算",
                  },
                  {
                    label: "分式加法运算",
                    value: "分式加法运算",
                  },
                  {
                    label: "分式减法运算",
                    value: "分式减法运算",
                  },
                  {
                    label: "分式加减混合运算",
                    value: "分式加减混合运算",
                  },
                  {
                    label: "分式加减、乘除、乘方混合运算",
                    value: "分式加减、乘除、乘方混合运算",
                  },
                  {
                    label: "分式比较大小",
                    value: "分式比较大小",
                  },
                  {
                    label: "分式化简求值-直接代入数值求值",
                    value: "分式化简求值-直接代入数值求值",
                  },
                  {
                    label: "分式化简求值-整体代入求值",
                    value: "分式化简求值-整体代入求值",
                  },
                  {
                    label: "分式化简求值-见比设元再代入求值",
                    value: "分式化简求值-见比设元再代入求值",
                  },
                  {
                    label: "分式化简求值-条件化简求值",
                    value: "分式化简求值-条件化简求值",
                  },
                  {
                    label: "分式化简求值-倒数法化简求值",
                    value: "分式化简求值-倒数法化简求值",
                  },
                  {
                    label: "分式化简求值-降次化简求值",
                    value: "分式化简求值-降次化简求值",
                  },
                  {
                    label: "分离常数",
                    value: "分离常数",
                  },
                  {
                    label: "分式恒等变形",
                    value: "分式恒等变形",
                  },
                  {
                    label: "含绝对值的分式化简",
                    value: "含绝对值的分式化简",
                  },
                  {
                    label: "待定系数法解决分式“恒成立”问题（部分分式）",
                    value: "待定系数法解决分式“恒成立”问题（部分分式）",
                  },
                  {
                    label: "分式最值",
                    value: "分式最值",
                  },
                  {
                    label: "分式裂项",
                    value: "分式裂项",
                  },
                  {
                    label: "分式化简求值综合",
                    value: "分式化简求值综合",
                  },
                ],
              },
              {
                label: "了解代数推理",
                value: "了解代数推理",
                children: [
                  {
                    label: "代数式找规律",
                    value: "代数式找规律",
                  },
                  {
                    label: "算式找规律",
                    value: "算式找规律",
                  },
                  {
                    label: "数列找规律-纯数字的等比数列",
                    value: "数列找规律-纯数字的等比数列",
                  },
                  {
                    label: "数列找规律-图形类的等比数列",
                    value: "数列找规律-图形类的等比数列",
                  },
                  {
                    label: "数列找规律-等比数列的衍生数列",
                    value: "数列找规律-等比数列的衍生数列",
                  },
                  {
                    label: "数列找规律-等比数列求和",
                    value: "数列找规律-等比数列求和",
                  },
                  {
                    label: "数列找规律-符号规律",
                    value: "数列找规律-符号规律",
                  },
                  {
                    label: "数列找规律-纯数字的等差数列",
                    value: "数列找规律-纯数字的等差数列",
                  },
                  {
                    label: "数列找规律-图形类的等差数列",
                    value: "数列找规律-图形类的等差数列",
                  },
                  {
                    label: "数列找规律-二阶等差数列",
                    value: "数列找规律-二阶等差数列",
                  },
                  {
                    label: "数列找规律-等差数列求和",
                    value: "数列找规律-等差数列求和",
                  },
                  {
                    label: "数列找规律-平方数及衍生数列",
                    value: "数列找规律-平方数及衍生数列",
                  },
                  {
                    label: "数列找规律-三角形数及衍生数列",
                    value: "数列找规律-三角形数及衍生数列",
                  },
                  {
                    label: "数列找规律-具有周期规律的数列",
                    value: "数列找规律-具有周期规律的数列",
                  },
                  {
                    label: "数列找规律-隔数为零的数列",
                    value: "数列找规律-隔数为零的数列",
                  },
                  {
                    label: "数列找规律-斐波那契数列（兔子数列）",
                    value: "数列找规律-斐波那契数列（兔子数列）",
                  },
                  {
                    label: "数列找规律-其他数列规律",
                    value: "数列找规律-其他数列规律",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        label: "方程与不等式",
        value: "方程与不等式",
        children: [
          {
            label: "方程与方程组",
            value: "方程与方程组",
            children: [
              {
                label: "能根据现实情境理解方程的意义",
                value: "能根据现实情境理解方程的意义",
                children: [
                  {
                    label: "方程的定义",
                    value: "方程的定义",
                  },
                  {
                    label: "一元一次方程的定义",
                    value: "一元一次方程的定义",
                  },
                  {
                    label: "由一元一次方程的定义求参数的值",
                    value: "由一元一次方程的定义求参数的值",
                  },
                  {
                    label: "二元一次方程的定义",
                    value: "二元一次方程的定义",
                  },
                  {
                    label: "由二元一次方程定义求参数的值",
                    value: "由二元一次方程定义求参数的值",
                  },
                  {
                    label: "二元一次方程组的定义",
                    value: "二元一次方程组的定义",
                  },
                  {
                    label: "一元二次方程的定义",
                    value: "一元二次方程的定义",
                  },
                  {
                    label: "一元二次方程的一般形式",
                    value: "一元二次方程的一般形式",
                  },
                  {
                    label: "一元二次方程系数的判断",
                    value: "一元二次方程系数的判断",
                  },
                  {
                    label: "由一元二次方程定义求参数的值",
                    value: "由一元二次方程定义求参数的值",
                  },
                  {
                    label: "分式方程的定义",
                    value: "分式方程的定义",
                  },
                  {
                    label: "二元二次方程（组）",
                    value: "二元二次方程（组）",
                  },
                  {
                    label: "多元二次方程（组）",
                    value: "多元二次方程（组）",
                  },
                  {
                    label: "不定方程",
                    value: "不定方程",
                  },
                  {
                    label: "二项方程",
                    value: "二项方程",
                  },
                  {
                    label: "非二项方程",
                    value: "非二项方程",
                  },
                  {
                    label: "无理方程",
                    value: "无理方程",
                  },
                  {
                    label: "与方程有关的新定义",
                    value: "与方程有关的新定义",
                  },
                ],
              },
              {
                label: "能针对具体问题列出方程",
                value: "能针对具体问题列出方程",
                children: [
                  {
                    label: "按要求写出一元一次方程",
                    value: "按要求写出一元一次方程",
                  },
                  {
                    label: "按要求写出二元一次方程",
                    value: "按要求写出二元一次方程",
                  },
                  {
                    label: "一元一次方程的行程问题-相遇问题",
                    value: "一元一次方程的行程问题-相遇问题",
                  },
                  {
                    label: "一元一次方程的行程问题-追及问题",
                    value: "一元一次方程的行程问题-追及问题",
                  },
                  {
                    label: "一元一次方程的行程问题-环形跑道问题",
                    value: "一元一次方程的行程问题-环形跑道问题",
                  },
                  {
                    label: "一元一次方程的行程问题-变速问题",
                    value: "一元一次方程的行程问题-变速问题",
                  },
                  {
                    label: "一元一次方程的行程问题-顺风、顺水问题",
                    value: "一元一次方程的行程问题-顺风、顺水问题",
                  },
                  {
                    label: "一元一次方程的行程问题-火车过隧道和过桥问题",
                    value: "一元一次方程的行程问题-火车过隧道和过桥问题",
                  },
                  {
                    label: "一元一次方程的行程问题-上下坡问题",
                    value: "一元一次方程的行程问题-上下坡问题",
                  },
                  {
                    label: "一元一次方程的行程问题-其他的行程问题",
                    value: "一元一次方程的行程问题-其他的行程问题",
                  },
                  {
                    label: "一元一次方程的工程问题",
                    value: "一元一次方程的工程问题",
                  },
                  {
                    label: "一元一次方程的和差倍分",
                    value: "一元一次方程的和差倍分",
                  },
                  {
                    label: "一元一次方程的配套问题",
                    value: "一元一次方程的配套问题",
                  },
                  {
                    label: "一元一次方程的调配问题",
                    value: "一元一次方程的调配问题",
                  },
                  {
                    label: "一元一次方程的数字问题",
                    value: "一元一次方程的数字问题",
                  },
                  {
                    label: "一元一次方程的经济问题-利润",
                    value: "一元一次方程的经济问题-利润",
                  },
                  {
                    label: "一元一次方程的经济问题-打折",
                    value: "一元一次方程的经济问题-打折",
                  },
                  {
                    label: "一元一次方程的经济问题-储蓄",
                    value: "一元一次方程的经济问题-储蓄",
                  },
                  {
                    label: "一元一次方程的经济问题-其它",
                    value: "一元一次方程的经济问题-其它",
                  },
                  {
                    label: "一元一次方程的年龄问题",
                    value: "一元一次方程的年龄问题",
                  },
                  {
                    label: "一元一次方程的钟表问题",
                    value: "一元一次方程的钟表问题",
                  },
                  {
                    label: "一元一次方程的浓度问题",
                    value: "一元一次方程的浓度问题",
                  },
                  {
                    label: "一元一次方程的梯度计价问题",
                    value: "一元一次方程的梯度计价问题",
                  },
                  {
                    label: "一元一次方程的方案选择问题",
                    value: "一元一次方程的方案选择问题",
                  },
                  {
                    label: "一元一次方程的比赛积分问题",
                    value: "一元一次方程的比赛积分问题",
                  },
                  {
                    label: "一元一次方程的日历图表问题",
                    value: "一元一次方程的日历图表问题",
                  },
                  {
                    label: "一元一次方程的几何问题",
                    value: "一元一次方程的几何问题",
                  },
                  {
                    label: "一元一次方程的其他实际问题",
                    value: "一元一次方程的其他实际问题",
                  },
                  {
                    label: "二元一次方程的实际应用",
                    value: "二元一次方程的实际应用",
                  },
                  {
                    label: "二元一次方程组的行程问题",
                    value: "二元一次方程组的行程问题",
                  },
                  {
                    label: "二元一次方程组的工程问题",
                    value: "二元一次方程组的工程问题",
                  },
                  {
                    label: "二元一次方程组的和差倍分",
                    value: "二元一次方程组的和差倍分",
                  },
                  {
                    label: "二元一次方程组的数字问题",
                    value: "二元一次方程组的数字问题",
                  },
                  {
                    label: "二元一次方程组的配套问题",
                    value: "二元一次方程组的配套问题",
                  },
                  {
                    label: "二元一次方程组的调配问题",
                    value: "二元一次方程组的调配问题",
                  },
                  {
                    label: "二元一次方程组的经济问题",
                    value: "二元一次方程组的经济问题",
                  },
                  {
                    label: "二元一次方程组的几何问题",
                    value: "二元一次方程组的几何问题",
                  },
                  {
                    label: "二元一次方程组的梯度计价问题",
                    value: "二元一次方程组的梯度计价问题",
                  },
                  {
                    label: "二元一次方程组的方案选择问题",
                    value: "二元一次方程组的方案选择问题",
                  },
                  {
                    label: "二元一次方程组的其他实际问题",
                    value: "二元一次方程组的其他实际问题",
                  },
                  {
                    label: "按要求写出一元二次方程",
                    value: "按要求写出一元二次方程",
                  },
                ],
              },
              {
                label: "理解方程解的意义",
                value: "理解方程解的意义",
                children: [
                  {
                    label: "方程的解",
                    value: "方程的解",
                  },
                  {
                    label: "由方程的解求参数的值",
                    value: "由方程的解求参数的值",
                  },
                  {
                    label: "一元一次方程的解",
                    value: "一元一次方程的解",
                  },
                  {
                    label: "由一元一次方程的解求参数的值",
                    value: "由一元一次方程的解求参数的值",
                  },
                  {
                    label: "二元一次方程的解",
                    value: "二元一次方程的解",
                  },
                  {
                    label: "由二元一次方程的解求参数的值",
                    value: "由二元一次方程的解求参数的值",
                  },
                  {
                    label: "二元一次方程的整数解",
                    value: "二元一次方程的整数解",
                  },
                  {
                    label: "二元一次方程组的解",
                    value: "二元一次方程组的解",
                  },
                  {
                    label: "由二元一次方程组的解求参数的值",
                    value: "由二元一次方程组的解求参数的值",
                  },
                  {
                    label: "一元二次方程的根",
                    value: "一元二次方程的根",
                  },
                  {
                    label: "由一元二次方程的解求参数的值",
                    value: "由一元二次方程的解求参数的值",
                  },
                  {
                    label: "利用根求代数式的值",
                    value: "利用根求代数式的值",
                  },
                  {
                    label: "整数根-分离常数法",
                    value: "整数根-分离常数法",
                  },
                  {
                    label: "整数根-△为给定范围一次式",
                    value: "整数根-△为给定范围一次式",
                  },
                  {
                    label: "整数根-△非完全平方式的二次式",
                    value: "整数根-△非完全平方式的二次式",
                  },
                  {
                    label: "一元二次方程的有理根",
                    value: "一元二次方程的有理根",
                  },
                  {
                    label: "一元二次方程公共根",
                    value: "一元二次方程公共根",
                  },
                  {
                    label: "分式方程的解",
                    value: "分式方程的解",
                  },
                  {
                    label: "由分式方程的解确定参数",
                    value: "由分式方程的解确定参数",
                  },
                  {
                    label: "分式方程的增根问题",
                    value: "分式方程的增根问题",
                  },
                  {
                    label: "分式方程的无解问题",
                    value: "分式方程的无解问题",
                  },
                  {
                    label: "分式方程的特殊解问题",
                    value: "分式方程的特殊解问题",
                  },
                  {
                    label: "方程解的关系",
                    value: "方程解的关系",
                  },
                  {
                    label: "分式方程与不等式综合",
                    value: "分式方程与不等式综合",
                  },
                  {
                    label: "二元二次方程（组）",
                    value: "二元二次方程（组）",
                  },
                  {
                    label: "多元二次方程（组）",
                    value: "多元二次方程（组）",
                  },
                  {
                    label: "不定方程",
                    value: "不定方程",
                  },
                  {
                    label: "二项方程",
                    value: "二项方程",
                  },
                  {
                    label: "非二项方程",
                    value: "非二项方程",
                  },
                  {
                    label: "无理方程",
                    value: "无理方程",
                  },
                ],
              },
              {
                label: "经历估计方程解的过程",
                value: "经历估计方程解的过程",
                children: [
                  {
                    label: "估算一元二次方程的近似解",
                    value: "估算一元二次方程的近似解",
                  },
                ],
              },
              {
                label: "掌握等式的基本性质",
                value: "掌握等式的基本性质",
                children: [
                  {
                    label: "等式的定义",
                    value: "等式的定义",
                  },
                  {
                    label: "等式的类型",
                    value: "等式的类型",
                  },
                  {
                    label: "判断等式变形是否正确",
                    value: "判断等式变形是否正确",
                  },
                  {
                    label: "等式性质1",
                    value: "等式性质1",
                  },
                  {
                    label: "等式性质2",
                    value: "等式性质2",
                  },
                  {
                    label: "根据要求进行等式的变形",
                    value: "根据要求进行等式的变形",
                  },
                  {
                    label: "等式的性质—传递性",
                    value: "等式的性质—传递性",
                  },
                  {
                    label: "用一个未知数表示另一个未知数",
                    value: "用一个未知数表示另一个未知数",
                  },
                ],
              },
              {
                label: "能解一元一次方程和可化为一元一次方程的分式方程",
                value: "能解一元一次方程和可化为一元一次方程的分式方程",
                children: [
                  {
                    label: "解方程",
                    value: "解方程",
                  },
                  {
                    label: "解一元一次方程的一般步骤",
                    value: "解一元一次方程的一般步骤",
                  },
                  {
                    label: "常规一元一次方程解法",
                    value: "常规一元一次方程解法",
                  },
                  {
                    label: "解含小数的一元一次方程",
                    value: "解含小数的一元一次方程",
                  },
                  {
                    label: "裂项法解一元一次方程",
                    value: "裂项法解一元一次方程",
                  },
                  {
                    label: "分离法解一元一次方程",
                    value: "分离法解一元一次方程",
                  },
                  {
                    label: "换元法解一元一次方程",
                    value: "换元法解一元一次方程",
                  },
                  {
                    label: "含绝对值的一元一次方程",
                    value: "含绝对值的一元一次方程",
                  },
                  {
                    label: "解含多重括号的一元一次方程",
                    value: "解含多重括号的一元一次方程",
                  },
                  {
                    label: "解分式方程的一般步骤",
                    value: "解分式方程的一般步骤",
                  },
                  {
                    label: "解可化为一元一次方程的分式方程",
                    value: "解可化为一元一次方程的分式方程",
                  },
                  {
                    label: "含绝对值的分式方程",
                    value: "含绝对值的分式方程",
                  },
                  {
                    label: "换元法解分式方程",
                    value: "换元法解分式方程",
                  },
                  {
                    label: "一元一次方程的看错问题",
                    value: "一元一次方程的看错问题",
                  },
                  {
                    label: "解为定值问题",
                    value: "解为定值问题",
                  },
                  {
                    label: "一元一次方程的含参整数解",
                    value: "一元一次方程的含参整数解",
                  },
                  {
                    label: "求含参一元一次方程—系数含参",
                    value: "求含参一元一次方程—系数含参",
                  },
                  {
                    label: "求含参一元一次方程—系数不含参",
                    value: "求含参一元一次方程—系数不含参",
                  },
                  {
                    label: "一元一次方程的同解问题",
                    value: "一元一次方程的同解问题",
                  },
                  {
                    label: "解的情况",
                    value: "解的情况",
                  },
                ],
              },
              {
                label: "掌握消元法",
                value: "掌握消元法",
                children: [
                  {
                    label: "消元",
                    value: "消元",
                  },
                ],
              },
              {
                label: "能解二元一次方程组",
                value: "能解二元一次方程组",
                children: [
                  {
                    label: "代入消元法解二元一次方程组",
                    value: "代入消元法解二元一次方程组",
                  },
                  {
                    label: "加减消元法解二元一次方程组",
                    value: "加减消元法解二元一次方程组",
                  },
                  {
                    label: "解二元一次方程组的一般步骤",
                    value: "解二元一次方程组的一般步骤",
                  },
                  {
                    label: "不解方程组求代数式的值",
                    value: "不解方程组求代数式的值",
                  },
                  {
                    label: "巧解对称式的二元一次方程组",
                    value: "巧解对称式的二元一次方程组",
                  },
                  {
                    label: "换元法解二元一次方程组",
                    value: "换元法解二元一次方程组",
                  },
                  {
                    label: "取倒法解二元一次方程组",
                    value: "取倒法解二元一次方程组",
                  },
                  {
                    label: "解含绝对值的方程组",
                    value: "解含绝对值的方程组",
                  },
                  {
                    label: "根据解的不等关系解含参的二元一次方程组",
                    value: "根据解的不等关系解含参的二元一次方程组",
                  },
                  {
                    label: "根据解的等量关系解含参的二元一次方程组",
                    value: "根据解的等量关系解含参的二元一次方程组",
                  },
                  {
                    label: "二元一次方程组的同解问题",
                    value: "二元一次方程组的同解问题",
                  },
                  {
                    label: "二元一次方程组的看错系数问题",
                    value: "二元一次方程组的看错系数问题",
                  },
                  {
                    label: "二元一次方程组的含参整数解问题",
                    value: "二元一次方程组的含参整数解问题",
                  },
                  {
                    label: "二元一次方程组解的情况",
                    value: "二元一次方程组解的情况",
                  },
                ],
              },
              {
                label: "*能解简单的三元一次方程组",
                value: "*能解简单的三元一次方程组",
                children: [
                  {
                    label: "三元一次方程组的定义",
                    value: "三元一次方程组的定义",
                  },
                  {
                    label: "解三元一次方程组",
                    value: "解三元一次方程组",
                  },
                  {
                    label: "含比例的三元一次方程组",
                    value: "含比例的三元一次方程组",
                  },
                  {
                    label: "三元一次方程组的实际应用",
                    value: "三元一次方程组的实际应用",
                  },
                  {
                    label: "解多元一次方程组",
                    value: "解多元一次方程组",
                  },
                ],
              },
              {
                label: "理解配方法",
                value: "理解配方法",
                children: [
                  {
                    label: "配方法解一元二次方程的一般步骤",
                    value: "配方法解一元二次方程的一般步骤",
                  },
                ],
              },
              {
                label:
                  "能用配方法、公式法、因式分解法解数字系数的 一元二次方程",
                value:
                  "能用配方法、公式法、因式分解法解数字系数的 一元二次方程",
                children: [
                  {
                    label: "直接开平方法求一元二次方程的根",
                    value: "直接开平方法求一元二次方程的根",
                  },
                  {
                    label: "配方法求一元二次方程的根",
                    value: "配方法求一元二次方程的根",
                  },
                  {
                    label: "公式法解一元二次方程的一般步骤",
                    value: "公式法解一元二次方程的一般步骤",
                  },
                  {
                    label: "公式法求一元二次方程的根",
                    value: "公式法求一元二次方程的根",
                  },
                  {
                    label: "因式分解法解一元二次方程的一般步骤",
                    value: "因式分解法解一元二次方程的一般步骤",
                  },
                  {
                    label: "因式分解法求一元二次方程的根",
                    value: "因式分解法求一元二次方程的根",
                  },
                  {
                    label: "指定方法求一元二次方程的根",
                    value: "指定方法求一元二次方程的根",
                  },
                  {
                    label: "解可化为一元二次方程的分式方程",
                    value: "解可化为一元二次方程的分式方程",
                  },
                  {
                    label: "换元法求一元二次方程的根",
                    value: "换元法求一元二次方程的根",
                  },
                  {
                    label: "含绝对值的一元二次方程",
                    value: "含绝对值的一元二次方程",
                  },
                  {
                    label: "需分类讨论的含参一元二次方程",
                    value: "需分类讨论的含参一元二次方程",
                  },
                ],
              },
              {
                label:
                  "会用一元二次方程根的判别式判别方程是否有实根及两个实根是否相等",
                value:
                  "会用一元二次方程根的判别式判别方程是否有实根及两个实根是否相等",
                children: [
                  {
                    label: "一元二次方程根的判别式",
                    value: "一元二次方程根的判别式",
                  },
                  {
                    label: "由一元二次方程根的情况确定参数",
                    value: "由一元二次方程根的情况确定参数",
                  },
                  {
                    label: "与三角形三边关系结合",
                    value: "与三角形三边关系结合",
                  },
                  {
                    label: "与等腰三角形结合",
                    value: "与等腰三角形结合",
                  },
                ],
              },
              {
                label: "了解一元二次方程的根与系数的关系",
                value: "了解一元二次方程的根与系数的关系",
                children: [
                  {
                    label: "一元二次方程根与系数的关系",
                    value: "一元二次方程根与系数的关系",
                  },
                  {
                    label: "利用构造的方程求解",
                    value: "利用构造的方程求解",
                  },
                ],
              },
              {
                label: "能根据具体问题的实际意义，检验方程解的合理性",
                value: "能根据具体问题的实际意义，检验方程解的合理性",
                children: [
                  {
                    label: "一元二次方程的增长率问题",
                    value: "一元二次方程的增长率问题",
                  },
                  {
                    label: "一元二次方程的利润问题",
                    value: "一元二次方程的利润问题",
                  },
                  {
                    label: "一元二次方程的几何问题",
                    value: "一元二次方程的几何问题",
                  },
                  {
                    label: "一元二次方程的传播问题",
                    value: "一元二次方程的传播问题",
                  },
                  {
                    label: "一元二次方程的握手、送礼物问题",
                    value: "一元二次方程的握手、送礼物问题",
                  },
                  {
                    label: "一元二次方程的其他实际问题",
                    value: "一元二次方程的其他实际问题",
                  },
                  {
                    label: "分式方程的行程问题",
                    value: "分式方程的行程问题",
                  },
                  {
                    label: "分式方程的工程问题",
                    value: "分式方程的工程问题",
                  },
                  {
                    label: "分式方程的和差倍分",
                    value: "分式方程的和差倍分",
                  },
                  {
                    label: "分式方程的经济问题",
                    value: "分式方程的经济问题",
                  },
                  {
                    label: "分式方程的其他实际问题",
                    value: "分式方程的其他实际问题",
                  },
                ],
              },
            ],
          },
          {
            label: "不等式与不等式组",
            value: "不等式与不等式组",
            children: [
              {
                label: "结合具体问题，了解不等式的意义",
                value: "结合具体问题，了解不等式的意义",
                children: [
                  {
                    label: "不等式的定义",
                    value: "不等式的定义",
                  },
                  {
                    label: "一元一次不等式的定义",
                    value: "一元一次不等式的定义",
                  },
                  {
                    label: "一元一次不等式组的定义",
                    value: "一元一次不等式组的定义",
                  },
                ],
              },
              {
                label: "结合具体问题，探索不等式的基本性质",
                value: "结合具体问题，探索不等式的基本性质",
                children: [
                  {
                    label: "不等式的性质",
                    value: "不等式的性质",
                  },
                  {
                    label: "判断不等式的变形是否正确",
                    value: "判断不等式的变形是否正确",
                  },
                  {
                    label: "关于不等式的性质的命题",
                    value: "关于不等式的性质的命题",
                  },
                ],
              },
              {
                label: "能解数字系数的一元一次不等式",
                value: "能解数字系数的一元一次不等式",
                children: [
                  {
                    label: "不等式的解（集）",
                    value: "不等式的解（集）",
                  },
                  {
                    label: "利用不等式性质解不等式",
                    value: "利用不等式性质解不等式",
                  },
                  {
                    label: "一元一次不等式的解集",
                    value: "一元一次不等式的解集",
                  },
                  {
                    label: "解一元一次不等式的一般步骤",
                    value: "解一元一次不等式的一般步骤",
                  },
                  {
                    label: "解一元一次不等式",
                    value: "解一元一次不等式",
                  },
                  {
                    label: "一元一次不等式的整数解",
                    value: "一元一次不等式的整数解",
                  },
                  {
                    label: "一元一次不等式组的解集",
                    value: "一元一次不等式组的解集",
                  },
                  {
                    label: "解一元一次不等式组的一般步骤",
                    value: "解一元一次不等式组的一般步骤",
                  },
                  {
                    label: "解一元一次不等式组",
                    value: "解一元一次不等式组",
                  },
                  {
                    label: "解三连的一元一次不等式",
                    value: "解三连的一元一次不等式",
                  },
                  {
                    label: "一元一次不等式组的整数解",
                    value: "一元一次不等式组的整数解",
                  },
                  {
                    label: "解含绝对值的一元一次不等式（组）",
                    value: "解含绝对值的一元一次不等式（组）",
                  },
                ],
              },
              {
                label: "能在数轴上表示出数字系数的一元一次不等式的解集",
                value: "能在数轴上表示出数字系数的一元一次不等式的解集",
                children: [
                  {
                    label: "在数轴上表示不等式的解集",
                    value: "在数轴上表示不等式的解集",
                  },
                ],
              },
              {
                label: "会用数轴确定两个一元一次不等式组成的不等式组的解集",
                value: "会用数轴确定两个一元一次不等式组成的不等式组的解集",
                children: [
                  {
                    label: "在数轴上表示不等式组的解集",
                    value: "在数轴上表示不等式组的解集",
                  },
                ],
              },
              {
                label:
                  "能根据具体问题中的数量关系，列出一元一次不等式，解决简单的问题",
                value:
                  "能根据具体问题中的数量关系，列出一元一次不等式，解决简单的问题",
                children: [
                  {
                    label: "列不等式",
                    value: "列不等式",
                  },
                  {
                    label: "一元一次不等式的实际应用",
                    value: "一元一次不等式的实际应用",
                  },
                  {
                    label: "不等式组的行程问题",
                    value: "不等式组的行程问题",
                  },
                  {
                    label: "不等式组的工程问题",
                    value: "不等式组的工程问题",
                  },
                  {
                    label: "不等式组的和差倍分",
                    value: "不等式组的和差倍分",
                  },
                  {
                    label: "不等式组的分配问题",
                    value: "不等式组的分配问题",
                  },
                  {
                    label: "不等式组的经济问题",
                    value: "不等式组的经济问题",
                  },
                  {
                    label: "不等式组的梯度计价问题",
                    value: "不等式组的梯度计价问题",
                  },
                  {
                    label: "不等式组的方案选择问题",
                    value: "不等式组的方案选择问题",
                  },
                  {
                    label: "不等式组的其他实际问题",
                    value: "不等式组的其他实际问题",
                  },
                  {
                    label: "已知方程（组）解的范围，求参数范围",
                    value: "已知方程（组）解的范围，求参数范围",
                  },
                  {
                    label: "已知方程组解的关系，求参数范围",
                    value: "已知方程组解的关系，求参数范围",
                  },
                  {
                    label: "不等式（组）解的情况确定参数的范围",
                    value: "不等式（组）解的情况确定参数的范围",
                  },
                  {
                    label: "由一个已知不等式的解集求另一个不等式的解集",
                    value: "由一个已知不等式的解集求另一个不等式的解集",
                  },
                  {
                    label: "由不等式（组）的整数解情况求参数范围",
                    value: "由不等式（组）的整数解情况求参数范围",
                  },
                  {
                    label: "由不等式（组）的解集求参数的范围",
                    value: "由不等式（组）的解集求参数的范围",
                  },
                  {
                    label: "分类讨论一元一次不等式解的情况",
                    value: "分类讨论一元一次不等式解的情况",
                  },
                  {
                    label: "分类讨论一元一次不等式组解的情况",
                    value: "分类讨论一元一次不等式组解的情况",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        label: "函数",
        value: "函数",
        children: [
          {
            label: "函数的概念",
            value: "函数的概念",
            children: [
              {
                label: "探索简单实例中的数量关系和变化规律",
                value: "探索简单实例中的数量关系和变化规律",
                children: [
                  {
                    label: "常量与变量的定义",
                    value: "常量与变量的定义",
                  },
                ],
              },
              {
                label: "了解常量、变量的意义",
                value: "了解常量、变量的意义",
                children: [
                  {
                    label: "常量与变量的定义",
                    value: "常量与变量的定义",
                  },
                ],
              },
              {
                label: "了解函数的概念和表示法",
                value: "了解函数的概念和表示法",
                children: [
                  {
                    label: "函数的定义",
                    value: "函数的定义",
                  },
                  {
                    label: "函数的表示方法（列表法、图象法、解析式法）",
                    value: "函数的表示方法（列表法、图象法、解析式法）",
                  },
                ],
              },
              {
                label: "能举出函数的实例",
                value: "能举出函数的实例",
                children: [
                  {
                    label: "函数的定义",
                    value: "函数的定义",
                  },
                ],
              },
              {
                label: "能结合图象对简单实际问题中的函数关系进行分析",
                value: "能结合图象对简单实际问题中的函数关系进行分析",
                children: [
                  {
                    label: "画函数图象",
                    value: "画函数图象",
                  },
                  {
                    label: "函数的图象",
                    value: "函数的图象",
                  },
                  {
                    label: "函数图象与实际问题",
                    value: "函数图象与实际问题",
                  },
                  {
                    label: "由动点判断函数图象",
                    value: "由动点判断函数图象",
                  },
                  {
                    label: "由函数图象判断参照点位置",
                    value: "由函数图象判断参照点位置",
                  },
                  {
                    label: "由函数图象判断运动路径",
                    value: "由函数图象判断运动路径",
                  },
                  {
                    label: "由函数图象判断动点",
                    value: "由函数图象判断动点",
                  },
                  {
                    label: "由函数图象求函数的值",
                    value: "由函数图象求函数的值",
                  },
                ],
              },
              {
                label: "能确定简单实际问题中函数自变量的取值范围",
                value: "能确定简单实际问题中函数自变量的取值范围",
                children: [
                  {
                    label: "函数自变量的取值范围",
                    value: "函数自变量的取值范围",
                  },
                ],
              },
              {
                label: "会求函数值",
                value: "会求函数值",
                children: [
                  {
                    label: "函数值",
                    value: "函数值",
                  },
                ],
              },
              {
                label:
                  "能用适当的函数表示法刻画简单实际问题中变量之间的关系， 理解函数值的意义。",
                value:
                  "能用适当的函数表示法刻画简单实际问题中变量之间的关系， 理解函数值的意义。",
                children: [
                  {
                    label: "根据题意列函数关系式",
                    value: "根据题意列函数关系式",
                  },
                  {
                    label: "函数解析式",
                    value: "函数解析式",
                  },
                  {
                    label: "根据条件列二次函数关系式",
                    value: "根据条件列二次函数关系式",
                  },
                  {
                    label: "分段函数",
                    value: "分段函数",
                  },
                ],
              },
              {
                label: "结合对函数关系的分析，能对变量的变化情况进行初步讨论。",
                value: "结合对函数关系的分析，能对变量的变化情况进行初步讨论。",
                children: [
                  {
                    label: "探究函数性质",
                    value: "探究函数性质",
                  },
                  {
                    label: "Min函数",
                    value: "Min函数",
                  },
                  {
                    label: "Max函数",
                    value: "Max函数",
                  },
                  {
                    label: "与函数有关的新定义",
                    value: "与函数有关的新定义",
                  },
                ],
              },
            ],
          },
          {
            label: "一次函数",
            value: "一次函数",
            children: [
              {
                label: "结合具体情境体会一次函数的意义",
                value: "结合具体情境体会一次函数的意义",
                children: [
                  {
                    label: "一次函数的定义",
                    value: "一次函数的定义",
                  },
                  {
                    label: "根据一次函数定义求参数",
                    value: "根据一次函数定义求参数",
                  },
                  {
                    label: "点在一次函数图象上",
                    value: "点在一次函数图象上",
                  },
                ],
              },
              {
                label: "能根据已知条件确定一次函数的表达式",
                value: "能根据已知条件确定一次函数的表达式",
                children: [
                  {
                    label: "根据条件写一次函数解析式",
                    value: "根据条件写一次函数解析式",
                  },
                  {
                    label: "成比例类型求一次函数解析式",
                    value: "成比例类型求一次函数解析式",
                  },
                  {
                    label: "已知增减性求一次函数解析式",
                    value: "已知增减性求一次函数解析式",
                  },
                  {
                    label: "已知平行求一次函数解析式",
                    value: "已知平行求一次函数解析式",
                  },
                  {
                    label: "已知截距求一次函数解析式",
                    value: "已知截距求一次函数解析式",
                  },
                  {
                    label: "已知面积求一次函数解析式",
                    value: "已知面积求一次函数解析式",
                  },
                  {
                    label: "已知直线与坐标轴夹角求一次函数解析式",
                    value: "已知直线与坐标轴夹角求一次函数解析式",
                  },
                ],
              },
              {
                label: "会运用待定系数法确定一次函数的表达式",
                value: "会运用待定系数法确定一次函数的表达式",
                children: [
                  {
                    label: "已知两点求一次函数解析式",
                    value: "已知两点求一次函数解析式",
                  },
                ],
              },
              {
                label: "能画一次函数的图象",
                value: "能画一次函数的图象",
                children: [
                  {
                    label: "画一次函数图象",
                    value: "画一次函数图象",
                  },
                ],
              },
              {
                label:
                  "根据图象和表达式$y= kx+b(k\\neq 0)  $ 探索并理解k>0 和 k<0时图象的变化情况",
                value:
                  "根据图象和表达式$y= kx+b(k\\neq 0)  $ 探索并理解k>0 和 k<0时图象的变化情况",
                children: [
                  {
                    label: "一次函数的增减性",
                    value: "一次函数的增减性",
                  },
                  {
                    label: "一次函数的图象特征与性质",
                    value: "一次函数的图象特征与性质",
                  },
                  {
                    label: "根据系数判断一次函数图象分布",
                    value: "根据系数判断一次函数图象分布",
                  },
                  {
                    label: "根据一次函数图象分布求系数",
                    value: "根据一次函数图象分布求系数",
                  },
                  {
                    label: "一次函数图象与x轴、y轴交点",
                    value: "一次函数图象与x轴、y轴交点",
                  },
                  {
                    label: "一次函数图象综合",
                    value: "一次函数图象综合",
                  },
                ],
              },
              {
                label: "理解正比例函数",
                value: "理解正比例函数",
                children: [
                  {
                    label: "正比例函数的定义",
                    value: "正比例函数的定义",
                  },
                  {
                    label: "根据正比例函数定义求参数",
                    value: "根据正比例函数定义求参数",
                  },
                  {
                    label: "画正比例函数图象",
                    value: "画正比例函数图象",
                  },
                  {
                    label: "正比例函数图象与性质",
                    value: "正比例函数图象与性质",
                  },
                  {
                    label: "正比例函数解析式",
                    value: "正比例函数解析式",
                  },
                  {
                    label: "点在正比例函数图象",
                    value: "点在正比例函数图象",
                  },
                  {
                    label: "正比例函数与几何综合",
                    value: "正比例函数与几何综合",
                  },
                  {
                    label: "正比例函数的实际问题",
                    value: "正比例函数的实际问题",
                  },
                  {
                    label: "一次函数与正比例函数的区别和联系",
                    value: "一次函数与正比例函数的区别和联系",
                  },
                ],
              },
              {
                label: "体会一次函数与二元一次方程的关系",
                value: "体会一次函数与二元一次方程的关系",
                children: [
                  {
                    label: "一次函数与一元一次方程",
                    value: "一次函数与一元一次方程",
                  },
                  {
                    label: "一次函数与二元一次方程组",
                    value: "一次函数与二元一次方程组",
                  },
                  {
                    label: "一次函数与一元一次不等式",
                    value: "一次函数与一元一次不等式",
                  },
                  {
                    label: "两条直线的交点问题",
                    value: "两条直线的交点问题",
                  },
                ],
              },
              {
                label: "能用一次函数解决简单实际问题",
                value: "能用一次函数解决简单实际问题",
                children: [
                  {
                    label: "一次函数的依据图象解决实际问题",
                    value: "一次函数的依据图象解决实际问题",
                  },
                  {
                    label: "一次函数的工程问题",
                    value: "一次函数的工程问题",
                  },
                  {
                    label: "一次函数的行程问题",
                    value: "一次函数的行程问题",
                  },
                  {
                    label: "一次函数的利润最值问题",
                    value: "一次函数的利润最值问题",
                  },
                  {
                    label: "一次函数的梯度计价问题",
                    value: "一次函数的梯度计价问题",
                  },
                  {
                    label: "一次函数的方案优选问题",
                    value: "一次函数的方案优选问题",
                  },
                  {
                    label: "一次函数的其他实际问题",
                    value: "一次函数的其他实际问题",
                  },
                  {
                    label: "一次函数与找规律",
                    value: "一次函数与找规律",
                  },
                  {
                    label: "一次函数与线段问题",
                    value: "一次函数与线段问题",
                  },
                  {
                    label: "一次函数与几何图形公共点问题",
                    value: "一次函数与几何图形公共点问题",
                  },
                  {
                    label: "一次函数与整点问题",
                    value: "一次函数与整点问题",
                  },
                  {
                    label: "一次函数与折叠问题",
                    value: "一次函数与折叠问题",
                  },
                  {
                    label: "公式法求面积",
                    value: "公式法求面积",
                  },
                  {
                    label: "割补法求面积",
                    value: "割补法求面积",
                  },
                  {
                    label: "铅锤法求面积",
                    value: "铅锤法求面积",
                  },
                  {
                    label: "一次函数与轴对称最值问题",
                    value: "一次函数与轴对称最值问题",
                  },
                  {
                    label: "一次函数与等腰三角形结合",
                    value: "一次函数与等腰三角形结合",
                  },
                  {
                    label: "一次函数与直角三角形结合",
                    value: "一次函数与直角三角形结合",
                  },
                  {
                    label: "一次函数与等腰直角三角形",
                    value: "一次函数与等腰直角三角形",
                  },
                  {
                    label: "一次函数与等边三角形",
                    value: "一次函数与等边三角形",
                  },
                  {
                    label: "一次函数与全等三角形结合",
                    value: "一次函数与全等三角形结合",
                  },
                  {
                    label: "一次函数与相似三角形结合",
                    value: "一次函数与相似三角形结合",
                  },
                  {
                    label: "一次函数与平行四边形",
                    value: "一次函数与平行四边形",
                  },
                  {
                    label: "一次函数与特殊平行四边形",
                    value: "一次函数与特殊平行四边形",
                  },
                  {
                    label: "一次函数与梯形",
                    value: "一次函数与梯形",
                  },
                  {
                    label: "一次函数与圆的综合问题",
                    value: "一次函数与圆的综合问题",
                  },
                  {
                    label: "一次函数与动点问题",
                    value: "一次函数与动点问题",
                  },
                  {
                    label: "利用两条直线垂直的k的关系解决问题",
                    value: "利用两条直线垂直的k的关系解决问题",
                  },
                ],
              },
            ],
          },
          {
            label: "二次函数",
            value: "二次函数",
            children: [
              {
                label: "通过对实际问题的分析，体会二次函数的意义",
                value: "通过对实际问题的分析，体会二次函数的意义",
                children: [
                  {
                    label: "二次函数的定义",
                    value: "二次函数的定义",
                  },
                  {
                    label: "利用二次函数的定义求参数的值",
                    value: "利用二次函数的定义求参数的值",
                  },
                  {
                    label: "点在二次函数图象上",
                    value: "点在二次函数图象上",
                  },
                ],
              },
              {
                label: "能画二次函数的图象",
                value: "能画二次函数的图象",
                children: [
                  {
                    label: "画二次函数的图象",
                    value: "画二次函数的图象",
                  },
                ],
              },
              {
                label: "通过图象了解二次函数的性质",
                value: "通过图象了解二次函数的性质",
                children: [
                  {
                    label: "二次函数y=ax^2的图象和性质",
                    value: "二次函数y=ax^2的图象和性质",
                  },
                  {
                    label: "二次函数y=a（x-h)^2的图象和性质",
                    value: "二次函数y=a（x-h)^2的图象和性质",
                  },
                  {
                    label: "二次函数y=a（x-h)^2+k的图象和性质",
                    value: "二次函数y=a（x-h)^2+k的图象和性质",
                  },
                  {
                    label: "直接求对称轴",
                    value: "直接求对称轴",
                  },
                  {
                    label: "已知抛物线上对称的两点求对称轴",
                    value: "已知抛物线上对称的两点求对称轴",
                  },
                  {
                    label: "根据二次函数的对称性求函数值",
                    value: "根据二次函数的对称性求函数值",
                  },
                  {
                    label: "二次函数y=ax^2+bx+c 的顶点",
                    value: "二次函数y=ax^2+bx+c 的顶点",
                  },
                  {
                    label: "二次函数y=ax^2+bx+c 的增减性",
                    value: "二次函数y=ax^2+bx+c 的增减性",
                  },
                  {
                    label: "二次函数与找规律",
                    value: "二次函数与找规律",
                  },
                  {
                    label: "利用二次函数对称性解决取值问题",
                    value: "利用二次函数对称性解决取值问题",
                  },
                  {
                    label: "二次函数与定点问题",
                    value: "二次函数与定点问题",
                  },
                ],
              },
              {
                label: "知道二 次函数系数与图象形状和对称轴的关系",
                value: "知道二 次函数系数与图象形状和对称轴的关系",
                children: [
                  {
                    label: "参数a，b，c对二次函数图象的影响",
                    value: "参数a，b，c对二次函数图象的影响",
                  },
                  {
                    label: "根据二次函数图象判断参数符号",
                    value: "根据二次函数图象判断参数符号",
                  },
                  {
                    label: "关于a、b、c代数式的取值问题",
                    value: "关于a、b、c代数式的取值问题",
                  },
                  {
                    label: "一次函数与二次函数图象的综合判断",
                    value: "一次函数与二次函数图象的综合判断",
                  },
                  {
                    label: "反比例函数与二次函数图象的综合判断",
                    value: "反比例函数与二次函数图象的综合判断",
                  },
                  {
                    label: "两个二次函数图象综合判断",
                    value: "两个二次函数图象综合判断",
                  },
                ],
              },
              {
                label: "会求二次函数的最大值或最小值",
                value: "会求二次函数的最大值或最小值",
                children: [
                  {
                    label: "实数范围内求二次函数最值",
                    value: "实数范围内求二次函数最值",
                  },
                  {
                    label: "给定范围求二次函数最值",
                    value: "给定范围求二次函数最值",
                  },
                  {
                    label: "定轴动区间函数的最值问题",
                    value: "定轴动区间函数的最值问题",
                  },
                  {
                    label: "定区间动轴函数的最值问题",
                    value: "定区间动轴函数的最值问题",
                  },
                  {
                    label: "动轴动区间函数的最值问题",
                    value: "动轴动区间函数的最值问题",
                  },
                ],
              },
              {
                label: "能确定二次函数为最大值或最小值时相应自变量的值",
                value: "能确定二次函数为最大值或最小值时相应自变量的值",
                children: [
                  {
                    label: "定轴动区间函数的最值问题",
                    value: "定轴动区间函数的最值问题",
                  },
                  {
                    label: "定区间动轴函数的最值问题",
                    value: "定区间动轴函数的最值问题",
                  },
                  {
                    label: "动轴动区间函数的最值问题",
                    value: "动轴动区间函数的最值问题",
                  },
                  {
                    label: "利用二次函数解不等式问题",
                    value: "利用二次函数解不等式问题",
                  },
                  {
                    label: "图象法解高次不等式",
                    value: "图象法解高次不等式",
                  },
                ],
              },
              {
                label: "能解决与二次函数的最大值或最小值相关的实际问题",
                value: "能解决与二次函数的最大值或最小值相关的实际问题",
                children: [
                  {
                    label: "二次函数一般式",
                    value: "二次函数一般式",
                  },
                  {
                    label: "二次函数顶点式",
                    value: "二次函数顶点式",
                  },
                  {
                    label: "二次函数双根式（交点式）",
                    value: "二次函数双根式（交点式）",
                  },
                  {
                    label: "二次函数对称点式",
                    value: "二次函数对称点式",
                  },
                  {
                    label: "二次函数解析式间转化",
                    value: "二次函数解析式间转化",
                  },
                  {
                    label: "二次函数的利润问题",
                    value: "二次函数的利润问题",
                  },
                  {
                    label: "二次函数的几何问题",
                    value: "二次函数的几何问题",
                  },
                  {
                    label: "二次函数的轨迹问题",
                    value: "二次函数的轨迹问题",
                  },
                  {
                    label: "二次函数的通行问题",
                    value: "二次函数的通行问题",
                  },
                  {
                    label: "建立平面直角坐标系解抛物线的实际问题",
                    value: "建立平面直角坐标系解抛物线的实际问题",
                  },
                  {
                    label: "二次函数的其他实际问题",
                    value: "二次函数的其他实际问题",
                  },
                  {
                    label: "二次函数与反比例函数综合",
                    value: "二次函数与反比例函数综合",
                  },
                  {
                    label: "动直线（线段）与定抛物线交点问题",
                    value: "动直线（线段）与定抛物线交点问题",
                  },
                  {
                    label: "定直线（线段）与动抛物线交点问题",
                    value: "定直线（线段）与动抛物线交点问题",
                  },
                  {
                    label: "动直线（线段）与动抛物线交点问题",
                    value: "动直线（线段）与动抛物线交点问题",
                  },
                  {
                    label: "二次函数与几何图形交点问题",
                    value: "二次函数与几何图形交点问题",
                  },
                  {
                    label: "二次函数与整点问题",
                    value: "二次函数与整点问题",
                  },
                  {
                    label: "二次函数与线段和差问题",
                    value: "二次函数与线段和差问题",
                  },
                  {
                    label: "二次函数与面积",
                    value: "二次函数与面积",
                  },
                  {
                    label: "二次函数与几何最值问题",
                    value: "二次函数与几何最值问题",
                  },
                  {
                    label: "二次函数与等腰三角形结合",
                    value: "二次函数与等腰三角形结合",
                  },
                  {
                    label: "二次函数与直角三角形结合",
                    value: "二次函数与直角三角形结合",
                  },
                  {
                    label: "二次函数与等腰直角三角形结合",
                    value: "二次函数与等腰直角三角形结合",
                  },
                  {
                    label: "二次函数与等边三角形结合",
                    value: "二次函数与等边三角形结合",
                  },
                  {
                    label: "二次函数与相似三角形结合",
                    value: "二次函数与相似三角形结合",
                  },
                  {
                    label: "二次函数与全等三角形结合",
                    value: "二次函数与全等三角形结合",
                  },
                  {
                    label: "二次函数与平行四边形",
                    value: "二次函数与平行四边形",
                  },
                  {
                    label: "二次函数与特殊平行四边形",
                    value: "二次函数与特殊平行四边形",
                  },
                  {
                    label: "二次函数与梯形",
                    value: "二次函数与梯形",
                  },
                  {
                    label: "二次函数与轴对称问题",
                    value: "二次函数与轴对称问题",
                  },
                  {
                    label: "二次函数与圆的综合问题",
                    value: "二次函数与圆的综合问题",
                  },
                  {
                    label: "二次函数与角度问题",
                    value: "二次函数与角度问题",
                  },
                  {
                    label: "二次函数与动点问题",
                    value: "二次函数与动点问题",
                  },
                ],
              },
              {
                label: "知道二次函数和一元二次方程之间的关系",
                value: "知道二次函数和一元二次方程之间的关系",
                children: [
                  {
                    label: "二次函数与一元二次方程的关系",
                    value: "二次函数与一元二次方程的关系",
                  },
                  {
                    label: "二次函数与坐标轴交点",
                    value: "二次函数与坐标轴交点",
                  },
                  {
                    label: "一次函数与二次函数的交点",
                    value: "一次函数与二次函数的交点",
                  },
                  {
                    label: "利用二次函数解不等式问题",
                    value: "利用二次函数解不等式问题",
                  },
                  {
                    label: "图象法解高次不等式",
                    value: "图象法解高次不等式",
                  },
                ],
              },
              {
                label: "会利用二次函数的图象求一元二次方程的近似解",
                value: "会利用二次函数的图象求一元二次方程的近似解",
                children: [
                  {
                    label: "图象法求一元二次方程的近似根",
                    value: "图象法求一元二次方程的近似根",
                  },
                ],
              },
            ],
          },
          {
            label: "反比例函数",
            value: "反比例函数",
            children: [
              {
                label:
                  "结合具体情境体会反比例函数的意义,能根据已知条 件确定反比例函数的表达式。",
                value:
                  "结合具体情境体会反比例函数的意义,能根据已知条 件确定反比例函数的表达式。",
                children: [
                  {
                    label: "反比例函数的定义",
                    value: "反比例函数的定义",
                  },
                  {
                    label: "根据反比例函数定义解题",
                    value: "根据反比例函数定义解题",
                  },
                  {
                    label: "点在反比例函数图象上",
                    value: "点在反比例函数图象上",
                  },
                  {
                    label: "求反比例函数自变量或函数值（范围）",
                    value: "求反比例函数自变量或函数值（范围）",
                  },
                ],
              },
              {
                label: "能根据已知条件确定反比例函数的表达式",
                value: "能根据已知条件确定反比例函数的表达式",
                children: [
                  {
                    label: "待定系数法求反比例函数解析式",
                    value: "待定系数法求反比例函数解析式",
                  },
                  {
                    label: "根据条件求反比例函数解析式（或k的值）",
                    value: "根据条件求反比例函数解析式（或k的值）",
                  },
                ],
              },
              {
                label: "能画反比例函数的图象",
                value: "能画反比例函数的图象",
                children: [
                  {
                    label: "反比例函数图象",
                    value: "反比例函数图象",
                  },
                ],
              },
              {
                label:
                  "根据图象和表达式$y=\\frac{k}{x} (k\\neq0) $探索并理解k>0和 k<0时图象的变化情况",
                value:
                  "根据图象和表达式$y=\\frac{k}{x} (k\\neq0) $探索并理解k>0和 k<0时图象的变化情况",
                children: [
                  {
                    label: "反比例函数的性质",
                    value: "反比例函数的性质",
                  },
                  {
                    label: "反比例函数轴对称性",
                    value: "反比例函数轴对称性",
                  },
                  {
                    label: "反比例函数中心对称性",
                    value: "反比例函数中心对称性",
                  },
                  {
                    label: "根据反比例函数图象分布求参数的值（取值范围）",
                    value: "根据反比例函数图象分布求参数的值（取值范围）",
                  },
                  {
                    label: "反比例函数增减性",
                    value: "反比例函数增减性",
                  },
                  {
                    label: "反比例函数系数与图象关系",
                    value: "反比例函数系数与图象关系",
                  },
                  {
                    label: "反比例函数与方程、不等式",
                    value: "反比例函数与方程、不等式",
                  },
                  {
                    label: "判断反比例函数与一次函数图象",
                    value: "判断反比例函数与一次函数图象",
                  },
                  {
                    label: "反比例函数与正比例函数的区别与联系",
                    value: "反比例函数与正比例函数的区别与联系",
                  },
                  {
                    label: "求反比例函数与一次函数交点坐标",
                    value: "求反比例函数与一次函数交点坐标",
                  },
                  {
                    label: "判断反比例函数与一次函数交点个数",
                    value: "判断反比例函数与一次函数交点个数",
                  },
                ],
              },
              {
                label: "能用反比例函数解决简单实际问题",
                value: "能用反比例函数解决简单实际问题",
                children: [
                  {
                    label: "反比例函数的实际应用",
                    value: "反比例函数的实际应用",
                  },
                  {
                    label: "反比例函数与找规律",
                    value: "反比例函数与找规律",
                  },
                  {
                    label: "反比例函数与一次函数综合",
                    value: "反比例函数与一次函数综合",
                  },
                  {
                    label: "反比例函数的系数k的几何意义",
                    value: "反比例函数的系数k的几何意义",
                  },
                  {
                    label: "反比例函数中三角形面积与梯形面积的转化",
                    value: "反比例函数中三角形面积与梯形面积的转化",
                  },
                  {
                    label: "反比例函数与整点问题",
                    value: "反比例函数与整点问题",
                  },
                  {
                    label: "反比例函数与线段问题",
                    value: "反比例函数与线段问题",
                  },
                  {
                    label: "反比例函数与最值问题",
                    value: "反比例函数与最值问题",
                  },
                  {
                    label: "反比例函数与几何图形公共点问题",
                    value: "反比例函数与几何图形公共点问题",
                  },
                  {
                    label: "反比例函数与三角形综合",
                    value: "反比例函数与三角形综合",
                  },
                  {
                    label: "反比例函数与三角形的全等",
                    value: "反比例函数与三角形的全等",
                  },
                  {
                    label: "反比例函数与三角形的相似",
                    value: "反比例函数与三角形的相似",
                  },
                  {
                    label: "反比例函数与四边形综合",
                    value: "反比例函数与四边形综合",
                  },
                  {
                    label: "反比例函数与圆综合",
                    value: "反比例函数与圆综合",
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    label: "图形与几何",
    value: "图形与几何",
    children: [
      {
        label: "图形的性质",
        value: "图形的性质",
        children: [
          {
            label: "点、线、面、角",
            value: "点、线、面、角",
            children: [
              {
                label:
                  "通过实物和模型，了解从物体抽象出来的几何体、平面、直线 和点等概念",
                value:
                  "通过实物和模型，了解从物体抽象出来的几何体、平面、直线 和点等概念",
                children: [
                  {
                    label: "圆柱的形成",
                    value: "圆柱的形成",
                  },
                  {
                    label: "圆柱的底面、侧面、高",
                    value: "圆柱的底面、侧面、高",
                  },
                  {
                    label: "圆柱的展开图",
                    value: "圆柱的展开图",
                  },
                  {
                    label: "圆锥的形成",
                    value: "圆锥的形成",
                  },
                  {
                    label: "圆锥的底面、侧面、高的认识",
                    value: "圆锥的底面、侧面、高的认识",
                  },
                  {
                    label: "圆锥的展开图",
                    value: "圆锥的展开图",
                  },
                  {
                    label: "认识图形",
                    value: "认识图形",
                  },
                  {
                    label: "点线面体",
                    value: "点线面体",
                  },
                  {
                    label: "立体图形中的顶点、棱与面",
                    value: "立体图形中的顶点、棱与面",
                  },
                  {
                    label: "欧拉公式",
                    value: "欧拉公式",
                  },
                  {
                    label: "旋转得到的立体图形",
                    value: "旋转得到的立体图形",
                  },
                  {
                    label: "截一个几何体",
                    value: "截一个几何体",
                  },
                  {
                    label: "图形的截面形状",
                    value: "图形的截面形状",
                  },
                  {
                    label: "正方体展开图",
                    value: "正方体展开图",
                  },
                  {
                    label: "其他立体图形展开图",
                    value: "其他立体图形展开图",
                  },
                  {
                    label: "由展开图判断几何问题",
                    value: "由展开图判断几何问题",
                  },
                  {
                    label: "正方体的对、邻面",
                    value: "正方体的对、邻面",
                  },
                  {
                    label: "展开图还原成常见几何体",
                    value: "展开图还原成常见几何体",
                  },
                  {
                    label: "直线的定义及其表示方法",
                    value: "直线的定义及其表示方法",
                  },
                  {
                    label: "射线的定义及其表示方法",
                    value: "射线的定义及其表示方法",
                  },
                  {
                    label: "线段的定义及其表示方法",
                    value: "线段的定义及其表示方法",
                  },
                  {
                    label: "按要求作直线、射线和线段",
                    value: "按要求作直线、射线和线段",
                  },
                  {
                    label: "直线、射线、线段的区别与联系",
                    value: "直线、射线、线段的区别与联系",
                  },
                  {
                    label: "点与线的作图题",
                    value: "点与线的作图题",
                  },
                  {
                    label: "求常见几何体的表面积",
                    value: "求常见几何体的表面积",
                  },
                  {
                    label: "正方体堆积图形的问题",
                    value: "正方体堆积图形的问题",
                  },
                  {
                    label: "求正方体堆积的立体图形的表面积",
                    value: "求正方体堆积的立体图形的表面积",
                  },
                  {
                    label: "点与线的位置关系找规律",
                    value: "点与线的位置关系找规律",
                  },
                  {
                    label: "直线、射线和线段数相关计算问题",
                    value: "直线、射线和线段数相关计算问题",
                  },
                ],
              },
              {
                label: "会比较线段的长短",
                value: "会比较线段的长短",
                children: [
                  {
                    label: "线段比较大小",
                    value: "线段比较大小",
                  },
                ],
              },
              {
                label: "理解线段的和、差，以及线段中点的意义",
                value: "理解线段的和、差，以及线段中点的意义",
                children: [
                  {
                    label: "线段中点与等分点",
                    value: "线段中点与等分点",
                  },
                  {
                    label: "与线段比例相关问题的计算",
                    value: "与线段比例相关问题的计算",
                  },
                  {
                    label: "线段和差-不需要分类讨论",
                    value: "线段和差-不需要分类讨论",
                  },
                  {
                    label: "线段和差-需要分类讨论",
                    value: "线段和差-需要分类讨论",
                  },
                  {
                    label: "线段的和差的证明",
                    value: "线段的和差的证明",
                  },
                  {
                    label: "动点与线段-有数轴",
                    value: "动点与线段-有数轴",
                  },
                  {
                    label: "动点与线段-无数轴",
                    value: "动点与线段-无数轴",
                  },
                  {
                    label: "与中点相关的规律",
                    value: "与中点相关的规律",
                  },
                ],
              },
              {
                label: "掌握基本事实：两点确定一条直线",
                value: "掌握基本事实：两点确定一条直线",
                children: [
                  {
                    label: "有关公理-两点确定一条直线",
                    value: "有关公理-两点确定一条直线",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                ],
              },
              {
                label: "掌握基本事实：两点之间线段最短",
                value: "掌握基本事实：两点之间线段最短",
                children: [
                  {
                    label: "有关公理-两点之间线段最短",
                    value: "有关公理-两点之间线段最短",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                  {
                    label: "两点之间线段最短",
                    value: "两点之间线段最短",
                  },
                ],
              },
              {
                label: "理解两点间距离的意义",
                value: "理解两点间距离的意义",
                children: [
                  {
                    label: "两点间距离的定义",
                    value: "两点间距离的定义",
                  },
                ],
              },
              {
                label: "能度量和表达两点间的距离",
                value: "能度量和表达两点间的距离",
                children: [
                  {
                    label: "两点间距离的定义",
                    value: "两点间距离的定义",
                  },
                ],
              },
              {
                label: "理解角的概念",
                value: "理解角的概念",
                children: [
                  {
                    label: "角的定义",
                    value: "角的定义",
                  },
                  {
                    label: "角的分类",
                    value: "角的分类",
                  },
                  {
                    label: "角的表示方法",
                    value: "角的表示方法",
                  },
                  {
                    label: "角的计数",
                    value: "角的计数",
                  },
                  {
                    label: "余角和补角",
                    value: "余角和补角",
                  },
                  {
                    label: "钟面角",
                    value: "钟面角",
                  },
                ],
              },
              {
                label: "能比较角的大小",
                value: "能比较角的大小",
                children: [
                  {
                    label: "角的大小比较",
                    value: "角的大小比较",
                  },
                ],
              },
              {
                label: "认识度、分、秒等角的度量 单位",
                value: "认识度、分、秒等角的度量 单位",
                children: [
                  {
                    label: "角的度量",
                    value: "角的度量",
                  },
                ],
              },
              {
                label: "能进行简单的单位换算，会计算角的和、差",
                value: "能进行简单的单位换算，会计算角的和、差",
                children: [
                  {
                    label: "角度换算",
                    value: "角度换算",
                  },
                  {
                    label: "角的度数计算",
                    value: "角的度数计算",
                  },
                  {
                    label: "角的和差的计算与证明-不需要分类讨论",
                    value: "角的和差的计算与证明-不需要分类讨论",
                  },
                  {
                    label: "角的和差的计算与证明-需要分类讨论",
                    value: "角的和差的计算与证明-需要分类讨论",
                  },
                  {
                    label: "三角板的应用",
                    value: "三角板的应用",
                  },
                  {
                    label: "转角问题",
                    value: "转角问题",
                  },
                  {
                    label: "角中的运动问题",
                    value: "角中的运动问题",
                  },
                ],
              },
              {
                label: "能用尺规作图:作一个角等于已知角",
                value: "能用尺规作图:作一个角等于已知角",
                children: [
                  {
                    label: "作一个角等于已知角",
                    value: "作一个角等于已知角",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "能用尺规作图:作一个角的平分线。",
                value: "能用尺规作图:作一个角的平分线。",
                children: [
                  {
                    label: "作角平分线",
                    value: "作角平分线",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
            ],
          },
          {
            label: "相交线与平行线",
            value: "相交线与平行线",
            children: [
              {
                label: "理解对顶角、余角、补角等概念",
                value: "理解对顶角、余角、补角等概念",
                children: [
                  {
                    label: "余角和补角",
                    value: "余角和补角",
                  },
                  {
                    label: "对顶角的定义与性质",
                    value: "对顶角的定义与性质",
                  },
                  {
                    label: "邻补角的定义与性质",
                    value: "邻补角的定义与性质",
                  },
                  {
                    label: "计算对顶角、邻补角度数",
                    value: "计算对顶角、邻补角度数",
                  },
                  {
                    label: "对顶角、邻补角计数",
                    value: "对顶角、邻补角计数",
                  },
                  {
                    label: "相交的定义",
                    value: "相交的定义",
                  },
                  {
                    label: "相交线的交点问题",
                    value: "相交线的交点问题",
                  },
                  {
                    label: "相交线的交点问题找规律",
                    value: "相交线的交点问题找规律",
                  },
                  {
                    label: "相交线分平面问题找规律",
                    value: "相交线分平面问题找规律",
                  },
                ],
              },
              {
                label:
                  "探索并掌握对顶角相等、同角(或等角)的余角相等、同角(或等角)的补角相等的性质",
                value:
                  "探索并掌握对顶角相等、同角(或等角)的余角相等、同角(或等角)的补角相等的性质",
                children: [
                  {
                    label: "余角和补角",
                    value: "余角和补角",
                  },
                  {
                    label: "对顶角的定义与性质",
                    value: "对顶角的定义与性质",
                  },
                  {
                    label: "邻补角的定义与性质",
                    value: "邻补角的定义与性质",
                  },
                  {
                    label: "计算对顶角、邻补角度数",
                    value: "计算对顶角、邻补角度数",
                  },
                  {
                    label: "对顶角、邻补角计数",
                    value: "对顶角、邻补角计数",
                  },
                ],
              },
              {
                label: "理解垂线、垂线段等概念",
                value: "理解垂线、垂线段等概念",
                children: [
                  {
                    label: "垂直的定义",
                    value: "垂直的定义",
                  },
                  {
                    label: "垂线段的定义",
                    value: "垂线段的定义",
                  },
                ],
              },
              {
                label: "能用三角板或量角器过一点画已知 直线的垂线",
                value: "能用三角板或量角器过一点画已知 直线的垂线",
                children: [
                  {
                    label: "垂线与垂线段的作图",
                    value: "垂线与垂线段的作图",
                  },
                ],
              },
              {
                label:
                  "能用尺规作图：作一条线段的垂直平分线；过一点作已知直线 的垂线。",
                value:
                  "能用尺规作图：作一条线段的垂直平分线；过一点作已知直线 的垂线。",
                children: [
                  {
                    label: "作线段的垂直平分线",
                    value: "作线段的垂直平分线",
                  },
                  {
                    label: "过一点作已知直线的垂线",
                    value: "过一点作已知直线的垂线",
                  },
                  {
                    label: "以已知线段为直径作圆",
                    value: "以已知线段为直径作圆",
                  },
                  {
                    label: "作圆弧的中点",
                    value: "作圆弧的中点",
                  },
                  {
                    label: "作轴对称图形的对称轴",
                    value: "作轴对称图形的对称轴",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label:
                  "掌握基本事实：同一平面内，过一点有且只有一条直线与已知 直线垂直",
                value:
                  "掌握基本事实：同一平面内，过一点有且只有一条直线与已知 直线垂直",
                children: [
                  {
                    label: "垂线的性质",
                    value: "垂线的性质",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                ],
              },
              {
                label: "理解点到直线的距离的意义",
                value: "理解点到直线的距离的意义",
                children: [
                  {
                    label: "点到直线距离",
                    value: "点到直线距离",
                  },
                ],
              },
              {
                label: "能度量点到直线的距离",
                value: "能度量点到直线的距离",
                children: [
                  {
                    label: "垂线段最短",
                    value: "垂线段最短",
                  },
                  {
                    label: "利用垂线段最短求最值",
                    value: "利用垂线段最短求最值",
                  },
                ],
              },
              {
                label: "识别同位角、内错角、同旁内角",
                value: "识别同位角、内错角、同旁内角",
                children: [
                  {
                    label: "找截线与被截线",
                    value: "找截线与被截线",
                  },
                  {
                    label: "同位角的定义",
                    value: "同位角的定义",
                  },
                  {
                    label: "内错角的定义",
                    value: "内错角的定义",
                  },
                  {
                    label: "同旁内角的定义",
                    value: "同旁内角的定义",
                  },
                  {
                    label: "同位角、内错角、同旁内角的个数",
                    value: "同位角、内错角、同旁内角的个数",
                  },
                ],
              },
              {
                label: "理解平行线的概念",
                value: "理解平行线的概念",
                children: [
                  {
                    label: "平行线的定义",
                    value: "平行线的定义",
                  },
                  {
                    label: "直线的位置关系",
                    value: "直线的位置关系",
                  },
                ],
              },
              {
                label:
                  "掌握平行线基本事实I:   过直线外一点有且只有一条直线与这 条直线平行",
                value:
                  "掌握平行线基本事实I:   过直线外一点有且只有一条直线与这 条直线平行",
                children: [
                  {
                    label: "平行公理及其推论",
                    value: "平行公理及其推论",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                ],
              },
              {
                label:
                  "掌握平行线基本事实Ⅱ:两条直线被第三条直线所截，如果同 位角相等，那么这两条直线平行",
                value:
                  "掌握平行线基本事实Ⅱ:两条直线被第三条直线所截，如果同 位角相等，那么这两条直线平行",
                children: [
                  {
                    label: "平行线判定",
                    value: "平行线判定",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                  {
                    label: "平行线补充条件或证明依据",
                    value: "平行线补充条件或证明依据",
                  },
                ],
              },
              {
                label:
                  "探索并证明平行线的判定定理：两条直线被第三条直线所截， 如果内错角相等(或同旁内角互补),那么这两条直线平行",
                value:
                  "探索并证明平行线的判定定理：两条直线被第三条直线所截， 如果内错角相等(或同旁内角互补),那么这两条直线平行",
                children: [
                  {
                    label: "平行线判定",
                    value: "平行线判定",
                  },
                  {
                    label: "平行线补充条件或证明依据",
                    value: "平行线补充条件或证明依据",
                  },
                ],
              },
              {
                label:
                  "掌握平行线的性质定理I:    两条平行直线被第三条直线所截， 同位角相等",
                value:
                  "掌握平行线的性质定理I:    两条平行直线被第三条直线所截， 同位角相等",
                children: [
                  {
                    label: "平行线的性质",
                    value: "平行线的性质",
                  },
                  {
                    label: "平行线补充条件或证明依据",
                    value: "平行线补充条件或证明依据",
                  },
                  {
                    label: "平行线构造-拐点模型",
                    value: "平行线构造-拐点模型",
                  },
                  {
                    label: "平行线相关折叠问题",
                    value: "平行线相关折叠问题",
                  },
                  {
                    label: "平行线判定与性质的综合",
                    value: "平行线判定与性质的综合",
                  },
                  {
                    label: "平行线与角平分线综合",
                    value: "平行线与角平分线综合",
                  },
                ],
              },
              {
                label: "*了解平行线的性质定理I的证明",
                value: "*了解平行线的性质定理I的证明",
                children: [
                  {
                    label: "平行线的性质",
                    value: "平行线的性质",
                  },
                  {
                    label: "反证法的应用",
                    value: "反证法的应用",
                  },
                ],
              },
              {
                label:
                  "探索并证明平行线的性质定理Ⅱ:两条平行直线被第三条直线 所截，内错角相等(或同旁内角互补)",
                value:
                  "探索并证明平行线的性质定理Ⅱ:两条平行直线被第三条直线 所截，内错角相等(或同旁内角互补)",
                children: [
                  {
                    label: "平行线的性质",
                    value: "平行线的性质",
                  },
                  {
                    label: "平行线补充条件或证明依据",
                    value: "平行线补充条件或证明依据",
                  },
                  {
                    label: "平行线构造-拐点模型",
                    value: "平行线构造-拐点模型",
                  },
                  {
                    label: "平行线相关折叠问题",
                    value: "平行线相关折叠问题",
                  },
                  {
                    label: "平行线判定与性质的综合",
                    value: "平行线判定与性质的综合",
                  },
                  {
                    label: "平行线与角平分线综合",
                    value: "平行线与角平分线综合",
                  },
                ],
              },
              {
                label: "能用三角板和直尺过已知直线外一点画这条直线的平行线",
                value: "能用三角板和直尺过已知直线外一点画这条直线的平行线",
                children: [
                  {
                    label: "平行线的画法",
                    value: "平行线的画法",
                  },
                ],
              },
              {
                label: "能用尺规作图：过直线外一点作这条直线的平行线",
                value: "能用尺规作图：过直线外一点作这条直线的平行线",
                children: [
                  {
                    label: "过一点作已知直线的平行线",
                    value: "过一点作已知直线的平行线",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "了解平行于同一条直线的两条直线平行",
                value: "了解平行于同一条直线的两条直线平行",
                children: [
                  {
                    label: "平行公理及其推论",
                    value: "平行公理及其推论",
                  },
                  {
                    label: "平行线构造-拐点模型",
                    value: "平行线构造-拐点模型",
                  },
                ],
              },
            ],
          },
          {
            label: "三角形",
            value: "三角形",
            children: [
              {
                label: "理解三角形及其内角、外角、中线、高线、角平分线等概念",
                value: "理解三角形及其内角、外角、中线、高线、角平分线等概念",
                children: [
                  {
                    label: "三角形的定义",
                    value: "三角形的定义",
                  },
                  {
                    label: "三角形的个数",
                    value: "三角形的个数",
                  },
                  {
                    label: "三角形的分类",
                    value: "三角形的分类",
                  },
                  {
                    label: "三角形的周长与面积问题",
                    value: "三角形的周长与面积问题",
                  },
                  {
                    label: "判断三角形的高，中线和角平分线",
                    value: "判断三角形的高，中线和角平分线",
                  },
                  {
                    label: "作三角形的高，中线和角平分线",
                    value: "作三角形的高，中线和角平分线",
                  },
                  {
                    label: "三角形的三心",
                    value: "三角形的三心",
                  },
                  {
                    label: "三角形中线与周长差问题",
                    value: "三角形中线与周长差问题",
                  },
                  {
                    label: "与中线或等分线有关的等积变换",
                    value: "与中线或等分线有关的等积变换",
                  },
                  {
                    label: "与三角形有关的新定义",
                    value: "与三角形有关的新定义",
                  },
                ],
              },
              {
                label: "了解三角形的稳定性",
                value: "了解三角形的稳定性",
                children: [
                  {
                    label: "三角形的稳定性",
                    value: "三角形的稳定性",
                  },
                ],
              },
              {
                label: "探索并证明三角形的内角和定理",
                value: "探索并证明三角形的内角和定理",
                children: [
                  {
                    label: "三角形的内角和定理",
                    value: "三角形的内角和定理",
                  },
                  {
                    label: "三角形内角和的证明",
                    value: "三角形内角和的证明",
                  },
                  {
                    label: "三角形内角和的应用",
                    value: "三角形内角和的应用",
                  },
                ],
              },
              {
                label:
                  "掌握三角形的内角和的推论：三角形的外 角等于与它不相邻的两个内角的和",
                value:
                  "掌握三角形的内角和的推论：三角形的外 角等于与它不相邻的两个内角的和",
                children: [
                  {
                    label: "三角形的外角定义及性质",
                    value: "三角形的外角定义及性质",
                  },
                  {
                    label: "蝴蝶型（8字倒角）",
                    value: "蝴蝶型（8字倒角）",
                  },
                  {
                    label: "燕尾形（飞镖型）",
                    value: "燕尾形（飞镖型）",
                  },
                  {
                    label: "双垂形",
                    value: "双垂形",
                  },
                  {
                    label: "三角形-内角角分线",
                    value: "三角形-内角角分线",
                  },
                  {
                    label: "三角形-外角角分线",
                    value: "三角形-外角角分线",
                  },
                  {
                    label: "三角形-内外角角分线",
                    value: "三角形-内外角角分线",
                  },
                  {
                    label: "三角形折叠",
                    value: "三角形折叠",
                  },
                  {
                    label: "模型综合运用",
                    value: "模型综合运用",
                  },
                  {
                    label: "三角形的外角和",
                    value: "三角形的外角和",
                  },
                  {
                    label: "三角形的倒角问题",
                    value: "三角形的倒角问题",
                  },
                ],
              },
              {
                label: "证明三角形的任意两边之和大于第三边",
                value: "证明三角形的任意两边之和大于第三边",
                children: [
                  {
                    label: "三角形的三边关系",
                    value: "三角形的三边关系",
                  },
                  {
                    label: "判断能否构成三角形",
                    value: "判断能否构成三角形",
                  },
                  {
                    label: "求三角形第三边的取值范围",
                    value: "求三角形第三边的取值范围",
                  },
                  {
                    label: "求三角形周长的取值范围",
                    value: "求三角形周长的取值范围",
                  },
                  {
                    label: "与三边关系有关的证明",
                    value: "与三边关系有关的证明",
                  },
                  {
                    label: "整数边问题",
                    value: "整数边问题",
                  },
                  {
                    label: "利用三边关系求最值",
                    value: "利用三边关系求最值",
                  },
                  {
                    label: "利用三边关系解决的最短问题",
                    value: "利用三边关系解决的最短问题",
                  },
                ],
              },
              {
                label: "理解全等三角形的概念",
                value: "理解全等三角形的概念",
                children: [
                  {
                    label: "全等形的定义",
                    value: "全等形的定义",
                  },
                  {
                    label: "全等三角形的定义",
                    value: "全等三角形的定义",
                  },
                  {
                    label: "全等三角形的性质",
                    value: "全等三角形的性质",
                  },
                  {
                    label: "全等三角形的对应边与角",
                    value: "全等三角形的对应边与角",
                  },
                  {
                    label: "全等三角形的对应高线、中线、角分线",
                    value: "全等三角形的对应高线、中线、角分线",
                  },
                  {
                    label: "全等三角形的周长与面积",
                    value: "全等三角形的周长与面积",
                  },
                  {
                    label: "全等三角形计数问题",
                    value: "全等三角形计数问题",
                  },
                ],
              },
              {
                label: "能识别全等三角形中的对应边、对应角",
                value: "能识别全等三角形中的对应边、对应角",
                children: [
                  {
                    label: "对应边",
                    value: "对应边",
                  },
                  {
                    label: "对应角",
                    value: "对应角",
                  },
                  {
                    label: "全等三角形的对应边与角",
                    value: "全等三角形的对应边与角",
                  },
                ],
              },
              {
                label: "掌握基本事实：两边及其夹角分别相等的两个三角形全等",
                value: "掌握基本事实：两边及其夹角分别相等的两个三角形全等",
                children: [
                  {
                    label: "SAS",
                    value: "SAS",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                  {
                    label: "SSA反例",
                    value: "SSA反例",
                  },
                  {
                    label: "全等三角形证明过程的补全",
                    value: "全等三角形证明过程的补全",
                  },
                  {
                    label: "多解或多种判定混合",
                    value: "多解或多种判定混合",
                  },
                  {
                    label: "全等三角形之二次全等",
                    value: "全等三角形之二次全等",
                  },
                  {
                    label: "全等三角形实际生活中的应用",
                    value: "全等三角形实际生活中的应用",
                  },
                  {
                    label: "全等三角形存在性",
                    value: "全等三角形存在性",
                  },
                  {
                    label: "全等三角形中的动点问题",
                    value: "全等三角形中的动点问题",
                  },
                  {
                    label: "平移型全等",
                    value: "平移型全等",
                  },
                  {
                    label: "旋转型全等",
                    value: "旋转型全等",
                  },
                  {
                    label: "对称型全等",
                    value: "对称型全等",
                  },
                  {
                    label: "三垂直模型",
                    value: "三垂直模型",
                  },
                  {
                    label: "一线三等角模型",
                    value: "一线三等角模型",
                  },
                  {
                    label: "构造简单辅助线证明全等",
                    value: "构造简单辅助线证明全等",
                  },
                  {
                    label: "倍长中线",
                    value: "倍长中线",
                  },
                  {
                    label: "倍长（类）中线",
                    value: "倍长（类）中线",
                  },
                  {
                    label: "利用平行线+中点构造全等",
                    value: "利用平行线+中点构造全等",
                  },
                  {
                    label: "截长补短",
                    value: "截长补短",
                  },
                  {
                    label: "垂直构对称",
                    value: "垂直构对称",
                  },
                  {
                    label: "延长构对称",
                    value: "延长构对称",
                  },
                  {
                    label: "截取构对称",
                    value: "截取构对称",
                  },
                  {
                    label: "平行构等腰",
                    value: "平行构等腰",
                  },
                  {
                    label: "辅助线综合运用",
                    value: "辅助线综合运用",
                  },
                  {
                    label: "全等三角形判定与性质综合",
                    value: "全等三角形判定与性质综合",
                  },
                ],
              },
              {
                label: "掌握基本事实：两角及其夹边分别相等的两个三角形全等",
                value: "掌握基本事实：两角及其夹边分别相等的两个三角形全等",
                children: [
                  {
                    label: "ASA",
                    value: "ASA",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                  {
                    label: "全等三角形证明过程的补全",
                    value: "全等三角形证明过程的补全",
                  },
                  {
                    label: "多解或多种判定混合",
                    value: "多解或多种判定混合",
                  },
                  {
                    label: "全等三角形之二次全等",
                    value: "全等三角形之二次全等",
                  },
                  {
                    label: "全等三角形实际生活中的应用",
                    value: "全等三角形实际生活中的应用",
                  },
                  {
                    label: "全等三角形存在性",
                    value: "全等三角形存在性",
                  },
                  {
                    label: "全等三角形中的动点问题",
                    value: "全等三角形中的动点问题",
                  },
                  {
                    label: "平移型全等",
                    value: "平移型全等",
                  },
                  {
                    label: "旋转型全等",
                    value: "旋转型全等",
                  },
                  {
                    label: "对称型全等",
                    value: "对称型全等",
                  },
                  {
                    label: "三垂直模型",
                    value: "三垂直模型",
                  },
                  {
                    label: "一线三等角模型",
                    value: "一线三等角模型",
                  },
                  {
                    label: "构造简单辅助线证明全等",
                    value: "构造简单辅助线证明全等",
                  },
                  {
                    label: "倍长中线",
                    value: "倍长中线",
                  },
                  {
                    label: "倍长（类）中线",
                    value: "倍长（类）中线",
                  },
                  {
                    label: "利用平行线+中点构造全等",
                    value: "利用平行线+中点构造全等",
                  },
                  {
                    label: "截长补短",
                    value: "截长补短",
                  },
                  {
                    label: "垂直构对称",
                    value: "垂直构对称",
                  },
                  {
                    label: "延长构对称",
                    value: "延长构对称",
                  },
                  {
                    label: "截取构对称",
                    value: "截取构对称",
                  },
                  {
                    label: "平行构等腰",
                    value: "平行构等腰",
                  },
                  {
                    label: "辅助线综合运用",
                    value: "辅助线综合运用",
                  },
                  {
                    label: "全等三角形判定与性质综合",
                    value: "全等三角形判定与性质综合",
                  },
                ],
              },
              {
                label: "掌握基本事实：三边分别相等的两个三角形全等",
                value: "掌握基本事实：三边分别相等的两个三角形全等",
                children: [
                  {
                    label: "SSS",
                    value: "SSS",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                  {
                    label: "全等三角形证明过程的补全",
                    value: "全等三角形证明过程的补全",
                  },
                  {
                    label: "多解或多种判定混合",
                    value: "多解或多种判定混合",
                  },
                  {
                    label: "全等三角形之二次全等",
                    value: "全等三角形之二次全等",
                  },
                  {
                    label: "全等三角形实际生活中的应用",
                    value: "全等三角形实际生活中的应用",
                  },
                  {
                    label: "全等三角形存在性",
                    value: "全等三角形存在性",
                  },
                  {
                    label: "全等三角形中的动点问题",
                    value: "全等三角形中的动点问题",
                  },
                  {
                    label: "平移型全等",
                    value: "平移型全等",
                  },
                  {
                    label: "旋转型全等",
                    value: "旋转型全等",
                  },
                  {
                    label: "对称型全等",
                    value: "对称型全等",
                  },
                  {
                    label: "三垂直模型",
                    value: "三垂直模型",
                  },
                  {
                    label: "一线三等角模型",
                    value: "一线三等角模型",
                  },
                  {
                    label: "构造简单辅助线证明全等",
                    value: "构造简单辅助线证明全等",
                  },
                  {
                    label: "倍长中线",
                    value: "倍长中线",
                  },
                  {
                    label: "倍长（类）中线",
                    value: "倍长（类）中线",
                  },
                  {
                    label: "利用平行线+中点构造全等",
                    value: "利用平行线+中点构造全等",
                  },
                  {
                    label: "截长补短",
                    value: "截长补短",
                  },
                  {
                    label: "垂直构对称",
                    value: "垂直构对称",
                  },
                  {
                    label: "延长构对称",
                    value: "延长构对称",
                  },
                  {
                    label: "截取构对称",
                    value: "截取构对称",
                  },
                  {
                    label: "平行构等腰",
                    value: "平行构等腰",
                  },
                  {
                    label: "辅助线综合运用",
                    value: "辅助线综合运用",
                  },
                  {
                    label: "全等三角形判定与性质综合",
                    value: "全等三角形判定与性质综合",
                  },
                ],
              },
              {
                label:
                  "证明定理：两角分别相等且其中一组等角的对边相等的两个三 角形全等",
                value:
                  "证明定理：两角分别相等且其中一组等角的对边相等的两个三 角形全等",
                children: [
                  {
                    label: "AAS",
                    value: "AAS",
                  },
                  {
                    label: "全等三角形证明过程的补全",
                    value: "全等三角形证明过程的补全",
                  },
                  {
                    label: "多解或多种判定混合",
                    value: "多解或多种判定混合",
                  },
                  {
                    label: "全等三角形之二次全等",
                    value: "全等三角形之二次全等",
                  },
                  {
                    label: "全等三角形实际生活中的应用",
                    value: "全等三角形实际生活中的应用",
                  },
                  {
                    label: "全等三角形存在性",
                    value: "全等三角形存在性",
                  },
                  {
                    label: "全等三角形中的动点问题",
                    value: "全等三角形中的动点问题",
                  },
                  {
                    label: "平移型全等",
                    value: "平移型全等",
                  },
                  {
                    label: "旋转型全等",
                    value: "旋转型全等",
                  },
                  {
                    label: "对称型全等",
                    value: "对称型全等",
                  },
                  {
                    label: "三垂直模型",
                    value: "三垂直模型",
                  },
                  {
                    label: "一线三等角模型",
                    value: "一线三等角模型",
                  },
                  {
                    label: "构造简单辅助线证明全等",
                    value: "构造简单辅助线证明全等",
                  },
                  {
                    label: "倍长中线",
                    value: "倍长中线",
                  },
                  {
                    label: "倍长（类）中线",
                    value: "倍长（类）中线",
                  },
                  {
                    label: "利用平行线+中点构造全等",
                    value: "利用平行线+中点构造全等",
                  },
                  {
                    label: "截长补短",
                    value: "截长补短",
                  },
                  {
                    label: "垂直构对称",
                    value: "垂直构对称",
                  },
                  {
                    label: "延长构对称",
                    value: "延长构对称",
                  },
                  {
                    label: "截取构对称",
                    value: "截取构对称",
                  },
                  {
                    label: "平行构等腰",
                    value: "平行构等腰",
                  },
                  {
                    label: "辅助线综合运用",
                    value: "辅助线综合运用",
                  },
                  {
                    label: "全等三角形判定与性质综合",
                    value: "全等三角形判定与性质综合",
                  },
                ],
              },
              {
                label: "理解角平分线的概念",
                value: "理解角平分线的概念",
                children: [
                  {
                    label: "角的平分线及等分线的定义",
                    value: "角的平分线及等分线的定义",
                  },
                  {
                    label: "用量角器作角平分线",
                    value: "用量角器作角平分线",
                  },
                  {
                    label: "角平分线的相关计算问题",
                    value: "角平分线的相关计算问题",
                  },
                  {
                    label: "与角分线有关的折叠问题",
                    value: "与角分线有关的折叠问题",
                  },
                ],
              },
              {
                label:
                  "探索并证明角平分线的性质定理：角平 分线上的点到角两边的距离相等；反之，角的内部到角两边距离相等 的点在角的平分线上",
                value:
                  "探索并证明角平分线的性质定理：角平 分线上的点到角两边的距离相等；反之，角的内部到角两边距离相等 的点在角的平分线上",
                children: [
                  {
                    label: "角分线性质定理",
                    value: "角分线性质定理",
                  },
                  {
                    label: "角平分线判定定理",
                    value: "角平分线判定定理",
                  },
                  {
                    label: "三角形中的角平分线应用",
                    value: "三角形中的角平分线应用",
                  },
                ],
              },
              {
                label: "理解线段垂直平分线的概念",
                value: "理解线段垂直平分线的概念",
                children: [
                  {
                    label: "线段的垂直平分线定义",
                    value: "线段的垂直平分线定义",
                  },
                ],
              },
              {
                label:
                  "探索并证明线段垂直平分线的性 质定理：线段垂直平分线上的点到线段两端的距离相等；反之，到线 段两端距离相等的点在线段的垂直平分线上",
                value:
                  "探索并证明线段垂直平分线的性 质定理：线段垂直平分线上的点到线段两端的距离相等；反之，到线 段两端距离相等的点在线段的垂直平分线上",
                children: [
                  {
                    label: "线段的垂直平分线的性质定理",
                    value: "线段的垂直平分线的性质定理",
                  },
                  {
                    label: "线段的垂直平分线的判定定理",
                    value: "线段的垂直平分线的判定定理",
                  },
                  {
                    label: "垂直平分线与全等综合",
                    value: "垂直平分线与全等综合",
                  },
                ],
              },
              {
                label: "理解等腰三角形的概念",
                value: "理解等腰三角形的概念",
                children: [
                  {
                    label: "等腰三角形的定义",
                    value: "等腰三角形的定义",
                  },
                  {
                    label: "已知两边求第三边或周长",
                    value: "已知两边求第三边或周长",
                  },
                  {
                    label: "等腰三角形的中线分周长",
                    value: "等腰三角形的中线分周长",
                  },
                  {
                    label: "已知一角求其余两角",
                    value: "已知一角求其余两角",
                  },
                  {
                    label: "等腰三角形的对称性",
                    value: "等腰三角形的对称性",
                  },
                  {
                    label: "腰上的高与腰的夹角问题",
                    value: "腰上的高与腰的夹角问题",
                  },
                ],
              },
              {
                label:
                  "探索并证明等腰三角形的性质定理： 等腰三角形的两个底角相等；底边上的高线、中线及顶角平分线重合",
                value:
                  "探索并证明等腰三角形的性质定理： 等腰三角形的两个底角相等；底边上的高线、中线及顶角平分线重合",
                children: [
                  {
                    label: "等腰三角形的性质-等边对等角",
                    value: "等腰三角形的性质-等边对等角",
                  },
                  {
                    label: "等腰三角形的性质-三线合一",
                    value: "等腰三角形的性质-三线合一",
                  },
                  {
                    label: "等腰直角三角形的性质",
                    value: "等腰直角三角形的性质",
                  },
                  {
                    label: "求等腰直角三角形的边长",
                    value: "求等腰直角三角形的边长",
                  },
                  {
                    label: "等腰直角三角形与全等",
                    value: "等腰直角三角形与全等",
                  },
                ],
              },
              {
                label:
                  "探索并掌握等腰三角形的判定定理：有两个角相等的三角形是等 腰三角形",
                value:
                  "探索并掌握等腰三角形的判定定理：有两个角相等的三角形是等 腰三角形",
                children: [
                  {
                    label: "等腰三角形的判定-两边相等",
                    value: "等腰三角形的判定-两边相等",
                  },
                  {
                    label: "等腰三角形的判定-等角对等边",
                    value: "等腰三角形的判定-等角对等边",
                  },
                  {
                    label: "等腰直角三角形的判定",
                    value: "等腰直角三角形的判定",
                  },
                  {
                    label: "等腰直角三角形的存在性",
                    value: "等腰直角三角形的存在性",
                  },
                  {
                    label: "等腰三角形的存在性",
                    value: "等腰三角形的存在性",
                  },
                  {
                    label: "利用垂直平分线构造等腰三角形",
                    value: "利用垂直平分线构造等腰三角形",
                  },
                  {
                    label: "角平分线+垂线构造等腰三角形",
                    value: "角平分线+垂线构造等腰三角形",
                  },
                  {
                    label: "角平分线+中线构造等腰三角形",
                    value: "角平分线+中线构造等腰三角形",
                  },
                  {
                    label: "通过平行构造等腰（等边）三角形",
                    value: "通过平行构造等腰（等边）三角形",
                  },
                  {
                    label: "等腰三角形的性质与判定综合问题",
                    value: "等腰三角形的性质与判定综合问题",
                  },
                ],
              },
              {
                label:
                  "探索等边三角形的性质定理：等边三角形的各角都等于 $60^\\circ$",
                value:
                  "探索等边三角形的性质定理：等边三角形的各角都等于 $60^\\circ$",
                children: [
                  {
                    label: "等边三角形的性质",
                    value: "等边三角形的性质",
                  },
                  {
                    label: "等边三角形的存在性",
                    value: "等边三角形的存在性",
                  },
                  {
                    label: "求等边三角形的面积",
                    value: "求等边三角形的面积",
                  },
                  {
                    label: "等腰及等边三角形的综合",
                    value: "等腰及等边三角形的综合",
                  },
                  {
                    label: "等边三角形与全等",
                    value: "等边三角形与全等",
                  },
                ],
              },
              {
                label:
                  "探索等边三角形的判定定理：三个角都相等的三角形(或有一个角是$60^\\circ$的等腰三角形)是等边三角形",
                value:
                  "探索等边三角形的判定定理：三个角都相等的三角形(或有一个角是$60^\\circ$的等腰三角形)是等边三角形",
                children: [
                  {
                    label: "等边三角形的判定",
                    value: "等边三角形的判定",
                  },
                  {
                    label: "等边三角形的定义",
                    value: "等边三角形的定义",
                  },
                  {
                    label: "等边三角形的构造",
                    value: "等边三角形的构造",
                  },
                  {
                    label: "等边三角形的性质与判定综合问题",
                    value: "等边三角形的性质与判定综合问题",
                  },
                ],
              },
              {
                label: "理解直角三角形的概念",
                value: "理解直角三角形的概念",
                children: [
                  {
                    label: "直角三角形的定义",
                    value: "直角三角形的定义",
                  },
                ],
              },
              {
                label:
                  "探索并掌握直角三角形的性质定理：直角三角形的两个锐角互余，直角三角形斜边上的中线等于斜边的一 半",
                value:
                  "探索并掌握直角三角形的性质定理：直角三角形的两个锐角互余，直角三角形斜边上的中线等于斜边的一 半",
                children: [
                  {
                    label: "直角三角形的两个锐角互余",
                    value: "直角三角形的两个锐角互余",
                  },
                  {
                    label: "直角三角形斜边中线性质以及应用",
                    value: "直角三角形斜边中线性质以及应用",
                  },
                  {
                    label: "作辅助线构造直角三角形斜边中线",
                    value: "作辅助线构造直角三角形斜边中线",
                  },
                  {
                    label: "30°特殊角的性质应用",
                    value: "30°特殊角的性质应用",
                  },
                  {
                    label: "直角三角形的存在性",
                    value: "直角三角形的存在性",
                  },
                ],
              },
              {
                label: "掌握有两个角互余的三角形是直角三角形",
                value: "掌握有两个角互余的三角形是直角三角形",
                children: [
                  {
                    label: "直角三角形的判定",
                    value: "直角三角形的判定",
                  },
                ],
              },
              {
                label: "探索勾股定理及其逆定理",
                value: "探索勾股定理及其逆定理",
                children: [
                  {
                    label: "勾股定理",
                    value: "勾股定理",
                  },
                  {
                    label: "勾股定理的证明",
                    value: "勾股定理的证明",
                  },
                  {
                    label: "弦图",
                    value: "弦图",
                  },
                  {
                    label: "勾股数",
                    value: "勾股数",
                  },
                  {
                    label: "直接用勾股求边长",
                    value: "直接用勾股求边长",
                  },
                  {
                    label: "已知两边求第三边-分类讨论",
                    value: "已知两边求第三边-分类讨论",
                  },
                  {
                    label: "勾股树",
                    value: "勾股树",
                  },
                  {
                    label: "方程思想在勾股定理的应用",
                    value: "方程思想在勾股定理的应用",
                  },
                  {
                    label: "勾股定理表示无理数",
                    value: "勾股定理表示无理数",
                  },
                  {
                    label: "勾股定理的逆定理",
                    value: "勾股定理的逆定理",
                  },
                ],
              },
              {
                label: "能运用勾股定理及其逆定理解决一些简单的实际 问题。",
                value: "能运用勾股定理及其逆定理解决一些简单的实际 问题。",
                children: [
                  {
                    label: "两点间的距离公式",
                    value: "两点间的距离公式",
                  },
                  {
                    label: "巧用网格作无理数边长",
                    value: "巧用网格作无理数边长",
                  },
                  {
                    label: "勾股定理与几何问题",
                    value: "勾股定理与几何问题",
                  },
                  {
                    label: "勾股定理与实际问题",
                    value: "勾股定理与实际问题",
                  },
                  {
                    label: "勾股定理与展开图最短路径问题",
                    value: "勾股定理与展开图最短路径问题",
                  },
                  {
                    label: "勾股逆定理的应用",
                    value: "勾股逆定理的应用",
                  },
                  {
                    label: "和圆柱有关的最值问题",
                    value: "和圆柱有关的最值问题",
                  },
                  {
                    label: "立体图形表面最短距离问题",
                    value: "立体图形表面最短距离问题",
                  },
                  {
                    label: "立体图形路径最短",
                    value: "立体图形路径最短",
                  },
                  {
                    label: "勾股定理与最值",
                    value: "勾股定理与最值",
                  },
                  {
                    label: "勾股定理与全等",
                    value: "勾股定理与全等",
                  },
                  {
                    label: "勾股定理的综合应用",
                    value: "勾股定理的综合应用",
                  },
                ],
              },
              {
                label: "探索并掌握判定直角三角形全等的“斜边、直角边”定理",
                value: "探索并掌握判定直角三角形全等的“斜边、直角边”定理",
                children: [
                  {
                    label: "HL",
                    value: "HL",
                  },
                ],
              },
              {
                label: "了解三角形重心的概念",
                value: "了解三角形重心的概念",
                children: [
                  {
                    label: "三角形的三心",
                    value: "三角形的三心",
                  },
                ],
              },
              {
                label:
                  "能用尺规作图：已知三边、两边及其夹角、两角及其夹边作三 角形",
                value:
                  "能用尺规作图：已知三边、两边及其夹角、两角及其夹边作三 角形",
                children: [
                  {
                    label: "已知三边作三角形",
                    value: "已知三边作三角形",
                  },
                  {
                    label: "已知两边及其夹角作三角形",
                    value: "已知两边及其夹角作三角形",
                  },
                  {
                    label: "已知两角及其夹边作三角形",
                    value: "已知两角及其夹边作三角形",
                  },
                  {
                    label: "作全等三角形（SSS）",
                    value: "作全等三角形（SSS）",
                  },
                  {
                    label: "作一条线段等于已知线段",
                    value: "作一条线段等于已知线段",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "能用尺规作图：已知底边及底边上的高线作等腰三角形",
                value: "能用尺规作图：已知底边及底边上的高线作等腰三角形",
                children: [
                  {
                    label: "作等腰三角形",
                    value: "作等腰三角形",
                  },
                  {
                    label: "作等腰直角三角形",
                    value: "作等腰直角三角形",
                  },
                  {
                    label: "作一条线段等于已知线段",
                    value: "作一条线段等于已知线段",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "能用尺规作图：已知一直角边和斜边 作直角三角形",
                value: "能用尺规作图：已知一直角边和斜边 作直角三角形",
                children: [
                  {
                    label: "作直角三角形",
                    value: "作直角三角形",
                  },
                  {
                    label: "作等腰直角三角形",
                    value: "作等腰直角三角形",
                  },
                  {
                    label: "作一条线段等于已知线段",
                    value: "作一条线段等于已知线段",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
            ],
          },
          {
            label: "四边形",
            value: "四边形",
            children: [
              {
                label:
                  "了解多边形的概念及多边形的顶点、边、内角、外角与对 角线",
                value:
                  "了解多边形的概念及多边形的顶点、边、内角、外角与对 角线",
                children: [
                  {
                    label: "多边形的定义",
                    value: "多边形的定义",
                  },
                  {
                    label: "求多边形边或对角线的数量",
                    value: "求多边形边或对角线的数量",
                  },
                  {
                    label: "求多边形周长与面积",
                    value: "求多边形周长与面积",
                  },
                  {
                    label: "正多边形边数",
                    value: "正多边形边数",
                  },
                ],
              },
              {
                label: "探索并掌握多边形内角和与外角和公式",
                value: "探索并掌握多边形内角和与外角和公式",
                children: [
                  {
                    label: "多边形的内角和定理",
                    value: "多边形的内角和定理",
                  },
                  {
                    label: "多边形的外角和定理",
                    value: "多边形的外角和定理",
                  },
                  {
                    label: "多边形内外角综合应用",
                    value: "多边形内外角综合应用",
                  },
                  {
                    label: "求多边形的内角和",
                    value: "求多边形的内角和",
                  },
                  {
                    label: "多边形剪去一角",
                    value: "多边形剪去一角",
                  },
                  {
                    label: "不规则图形的多角求和",
                    value: "不规则图形的多角求和",
                  },
                  {
                    label: "求正多边形的内角",
                    value: "求正多边形的内角",
                  },
                  {
                    label: "求正多边形的外角",
                    value: "求正多边形的外角",
                  },
                  {
                    label: "平面镶嵌",
                    value: "平面镶嵌",
                  },
                  {
                    label: "求多边形边或对角线的数量",
                    value: "求多边形边或对角线的数量",
                  },
                  {
                    label: "正多边形边数",
                    value: "正多边形边数",
                  },
                ],
              },
              {
                label:
                  "理解平行四边形、矩形、菱形、正方形、梯形的概念，以及它 们之间的关系",
                value:
                  "理解平行四边形、矩形、菱形、正方形、梯形的概念，以及它 们之间的关系",
                children: [
                  {
                    label: "四边形之间的区别与联系",
                    value: "四边形之间的区别与联系",
                  },
                  {
                    label: "平行四边形的定义",
                    value: "平行四边形的定义",
                  },
                  {
                    label: "平行四边形的周长与面积",
                    value: "平行四边形的周长与面积",
                  },
                  {
                    label: "平行四边形的对称性",
                    value: "平行四边形的对称性",
                  },
                  {
                    label: "矩形的定义",
                    value: "矩形的定义",
                  },
                  {
                    label: "矩形的周长与面积",
                    value: "矩形的周长与面积",
                  },
                  {
                    label: "菱形的定义",
                    value: "菱形的定义",
                  },
                  {
                    label: "菱形的周长与面积",
                    value: "菱形的周长与面积",
                  },
                  {
                    label: "正方形的定义",
                    value: "正方形的定义",
                  },
                  {
                    label: "正方形的周长与面积",
                    value: "正方形的周长与面积",
                  },
                  {
                    label: "梯形的定义",
                    value: "梯形的定义",
                  },
                  {
                    label: "直角梯形",
                    value: "直角梯形",
                  },
                  {
                    label: "等腰梯形",
                    value: "等腰梯形",
                  },
                  {
                    label: "梯形的性质",
                    value: "梯形的性质",
                  },
                  {
                    label: "梯形的判定",
                    value: "梯形的判定",
                  },
                  {
                    label: "梯形的中位线",
                    value: "梯形的中位线",
                  },
                  {
                    label: "梯形中的辅助线-与腰有关",
                    value: "梯形中的辅助线-与腰有关",
                  },
                  {
                    label: "梯形中的辅助线-与高有关",
                    value: "梯形中的辅助线-与高有关",
                  },
                  {
                    label: "梯形中的辅助线-与对角线有关",
                    value: "梯形中的辅助线-与对角线有关",
                  },
                  {
                    label: "梯形中的辅助线-与中点有关",
                    value: "梯形中的辅助线-与中点有关",
                  },
                  {
                    label: "构造中位线",
                    value: "构造中位线",
                  },
                  {
                    label: "动点与梯形的问题",
                    value: "动点与梯形的问题",
                  },
                  {
                    label: "中点类综合计算与证明",
                    value: "中点类综合计算与证明",
                  },
                  {
                    label: "与四边形有关的新定义",
                    value: "与四边形有关的新定义",
                  },
                ],
              },
              {
                label: "了解四边形的不稳定性",
                value: "了解四边形的不稳定性",
                children: [
                  {
                    label: "四边形的不稳定性",
                    value: "四边形的不稳定性",
                  },
                ],
              },
              {
                label:
                  "探索并证明平行四边形的性质定理：平行四边形的对边相等、 对角相等、对角线互相平分",
                value:
                  "探索并证明平行四边形的性质定理：平行四边形的对边相等、 对角相等、对角线互相平分",
                children: [
                  {
                    label: "平行四边形的性质",
                    value: "平行四边形的性质",
                  },
                  {
                    label: "根据平行四边形边的性质计算与证明",
                    value: "根据平行四边形边的性质计算与证明",
                  },
                  {
                    label: "根据平行四边形角的性质计算与证明",
                    value: "根据平行四边形角的性质计算与证明",
                  },
                  {
                    label: "利用平行四边形对角线的性质计算与证明",
                    value: "利用平行四边形对角线的性质计算与证明",
                  },
                  {
                    label: "平行四边形性质综合应用",
                    value: "平行四边形性质综合应用",
                  },
                  {
                    label: "动点与平行四边形问题",
                    value: "动点与平行四边形问题",
                  },
                  {
                    label: "平行四边形与全等综合",
                    value: "平行四边形与全等综合",
                  },
                  {
                    label: "平行四边形与角平分线结合",
                    value: "平行四边形与角平分线结合",
                  },
                ],
              },
              {
                label:
                  "探索并证明平行四边形的判定定理：一 组对边平行且相等的四边形是平行四边形；两组对边分别相等的四边  形是平行四边形；对角线互相平分的四边形是平行四边形。",
                value:
                  "探索并证明平行四边形的判定定理：一 组对边平行且相等的四边形是平行四边形；两组对边分别相等的四边  形是平行四边形；对角线互相平分的四边形是平行四边形。",
                children: [
                  {
                    label: "平行四边形的判定-与边有关",
                    value: "平行四边形的判定-与边有关",
                  },
                  {
                    label: "平行四边形的判定-与角有关",
                    value: "平行四边形的判定-与角有关",
                  },
                  {
                    label: "平行四边形的判定-与对角线有关",
                    value: "平行四边形的判定-与对角线有关",
                  },
                  {
                    label: "平行四边形的存在性",
                    value: "平行四边形的存在性",
                  },
                  {
                    label: "平行四边形性质与判定综合",
                    value: "平行四边形性质与判定综合",
                  },
                ],
              },
              {
                label: "理解两条平行线之间距离的概念",
                value: "理解两条平行线之间距离的概念",
                children: [
                  {
                    label: "两条平行线之间的距离",
                    value: "两条平行线之间的距离",
                  },
                ],
              },
              {
                label: "能度量两条平行线之间的 距离",
                value: "能度量两条平行线之间的 距离",
                children: [
                  {
                    label: "两条平行线之间的距离",
                    value: "两条平行线之间的距离",
                  },
                  {
                    label: "等积变换与“平行线”有关",
                    value: "等积变换与“平行线”有关",
                  },
                ],
              },
              {
                label:
                  "探索并证明矩形、菱形的性质定理：矩形的四个角都是直角， 对角线相等；菱形的四条边相等，对角线互相垂直",
                value:
                  "探索并证明矩形、菱形的性质定理：矩形的四个角都是直角， 对角线相等；菱形的四条边相等，对角线互相垂直",
                children: [
                  {
                    label: "矩形的性质",
                    value: "矩形的性质",
                  },
                  {
                    label: "菱形的性质",
                    value: "菱形的性质",
                  },
                  {
                    label: "矩形与全等综合",
                    value: "矩形与全等综合",
                  },
                  {
                    label: "菱形与全等综合",
                    value: "菱形与全等综合",
                  },
                ],
              },
              {
                label:
                  "探索并证明矩形、菱形的判定定理：三个角是直角的四边形是矩形，对角线相等的平行四边形是矩形；四边相等的四边形是菱形，对角线互相垂直的平行四边形是菱形。正方形既是矩形，又是菱形",
                value:
                  "探索并证明矩形、菱形的判定定理：三个角是直角的四边形是矩形，对角线相等的平行四边形是矩形；四边相等的四边形是菱形，对角线互相垂直的平行四边形是菱形。正方形既是矩形，又是菱形",
                children: [
                  {
                    label: "矩形的判定-从平行四边形",
                    value: "矩形的判定-从平行四边形",
                  },
                  {
                    label: "矩形的判定-从四边形",
                    value: "矩形的判定-从四边形",
                  },
                  {
                    label: "菱形的判定-从平行四边形",
                    value: "菱形的判定-从平行四边形",
                  },
                  {
                    label: "菱形的判定-从四边形",
                    value: "菱形的判定-从四边形",
                  },
                  {
                    label: "正方形的性质",
                    value: "正方形的性质",
                  },
                  {
                    label: "正方形的判定",
                    value: "正方形的判定",
                  },
                  {
                    label: "正方形的存在性",
                    value: "正方形的存在性",
                  },
                  {
                    label: "菱形的存在性",
                    value: "菱形的存在性",
                  },
                  {
                    label: "矩形的存在性",
                    value: "矩形的存在性",
                  },
                  {
                    label: "矩形与全等综合",
                    value: "矩形与全等综合",
                  },
                  {
                    label: "菱形与全等综合",
                    value: "菱形与全等综合",
                  },
                  {
                    label: "正方形与全等综合",
                    value: "正方形与全等综合",
                  },
                  {
                    label: "动点与特殊平行四边形问题",
                    value: "动点与特殊平行四边形问题",
                  },
                  {
                    label: "菱形性质与判定综合",
                    value: "菱形性质与判定综合",
                  },
                  {
                    label: "矩形性质与判定综合",
                    value: "矩形性质与判定综合",
                  },
                ],
              },
              {
                label: "理解矩形、菱形、正  方形之间的包含关系",
                value: "理解矩形、菱形、正  方形之间的包含关系",
                children: [
                  {
                    label: "四边形之间的区别与联系",
                    value: "四边形之间的区别与联系",
                  },
                  {
                    label: "中点四边形",
                    value: "中点四边形",
                  },
                  {
                    label: "与中点相关的规律",
                    value: "与中点相关的规律",
                  },
                ],
              },
              {
                label: "探索并证明三角形的中位线定理",
                value: "探索并证明三角形的中位线定理",
                children: [
                  {
                    label: "三角形的中位线的定义",
                    value: "三角形的中位线的定义",
                  },
                  {
                    label: "三角形中位线定理",
                    value: "三角形中位线定理",
                  },
                  {
                    label: "中位线定理及其应用",
                    value: "中位线定理及其应用",
                  },
                  {
                    label: "构造中位线",
                    value: "构造中位线",
                  },
                  {
                    label: "与中点相关的规律",
                    value: "与中点相关的规律",
                  },
                ],
              },
            ],
          },
          {
            label: "圆",
            value: "圆",
            children: [
              {
                label: "理解圆、弧、弦、圆心角、圆周角的概念",
                value: "理解圆、弧、弦、圆心角、圆周角的概念",
                children: [
                  {
                    label: "半径与直径的关系",
                    value: "半径与直径的关系",
                  },
                  {
                    label: "与圆的周长有关的实际问题",
                    value: "与圆的周长有关的实际问题",
                  },
                  {
                    label: "与圆的面积有关的实际问题",
                    value: "与圆的面积有关的实际问题",
                  },
                  {
                    label: "圆的定义",
                    value: "圆的定义",
                  },
                  {
                    label: "弦与直径",
                    value: "弦与直径",
                  },
                  {
                    label: "圆心角和圆周角",
                    value: "圆心角和圆周角",
                  },
                  {
                    label: "圆中对称性",
                    value: "圆中对称性",
                  },
                  {
                    label: "弧、弦、圆心角关系",
                    value: "弧、弦、圆心角关系",
                  },
                  {
                    label: "圆的周长公式",
                    value: "圆的周长公式",
                  },
                  {
                    label: "圆的面积公式",
                    value: "圆的面积公式",
                  },
                  {
                    label: "不在同一直线上的三点确定一个圆",
                    value: "不在同一直线上的三点确定一个圆",
                  },
                ],
              },
              {
                label: "了解等圆、等弧的 概念",
                value: "了解等圆、等弧的 概念",
                children: [
                  {
                    label: "弧、半圆、优弧、劣弧与等弧",
                    value: "弧、半圆、优弧、劣弧与等弧",
                  },
                  {
                    label: "同心圆和等圆",
                    value: "同心圆和等圆",
                  },
                ],
              },
              {
                label: "探索并掌握点与圆的位置关系",
                value: "探索并掌握点与圆的位置关系",
                children: [
                  {
                    label: "点与圆的位置关系",
                    value: "点与圆的位置关系",
                  },
                  {
                    label: "已知点和圆的位置关系，求半径",
                    value: "已知点和圆的位置关系，求半径",
                  },
                  {
                    label: "点与圆上一点间距离的最大、最小值",
                    value: "点与圆上一点间距离的最大、最小值",
                  },
                ],
              },
              {
                label:
                  "探索并证明垂径定理：垂直于弦的直径平分弦以及弦所对的两条弧",
                value:
                  "探索并证明垂径定理：垂直于弦的直径平分弦以及弦所对的两条弧",
                children: [
                  {
                    label: "垂径定理以及应用",
                    value: "垂径定理以及应用",
                  },
                  {
                    label: "垂径定理的推论以及应用",
                    value: "垂径定理的推论以及应用",
                  },
                  {
                    label: "圆与线段和差问题",
                    value: "圆与线段和差问题",
                  },
                  {
                    label: "圆与全等",
                    value: "圆与全等",
                  },
                  {
                    label: "圆与勾股",
                    value: "圆与勾股",
                  },
                  {
                    label: "圆与相似",
                    value: "圆与相似",
                  },
                  {
                    label: "圆与三角函数",
                    value: "圆与三角函数",
                  },
                  {
                    label: "圆与特殊角",
                    value: "圆与特殊角",
                  },
                  {
                    label: "圆与等腰+平行线",
                    value: "圆与等腰+平行线",
                  },
                  {
                    label: "圆与平面直角坐标系",
                    value: "圆与平面直角坐标系",
                  },
                  {
                    label: "圆与其他综合",
                    value: "圆与其他综合",
                  },
                  {
                    label: "与圆有关的动点、轨迹问题",
                    value: "与圆有关的动点、轨迹问题",
                  },
                  {
                    label: "圆与最值问题",
                    value: "圆与最值问题",
                  },
                  {
                    label: "圆中最值",
                    value: "圆中最值",
                  },
                  {
                    label: "与圆有关的新定义",
                    value: "与圆有关的新定义",
                  },
                  {
                    label: "圆与找规律",
                    value: "圆与找规律",
                  },
                ],
              },
              {
                label:
                  "探索圆周角与圆心角及其所对弧的关系，知道同弧(或等弧) 所对的圆周角相等",
                value:
                  "探索圆周角与圆心角及其所对弧的关系，知道同弧(或等弧) 所对的圆周角相等",
                children: [
                  {
                    label: "圆周角定理的推论",
                    value: "圆周角定理的推论",
                  },
                  {
                    label: "辅助圆问题",
                    value: "辅助圆问题",
                  },
                  {
                    label: "四点共圆的应用",
                    value: "四点共圆的应用",
                  },
                ],
              },
              {
                label:
                  "了解并证明圆周角定理及其推论：圆周角等于它 所对弧上的圆心角的一半；直径所对的圆周角是直角，$90^\\circ$的圆周角 所对的弦是直径；圆内接四边形的对角互补",
                value:
                  "了解并证明圆周角定理及其推论：圆周角等于它 所对弧上的圆心角的一半；直径所对的圆周角是直角，$90^\\circ$的圆周角 所对的弦是直径；圆内接四边形的对角互补",
                children: [
                  {
                    label: "圆周角定理以及应用",
                    value: "圆周角定理以及应用",
                  },
                  {
                    label: "圆周角定理的推论",
                    value: "圆周角定理的推论",
                  },
                  {
                    label: "圆内接四边形的性质定理",
                    value: "圆内接四边形的性质定理",
                  },
                  {
                    label: "辅助圆问题",
                    value: "辅助圆问题",
                  },
                  {
                    label: "圆内接四边形综合",
                    value: "圆内接四边形综合",
                  },
                  {
                    label: "四点共圆的应用",
                    value: "四点共圆的应用",
                  },
                  {
                    label: "圆与线段和差问题",
                    value: "圆与线段和差问题",
                  },
                  {
                    label: "圆与全等",
                    value: "圆与全等",
                  },
                  {
                    label: "圆与勾股",
                    value: "圆与勾股",
                  },
                  {
                    label: "圆与相似",
                    value: "圆与相似",
                  },
                  {
                    label: "圆与三角函数",
                    value: "圆与三角函数",
                  },
                  {
                    label: "圆与特殊角",
                    value: "圆与特殊角",
                  },
                  {
                    label: "圆与等腰+平行线",
                    value: "圆与等腰+平行线",
                  },
                  {
                    label: "圆与平面直角坐标系",
                    value: "圆与平面直角坐标系",
                  },
                  {
                    label: "圆与其他综合",
                    value: "圆与其他综合",
                  },
                  {
                    label: "与圆有关的动点、轨迹问题",
                    value: "与圆有关的动点、轨迹问题",
                  },
                  {
                    label: "圆与最值问题",
                    value: "圆与最值问题",
                  },
                  {
                    label: "圆中最值",
                    value: "圆中最值",
                  },
                  {
                    label: "与圆有关的新定义",
                    value: "与圆有关的新定义",
                  },
                  {
                    label: "圆与找规律",
                    value: "圆与找规律",
                  },
                ],
              },
              {
                label: "了解三角形的内心与外心",
                value: "了解三角形的内心与外心",
                children: [
                  {
                    label: "三角形五心",
                    value: "三角形五心",
                  },
                  {
                    label: "三角形的外接圆",
                    value: "三角形的外接圆",
                  },
                  {
                    label: "三角形内切圆",
                    value: "三角形内切圆",
                  },
                ],
              },
              {
                label: "了解直线与圆的位置关系",
                value: "了解直线与圆的位置关系",
                children: [
                  {
                    label: "直线和圆的位置关系",
                    value: "直线和圆的位置关系",
                  },
                  {
                    label: "根据直线与圆的位置关系求解",
                    value: "根据直线与圆的位置关系求解",
                  },
                  {
                    label: "圆和圆的位置关系",
                    value: "圆和圆的位置关系",
                  },
                  {
                    label: "已知两圆位置关系，求半径或圆心距",
                    value: "已知两圆位置关系，求半径或圆心距",
                  },
                  {
                    label: "两圆位置关系综合题",
                    value: "两圆位置关系综合题",
                  },
                ],
              },
              {
                label: "掌握切线的概念",
                value: "掌握切线的概念",
                children: [
                  {
                    label: "切线的性质定理",
                    value: "切线的性质定理",
                  },
                  {
                    label: "切线的判定定理",
                    value: "切线的判定定理",
                  },
                  {
                    label: "圆外切四边形",
                    value: "圆外切四边形",
                  },
                  {
                    label: "相交弦定理",
                    value: "相交弦定理",
                  },
                  {
                    label: "切割线定理",
                    value: "切割线定理",
                  },
                  {
                    label: "割线定理",
                    value: "割线定理",
                  },
                  {
                    label: "弦切角定理的应用",
                    value: "弦切角定理的应用",
                  },
                ],
              },
              {
                label: "能用尺规作图：过不在同一直线上的三点作圆",
                value: "能用尺规作图：过不在同一直线上的三点作圆",
                children: [
                  {
                    label: "找圆心",
                    value: "找圆心",
                  },
                ],
              },
              {
                label: "能用尺规作图：作三角形的外 接圆、内切圆",
                value: "能用尺规作图：作三角形的外 接圆、内切圆",
                children: [
                  {
                    label: "作三角形的外接圆",
                    value: "作三角形的外接圆",
                  },
                  {
                    label: "作三角形的内切圆",
                    value: "作三角形的内切圆",
                  },
                  {
                    label: "作外接圆、外心",
                    value: "作外接圆、外心",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "能用尺规作图：作圆的内接正方形和内接正六边形",
                value: "能用尺规作图：作圆的内接正方形和内接正六边形",
                children: [
                  {
                    label: "作圆的内接正多边形",
                    value: "作圆的内接正多边形",
                  },
                  {
                    label: "作圆的内接正三角形",
                    value: "作圆的内接正三角形",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "* 能用尺规作图：过圆外一点作圆的切线。",
                value: "* 能用尺规作图：过圆外一点作圆的切线。",
                children: [
                  {
                    label: "过已知点作已知圆的切线",
                    value: "过已知点作已知圆的切线",
                  },
                  {
                    label: "作图依据",
                    value: "作图依据",
                  },
                ],
              },
              {
                label: "* 探索并证明切线长定理：过圆外一点的两条切线长相等。",
                value: "* 探索并证明切线长定理：过圆外一点的两条切线长相等。",
                children: [
                  {
                    label: "切线长定理",
                    value: "切线长定理",
                  },
                  {
                    label: "圆外切四边形",
                    value: "圆外切四边形",
                  },
                ],
              },
              {
                label: "会计算圆的弧长",
                value: "会计算圆的弧长",
                children: [
                  {
                    label: "弧长公式",
                    value: "弧长公式",
                  },
                  {
                    label: "与圆有关的不规则图形的周长与面积计算",
                    value: "与圆有关的不规则图形的周长与面积计算",
                  },
                  {
                    label: "圆的滚动",
                    value: "圆的滚动",
                  },
                  {
                    label: "其他图形的的滚动",
                    value: "其他图形的的滚动",
                  },
                  {
                    label: "求圆锥展开图扇形的圆心角",
                    value: "求圆锥展开图扇形的圆心角",
                  },
                  {
                    label: "求圆锥的底面半径",
                    value: "求圆锥的底面半径",
                  },
                  {
                    label: "求圆锥的高",
                    value: "求圆锥的高",
                  },
                  {
                    label: "求圆锥的侧面积",
                    value: "求圆锥的侧面积",
                  },
                  {
                    label: "求圆锥的母线",
                    value: "求圆锥的母线",
                  },
                  {
                    label: "求圆锥中母线与高的夹角",
                    value: "求圆锥中母线与高的夹角",
                  },
                ],
              },
              {
                label: "会计算扇形的面积",
                value: "会计算扇形的面积",
                children: [
                  {
                    label: "扇形的面积公式",
                    value: "扇形的面积公式",
                  },
                  {
                    label: "与圆有关的不规则图形的周长与面积计算",
                    value: "与圆有关的不规则图形的周长与面积计算",
                  },
                  {
                    label: "圆的滚动",
                    value: "圆的滚动",
                  },
                  {
                    label: "其他图形的的滚动",
                    value: "其他图形的的滚动",
                  },
                  {
                    label: "求圆锥展开图扇形的圆心角",
                    value: "求圆锥展开图扇形的圆心角",
                  },
                  {
                    label: "求圆锥的底面半径",
                    value: "求圆锥的底面半径",
                  },
                  {
                    label: "求圆锥的高",
                    value: "求圆锥的高",
                  },
                  {
                    label: "求圆锥的侧面积",
                    value: "求圆锥的侧面积",
                  },
                  {
                    label: "求圆锥的母线",
                    value: "求圆锥的母线",
                  },
                  {
                    label: "求圆锥中母线与高的夹角",
                    value: "求圆锥中母线与高的夹角",
                  },
                ],
              },
              {
                label: "了解正多边形的概念及正多边形与圆的关系",
                value: "了解正多边形的概念及正多边形与圆的关系",
                children: [
                  {
                    label: "正多边形与圆的关系",
                    value: "正多边形与圆的关系",
                  },
                  {
                    label: "正多边形的中心与中心角",
                    value: "正多边形的中心与中心角",
                  },
                  {
                    label: "正多边形的半径与边心距",
                    value: "正多边形的半径与边心距",
                  },
                  {
                    label: "圆内接正多边形相关计算",
                    value: "圆内接正多边形相关计算",
                  },
                  {
                    label: "圆外切正多边形相关计算",
                    value: "圆外切正多边形相关计算",
                  },
                  {
                    label: "正多边形与圆的综合",
                    value: "正多边形与圆的综合",
                  },
                ],
              },
            ],
          },
          {
            label: "定义、命题、定理",
            value: "定义、命题、定理",
            children: [
              {
                label: "通过具体实例，了解定义、命题、定理、推论的意义",
                value: "通过具体实例，了解定义、命题、定理、推论的意义",
                children: [
                  {
                    label: "定理与逆定理",
                    value: "定理与逆定理",
                  },
                ],
              },
              {
                label: "结合具体实例，会区分命题的条件和结论",
                value: "结合具体实例，会区分命题的条件和结论",
                children: [
                  {
                    label: "改写命题（如果…那么…）",
                    value: "改写命题（如果…那么…）",
                  },
                ],
              },
              {
                label: "了解原命题及其逆命题的概念",
                value: "了解原命题及其逆命题的概念",
                children: [
                  {
                    label: "逆命题",
                    value: "逆命题",
                  },
                ],
              },
              {
                label: "会识别两个互逆的命题",
                value: "会识别两个互逆的命题",
                children: [
                  {
                    label: "逆命题",
                    value: "逆命题",
                  },
                ],
              },
              {
                label: "知道原命题成立其逆命题不一 定成立",
                value: "知道原命题成立其逆命题不一 定成立",
                children: [
                  {
                    label: "逆命题",
                    value: "逆命题",
                  },
                  {
                    label: "区分真假命题",
                    value: "区分真假命题",
                  },
                ],
              },
              {
                label: "了解反例的作用",
                value: "了解反例的作用",
                children: [
                  {
                    label: "反证法的应用",
                    value: "反证法的应用",
                  },
                ],
              },
              {
                label: "知道利用反例可以判断一个命题是错误的",
                value: "知道利用反例可以判断一个命题是错误的",
                children: [
                  {
                    label: "反证法的应用",
                    value: "反证法的应用",
                  },
                ],
              },
              {
                label: "通过实例体会反证法的含义",
                value: "通过实例体会反证法的含义",
                children: [
                  {
                    label: "反证法的应用",
                    value: "反证法的应用",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        label: "图形的变化",
        value: "图形的变化",
        children: [
          {
            label: "图形的轴对称",
            value: "图形的轴对称",
            children: [
              {
                label:
                  "通过具体实例理解轴对称的概念，探索它的基本性质：成轴对 称的两个图形中对应点的连线被对称轴垂直平分",
                value:
                  "通过具体实例理解轴对称的概念，探索它的基本性质：成轴对 称的两个图形中对应点的连线被对称轴垂直平分",
                children: [
                  {
                    label: "轴对称的定义",
                    value: "轴对称的定义",
                  },
                  {
                    label: "轴对称的性质",
                    value: "轴对称的性质",
                  },
                  {
                    label: "对称轴条数问题",
                    value: "对称轴条数问题",
                  },
                  {
                    label: "画对称轴",
                    value: "画对称轴",
                  },
                  {
                    label: "线段和的最小值",
                    value: "线段和的最小值",
                  },
                  {
                    label: "线段差的绝对值最小",
                    value: "线段差的绝对值最小",
                  },
                  {
                    label: "线段差的绝对值最大",
                    value: "线段差的绝对值最大",
                  },
                  {
                    label: "三角形周长最小",
                    value: "三角形周长最小",
                  },
                  {
                    label: "四边形周长最小",
                    value: "四边形周长最小",
                  },
                  {
                    label: "造桥问题",
                    value: "造桥问题",
                  },
                  {
                    label: "定长线段运动问题",
                    value: "定长线段运动问题",
                  },
                ],
              },
              {
                label:
                  "能画出简单平面图形(点、线段、直线、三角形等)关于给定对称轴的对称图形",
                value:
                  "能画出简单平面图形(点、线段、直线、三角形等)关于给定对称轴的对称图形",
                children: [
                  {
                    label: "补充图形为轴对称图形",
                    value: "补充图形为轴对称图形",
                  },
                  {
                    label: "作轴对称变换",
                    value: "作轴对称变换",
                  },
                ],
              },
              {
                label: "理解轴对称图形的概念",
                value: "理解轴对称图形的概念",
                children: [
                  {
                    label: "轴对称图形的定义",
                    value: "轴对称图形的定义",
                  },
                  {
                    label: "判断是否为成轴对称图形",
                    value: "判断是否为成轴对称图形",
                  },
                ],
              },
              {
                label: "探索等腰三角形、矩形、菱形、正多 边形、圆的轴对称性质",
                value: "探索等腰三角形、矩形、菱形、正多 边形、圆的轴对称性质",
                children: [
                  {
                    label: "轴对称的性质",
                    value: "轴对称的性质",
                  },
                  {
                    label: "圆中对称性",
                    value: "圆中对称性",
                  },
                  {
                    label: "等腰三角形的对称性",
                    value: "等腰三角形的对称性",
                  },
                ],
              },
              {
                label: "认识并欣赏自然界和现实生活中的轴对称图形",
                value: "认识并欣赏自然界和现实生活中的轴对称图形",
                children: [
                  {
                    label: "翻折问题与全等",
                    value: "翻折问题与全等",
                  },
                  {
                    label: "翻折问题与勾股定理",
                    value: "翻折问题与勾股定理",
                  },
                  {
                    label: "其它翻折问题",
                    value: "其它翻折问题",
                  },
                  {
                    label: "镜面对称",
                    value: "镜面对称",
                  },
                  {
                    label: "折纸问题与剪拼",
                    value: "折纸问题与剪拼",
                  },
                  {
                    label: "构造对称全等",
                    value: "构造对称全等",
                  },
                  {
                    label: "四边形与折叠问题",
                    value: "四边形与折叠问题",
                  },
                ],
              },
            ],
          },
          {
            label: "图形的旋转",
            value: "图形的旋转",
            children: [
              {
                label:
                  "通过具体实例认识平面图形关于旋转中心的旋转。探索它的基本性质：一个图形和旋转得到的图形中，对应点到旋转中心距离相等，两组对应点分别与旋转中心连线所成的角相等。",
                value:
                  "通过具体实例认识平面图形关于旋转中心的旋转。探索它的基本性质：一个图形和旋转得到的图形中，对应点到旋转中心距离相等，两组对应点分别与旋转中心连线所成的角相等。",
                children: [
                  {
                    label: "旋转的定义",
                    value: "旋转的定义",
                  },
                  {
                    label: "旋转的性质",
                    value: "旋转的性质",
                  },
                  {
                    label: "利用旋转求线段长",
                    value: "利用旋转求线段长",
                  },
                  {
                    label: "确定旋转中心",
                    value: "确定旋转中心",
                  },
                  {
                    label: "求旋转角",
                    value: "求旋转角",
                  },
                  {
                    label: "旋转求周长和面积",
                    value: "旋转求周长和面积",
                  },
                  {
                    label: "作出旋转后的图形",
                    value: "作出旋转后的图形",
                  },
                  {
                    label: "坐标系的旋转作图",
                    value: "坐标系的旋转作图",
                  },
                  {
                    label: "坐标系中的旋转-点关于原点的旋转",
                    value: "坐标系中的旋转-点关于原点的旋转",
                  },
                  {
                    label: "坐标系中的旋转-点关于一般点的旋转",
                    value: "坐标系中的旋转-点关于一般点的旋转",
                  },
                  {
                    label: "坐标系中的旋转-图形关于原点的旋转",
                    value: "坐标系中的旋转-图形关于原点的旋转",
                  },
                  {
                    label: "坐标系中的旋转-图形关于特殊点的旋转",
                    value: "坐标系中的旋转-图形关于特殊点的旋转",
                  },
                  {
                    label: "一次函数图象绕原点旋转特殊角度",
                    value: "一次函数图象绕原点旋转特殊角度",
                  },
                  {
                    label: "一次函数图象绕任意点旋转特殊角度",
                    value: "一次函数图象绕任意点旋转特殊角度",
                  },
                  {
                    label: "二次函数图象旋转90°",
                    value: "二次函数图象旋转90°",
                  },
                  {
                    label: "四边形与旋转问题",
                    value: "四边形与旋转问题",
                  },
                  {
                    label: "图形的剪拼",
                    value: "图形的剪拼",
                  },
                  {
                    label: "等边三角形的手拉手模型",
                    value: "等边三角形的手拉手模型",
                  },
                  {
                    label: "等腰直角三角形的手拉手模型",
                    value: "等腰直角三角形的手拉手模型",
                  },
                  {
                    label: "等腰三角形的手拉手模型",
                    value: "等腰三角形的手拉手模型",
                  },
                  {
                    label: "正方形等其他图形的手拉手模型",
                    value: "正方形等其他图形的手拉手模型",
                  },
                  {
                    label: "对角互补模型",
                    value: "对角互补模型",
                  },
                  {
                    label: "正方形中的半角模型",
                    value: "正方形中的半角模型",
                  },
                  {
                    label: "等腰直角三角形中的半角模型",
                    value: "等腰直角三角形中的半角模型",
                  },
                  {
                    label: "等边三角形中的半角模型",
                    value: "等边三角形中的半角模型",
                  },
                  {
                    label: "多边形中的半角模型",
                    value: "多边形中的半角模型",
                  },
                  {
                    label: "费马点",
                    value: "费马点",
                  },
                  {
                    label: "构造旋转全等",
                    value: "构造旋转全等",
                  },
                  {
                    label: "旋转性质综合应用",
                    value: "旋转性质综合应用",
                  },
                ],
              },
              {
                label: "了解中心对称、中心对称图形的概念",
                value: "了解中心对称、中心对称图形的概念",
                children: [
                  {
                    label: "中心对称的定义",
                    value: "中心对称的定义",
                  },
                  {
                    label: "中心对称图形的定义",
                    value: "中心对称图形的定义",
                  },
                  {
                    label: "判断轴对称图形和中心对称图形",
                    value: "判断轴对称图形和中心对称图形",
                  },
                ],
              },
              {
                label:
                  "探索中心对称、中心对称图形的基本性质： 成中心对称的两个图形中，对应点的连线经过对称中心，且被对称中心平分。",
                value:
                  "探索中心对称、中心对称图形的基本性质： 成中心对称的两个图形中，对应点的连线经过对称中心，且被对称中心平分。",
                children: [
                  {
                    label: "中心对称的性质",
                    value: "中心对称的性质",
                  },
                  {
                    label: "关于一点作中心对称",
                    value: "关于一点作中心对称",
                  },
                  {
                    label: "作图确定中心对称的对称中心",
                    value: "作图确定中心对称的对称中心",
                  },
                  {
                    label: "坐标系中的对称-点关于原点的对称",
                    value: "坐标系中的对称-点关于原点的对称",
                  },
                  {
                    label: "一次函数图象关于原点对称",
                    value: "一次函数图象关于原点对称",
                  },
                  {
                    label: "一次函数图象关于任意点对称",
                    value: "一次函数图象关于任意点对称",
                  },
                  {
                    label: "二次函数图象关于原点对称",
                    value: "二次函数图象关于原点对称",
                  },
                  {
                    label: "二次函数图象关于任意点对称",
                    value: "二次函数图象关于任意点对称",
                  },
                ],
              },
              {
                label: "探索线段、平行四边形、正多边形、圆的中心对称性质",
                value: "探索线段、平行四边形、正多边形、圆的中心对称性质",
                children: [
                  {
                    label: "平行四边形的对称性",
                    value: "平行四边形的对称性",
                  },
                  {
                    label: "中心对称等分平行四边形面积",
                    value: "中心对称等分平行四边形面积",
                  },
                  {
                    label: "圆中对称性",
                    value: "圆中对称性",
                  },
                  {
                    label: "中心对称图形应用",
                    value: "中心对称图形应用",
                  },
                ],
              },
              {
                label: "认识并欣赏自然界和现实生活中的中心对称图形",
                value: "认识并欣赏自然界和现实生活中的中心对称图形",
                children: [
                  {
                    label: "中心对称图形应用",
                    value: "中心对称图形应用",
                  },
                ],
              },
            ],
          },
          {
            label: "图形的平移",
            value: "图形的平移",
            children: [
              {
                label:
                  "通过具体实例认识平移，探索它的基本性质：一个图形和它经过平移所得的图形中，两组对应点的连线平行(或在同一条直线上) 且相等",
                value:
                  "通过具体实例认识平移，探索它的基本性质：一个图形和它经过平移所得的图形中，两组对应点的连线平行(或在同一条直线上) 且相等",
                children: [
                  {
                    label: "平移的定义",
                    value: "平移的定义",
                  },
                  {
                    label: "平移的性质",
                    value: "平移的性质",
                  },
                  {
                    label: "平移作图",
                    value: "平移作图",
                  },
                ],
              },
              {
                label: "认识并欣赏平移在自然界和现实生活中的应用",
                value: "认识并欣赏平移在自然界和现实生活中的应用",
                children: [
                  {
                    label: "利用平移构造辅助线",
                    value: "利用平移构造辅助线",
                  },
                ],
              },
              {
                label: "运用图形的轴对称、旋转、平移进行图案设计",
                value: "运用图形的轴对称、旋转、平移进行图案设计",
                children: [
                  {
                    label: "平移构造特殊图形",
                    value: "平移构造特殊图形",
                  },
                  {
                    label: "利用轴对称设计图案",
                    value: "利用轴对称设计图案",
                  },
                  {
                    label: "利用旋转设计图形",
                    value: "利用旋转设计图形",
                  },
                ],
              },
            ],
          },
          {
            label: "图形的相似",
            value: "图形的相似",
            children: [
              {
                label: "了解比例的基本性质、线段的比、成比例的线段",
                value: "了解比例的基本性质、线段的比、成比例的线段",
                children: [
                  {
                    label: "比的读法、写法及各部分名称",
                    value: "比的读法、写法及各部分名称",
                  },
                  {
                    label: "比和除法的关系",
                    value: "比和除法的关系",
                  },
                  {
                    label: "比和分数的关系",
                    value: "比和分数的关系",
                  },
                  {
                    label: "最简整数比",
                    value: "最简整数比",
                  },
                  {
                    label: "比值",
                    value: "比值",
                  },
                  {
                    label: "比的性质",
                    value: "比的性质",
                  },
                  {
                    label: "比例的意义",
                    value: "比例的意义",
                  },
                  {
                    label: "比例的性质",
                    value: "比例的性质",
                  },
                  {
                    label: "解比例方程",
                    value: "解比例方程",
                  },
                  {
                    label: "用比例解决实际问题",
                    value: "用比例解决实际问题",
                  },
                  {
                    label: "比例尺的定义",
                    value: "比例尺的定义",
                  },
                  {
                    label: "线段比例尺和数值比例尺的互化",
                    value: "线段比例尺和数值比例尺的互化",
                  },
                  {
                    label: "与比例尺有关的实际问题",
                    value: "与比例尺有关的实际问题",
                  },
                  {
                    label: "比例线段的定义",
                    value: "比例线段的定义",
                  },
                  {
                    label: "比例的基本性质",
                    value: "比例的基本性质",
                  },
                  {
                    label: "比例中项",
                    value: "比例中项",
                  },
                  {
                    label: "比例尺的计算",
                    value: "比例尺的计算",
                  },
                  {
                    label: "比例线段的性质",
                    value: "比例线段的性质",
                  },
                  {
                    label: "比例的综合应用",
                    value: "比例的综合应用",
                  },
                ],
              },
              {
                label: "通过建筑、 艺术上的实例了解黄金分割",
                value: "通过建筑、 艺术上的实例了解黄金分割",
                children: [
                  {
                    label: "黄金分割",
                    value: "黄金分割",
                  },
                ],
              },
              {
                label: "通过具体实例认识图形的相似",
                value: "通过具体实例认识图形的相似",
                children: [
                  {
                    label: "相似形",
                    value: "相似形",
                  },
                ],
              },
              {
                label: "了解相似多边形和相似比",
                value: "了解相似多边形和相似比",
                children: [
                  {
                    label: "相似形",
                    value: "相似形",
                  },
                  {
                    label: "相似比",
                    value: "相似比",
                  },
                  {
                    label: "相似三角形的定义",
                    value: "相似三角形的定义",
                  },
                ],
              },
              {
                label:
                  "掌握基本事实：两条直线被一组平行线所截，所得的对应线段成比例",
                value:
                  "掌握基本事实：两条直线被一组平行线所截，所得的对应线段成比例",
                children: [
                  {
                    label: "平行线分线段成比例定理",
                    value: "平行线分线段成比例定理",
                  },
                  {
                    label: "基本事实",
                    value: "基本事实",
                  },
                ],
              },
              {
                label:
                  "了解相似三角形的判定定理：两角分别相等的两个三角形相似；两边成比例且夹角相等的两个三角形相似；三边成比例的两个三角形相似",
                value:
                  "了解相似三角形的判定定理：两角分别相等的两个三角形相似；两边成比例且夹角相等的两个三角形相似；三边成比例的两个三角形相似",
                children: [
                  {
                    label: "相似三角形的判定-预备定理（平行）",
                    value: "相似三角形的判定-预备定理（平行）",
                  },
                  {
                    label: "相似三角形的判定-三边对应成比例",
                    value: "相似三角形的判定-三边对应成比例",
                  },
                  {
                    label: "相似三角形的判定-两边对应成比例及其夹角相等",
                    value: "相似三角形的判定-两边对应成比例及其夹角相等",
                  },
                  {
                    label: "相似三角形的判定-两角对应相等",
                    value: "相似三角形的判定-两角对应相等",
                  },
                  {
                    label: "加入条件使得三角形相似",
                    value: "加入条件使得三角形相似",
                  },
                  {
                    label: "相似三角形的判定-多解或是多种判定混合",
                    value: "相似三角形的判定-多解或是多种判定混合",
                  },
                  {
                    label: "网格中的三角形相似",
                    value: "网格中的三角形相似",
                  },
                  {
                    label: "相似三角形的存在性",
                    value: "相似三角形的存在性",
                  },
                  {
                    label: "相似A字型",
                    value: "相似A字型",
                  },
                  {
                    label: "相似反A字型",
                    value: "相似反A字型",
                  },
                  {
                    label: "相似8字型",
                    value: "相似8字型",
                  },
                  {
                    label: "相似反8字型",
                    value: "相似反8字型",
                  },
                  {
                    label: "A字型、8字型综合",
                    value: "A字型、8字型综合",
                  },
                  {
                    label: "射影定理（双垂直）",
                    value: "射影定理（双垂直）",
                  },
                  {
                    label: "三角形内接四边形问题",
                    value: "三角形内接四边形问题",
                  },
                  {
                    label: "一线三等角相似",
                    value: "一线三等角相似",
                  },
                  {
                    label: "旋转类相似",
                    value: "旋转类相似",
                  },
                  {
                    label: "相似模型的构造和应用",
                    value: "相似模型的构造和应用",
                  },
                  {
                    label: "相似与角平分线",
                    value: "相似与角平分线",
                  },
                  {
                    label: "相似三角形的性质与判定综合",
                    value: "相似三角形的性质与判定综合",
                  },
                ],
              },
              {
                label: "*了解相似三角形判定定理的证明",
                value: "*了解相似三角形判定定理的证明",
                children: [
                  {
                    label: "相似三角形的判定-预备定理（平行）",
                    value: "相似三角形的判定-预备定理（平行）",
                  },
                  {
                    label: "相似三角形的判定-三边对应成比例",
                    value: "相似三角形的判定-三边对应成比例",
                  },
                  {
                    label: "相似三角形的判定-两边对应成比例及其夹角相等",
                    value: "相似三角形的判定-两边对应成比例及其夹角相等",
                  },
                  {
                    label: "相似三角形的判定-两角对应相等",
                    value: "相似三角形的判定-两角对应相等",
                  },
                  {
                    label: "加入条件使得三角形相似",
                    value: "加入条件使得三角形相似",
                  },
                  {
                    label: "相似三角形的判定-多解或是多种判定混合",
                    value: "相似三角形的判定-多解或是多种判定混合",
                  },
                  {
                    label: "网格中的三角形相似",
                    value: "网格中的三角形相似",
                  },
                  {
                    label: "相似三角形的存在性",
                    value: "相似三角形的存在性",
                  },
                ],
              },
              {
                label:
                  "了解相似三角形的性质定理：相似三角形对应线段的比等于相似比；面积比等于相似比的平方",
                value:
                  "了解相似三角形的性质定理：相似三角形对应线段的比等于相似比；面积比等于相似比的平方",
                children: [
                  {
                    label: "相似三角形的性质",
                    value: "相似三角形的性质",
                  },
                  {
                    label: "作图：相似变换",
                    value: "作图：相似变换",
                  },
                ],
              },
              {
                label: "了解图形的位似",
                value: "了解图形的位似",
                children: [
                  {
                    label: "位似图形的定义",
                    value: "位似图形的定义",
                  },
                  {
                    label: "位似图形的性质",
                    value: "位似图形的性质",
                  },
                  {
                    label: "作位似图形",
                    value: "作位似图形",
                  },
                  {
                    label: "确定位似中心",
                    value: "确定位似中心",
                  },
                ],
              },
              {
                label: "知道利用位似可以将一个图形放大或缩小",
                value: "知道利用位似可以将一个图形放大或缩小",
                children: [
                  {
                    label: "位似应用",
                    value: "位似应用",
                  },
                ],
              },
              {
                label: "会利用图形的相似解决一些简单的实际问题",
                value: "会利用图形的相似解决一些简单的实际问题",
                children: [
                  {
                    label: "相似三角形与实际问题",
                    value: "相似三角形与实际问题",
                  },
                  {
                    label: "相似三角形中的动点问题",
                    value: "相似三角形中的动点问题",
                  },
                  {
                    label: "阿氏圆问题",
                    value: "阿氏圆问题",
                  },
                  {
                    label: "与相似有关的新定义",
                    value: "与相似有关的新定义",
                  },
                ],
              },
              {
                label:
                  "利用相似的直角三角形，探索并认识锐角三角函数 (sin A, cos A,tan A)",
                value:
                  "利用相似的直角三角形，探索并认识锐角三角函数 (sin A, cos A,tan A)",
                children: [
                  {
                    label: "正弦的定义",
                    value: "正弦的定义",
                  },
                  {
                    label: "余弦的定义",
                    value: "余弦的定义",
                  },
                  {
                    label: "正切的定义",
                    value: "正切的定义",
                  },
                ],
              },
              {
                label: "知道$30^\\circ,45^\\circ,60^\\circ$角的三角函数值",
                value: "知道$30^\\circ,45^\\circ,60^\\circ$角的三角函数值",
                children: [
                  {
                    label: "探究特殊角的三角函数值",
                    value: "探究特殊角的三角函数值",
                  },
                  {
                    label: "含锐角三角函数的实数运算",
                    value: "含锐角三角函数的实数运算",
                  },
                ],
              },
              {
                label: "会使用计算器由已知锐角求它的三角函数值",
                value: "会使用计算器由已知锐角求它的三角函数值",
                children: [
                  {
                    label: "探究一般角的三角函数的值",
                    value: "探究一般角的三角函数的值",
                  },
                  {
                    label: "计算器的使用",
                    value: "计算器的使用",
                  },
                ],
              },
              {
                label: "会使用计算器由已知三角函数值求它的对应锐角",
                value: "会使用计算器由已知三角函数值求它的对应锐角",
                children: [
                  {
                    label: "探究一般角的三角函数的值",
                    value: "探究一般角的三角函数的值",
                  },
                  {
                    label: "计算器的使用",
                    value: "计算器的使用",
                  },
                ],
              },
              {
                label: "能用锐角三角函数解直角三角形",
                value: "能用锐角三角函数解直角三角形",
                children: [
                  {
                    label: "解直角三角形的定义及常见类型",
                    value: "解直角三角形的定义及常见类型",
                  },
                ],
              },
              {
                label: "能用锐角三角函数的知识解决一些简单的实际问题",
                value: "能用锐角三角函数的知识解决一些简单的实际问题",
                children: [
                  {
                    label: "仰角与俯角",
                    value: "仰角与俯角",
                  },
                  {
                    label: "坡度",
                    value: "坡度",
                  },
                  {
                    label: "方位角在锐角三角函数中的应用",
                    value: "方位角在锐角三角函数中的应用",
                  },
                  {
                    label: "三角板拼接问题",
                    value: "三角板拼接问题",
                  },
                  {
                    label: "测量物体之间的距离",
                    value: "测量物体之间的距离",
                  },
                  {
                    label: "影子问题",
                    value: "影子问题",
                  },
                  {
                    label: "解直角三角形的综合应用",
                    value: "解直角三角形的综合应用",
                  },
                  {
                    label: "海伦公式",
                    value: "海伦公式",
                  },
                  {
                    label: "胡不归问题",
                    value: "胡不归问题",
                  },
                  {
                    label: "与三角函数有关的新定义",
                    value: "与三角函数有关的新定义",
                  },
                ],
              },
            ],
          },
          {
            label: "图形的投影",
            value: "图形的投影",
            children: [
              {
                label: "通过丰富的实例，了解中心投影和平行投影的概念",
                value: "通过丰富的实例，了解中心投影和平行投影的概念",
                children: [
                  {
                    label: "平行投影",
                    value: "平行投影",
                  },
                  {
                    label: "中心投影",
                    value: "中心投影",
                  },
                  {
                    label: "正投影",
                    value: "正投影",
                  },
                  {
                    label: "视点、视角和盲区",
                    value: "视点、视角和盲区",
                  },
                ],
              },
              {
                label: "会画直棱柱、圆柱、圆锥、球的主视图、左视图、俯视图",
                value: "会画直棱柱、圆柱、圆锥、球的主视图、左视图、俯视图",
                children: [
                  {
                    label: "简单几何体三视图",
                    value: "简单几何体三视图",
                  },
                ],
              },
              {
                label: "能判断简单物体的视图",
                value: "能判断简单物体的视图",
                children: [
                  {
                    label: "综合体的三视图",
                    value: "综合体的三视图",
                  },
                  {
                    label: "简单几何体三视图",
                    value: "简单几何体三视图",
                  },
                ],
              },
              {
                label: "会根据视图描述简单的几何体",
                value: "会根据视图描述简单的几何体",
                children: [
                  {
                    label: "由三视图判断几何体",
                    value: "由三视图判断几何体",
                  },
                ],
              },
              {
                label: "了解直棱柱、圆锥的侧面展开图",
                value: "了解直棱柱、圆锥的侧面展开图",
                children: [
                  {
                    label: "正方体展开图",
                    value: "正方体展开图",
                  },
                  {
                    label: "其他立体图形展开图",
                    value: "其他立体图形展开图",
                  },
                  {
                    label: "圆锥的展开图",
                    value: "圆锥的展开图",
                  },
                ],
              },
              {
                label: "能根据展开图想象和制作模型",
                value: "能根据展开图想象和制作模型",
                children: [
                  {
                    label: "展开图还原成常见几何体",
                    value: "展开图还原成常见几何体",
                  },
                ],
              },
              {
                label: "通过实例，了解上述视图与展开图在现实生活中的应用",
                value: "通过实例，了解上述视图与展开图在现实生活中的应用",
                children: [
                  {
                    label: "三视图的计数",
                    value: "三视图的计数",
                  },
                  {
                    label: "三视图的计算",
                    value: "三视图的计算",
                  },
                  {
                    label: "根据三视图计算立体图形表面积和体积",
                    value: "根据三视图计算立体图形表面积和体积",
                  },
                  {
                    label: "正方体的对、邻面",
                    value: "正方体的对、邻面",
                  },
                  {
                    label: "带有图案等细节的立方体展开图问题",
                    value: "带有图案等细节的立方体展开图问题",
                  },
                  {
                    label: "由正方体运动产生的展开图问题",
                    value: "由正方体运动产生的展开图问题",
                  },
                  {
                    label: "立体图形表面最短距离问题",
                    value: "立体图形表面最短距离问题",
                  },
                  {
                    label: "立体图形路径最短",
                    value: "立体图形路径最短",
                  },
                  {
                    label: "勾股定理与展开图最短路径问题",
                    value: "勾股定理与展开图最短路径问题",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        label: "图形与坐标",
        value: "图形与坐标",
        children: [
          {
            label: "图形的位置与坐标",
            value: "图形的位置与坐标",
            children: [
              {
                label: "理解平面直角坐标系的有关概念",
                value: "理解平面直角坐标系的有关概念",
                children: [
                  {
                    label: "有序数对",
                    value: "有序数对",
                  },
                  {
                    label: "平面直角坐标系的定义",
                    value: "平面直角坐标系的定义",
                  },
                  {
                    label: "象限",
                    value: "象限",
                  },
                  {
                    label: "点的坐标",
                    value: "点的坐标",
                  },
                  {
                    label: "象限内坐标的特征",
                    value: "象限内坐标的特征",
                  },
                  {
                    label: "坐标轴上点的坐标特征",
                    value: "坐标轴上点的坐标特征",
                  },
                  {
                    label: "平行于坐标轴的直线上点的坐标特征",
                    value: "平行于坐标轴的直线上点的坐标特征",
                  },
                  {
                    label: "角平分线上点的坐标特征",
                    value: "角平分线上点的坐标特征",
                  },
                  {
                    label: "中点坐标",
                    value: "中点坐标",
                  },
                  {
                    label: "坐标与距离",
                    value: "坐标与距离",
                  },
                  {
                    label: "已知坐标求面积",
                    value: "已知坐标求面积",
                  },
                  {
                    label: "已知面积求坐标",
                    value: "已知面积求坐标",
                  },
                  {
                    label: "坐标系中的动点问题（非函数）",
                    value: "坐标系中的动点问题（非函数）",
                  },
                ],
              },
              {
                label: "能画出平面直角坐标系",
                value: "能画出平面直角坐标系",
                children: [
                  {
                    label: "建立坐标系",
                    value: "建立坐标系",
                  },
                ],
              },
              {
                label: "在给定的平面直角坐标系中，能根据坐标描出点的位置",
                value: "在给定的平面直角坐标系中，能根据坐标描出点的位置",
                children: [
                  {
                    label: "根据坐标描点、根据点写坐标",
                    value: "根据坐标描点、根据点写坐标",
                  },
                ],
              },
              {
                label: "在给定的平面直角坐标系中，能由点的位置写出坐标。",
                value: "在给定的平面直角坐标系中，能由点的位置写出坐标。",
                children: [
                  {
                    label: "根据坐标描点、根据点写坐标",
                    value: "根据坐标描点、根据点写坐标",
                  },
                ],
              },
              {
                label:
                  "在实际问题中，能建立适当的平面直角坐标系，描述物体的位置",
                value:
                  "在实际问题中，能建立适当的平面直角坐标系，描述物体的位置",
                children: [
                  {
                    label: "用坐标表示地理位置",
                    value: "用坐标表示地理位置",
                  },
                  {
                    label: "建立坐标系",
                    value: "建立坐标系",
                  },
                ],
              },
              {
                label:
                  "对给定的正方形，会选择合适的平面直角坐标系，写出它的顶点坐标",
                value:
                  "对给定的正方形，会选择合适的平面直角坐标系，写出它的顶点坐标",
                children: [
                  {
                    label: "正方形与平面直角坐标系综合",
                    value: "正方形与平面直角坐标系综合",
                  },
                ],
              },
              {
                label: "体会可以用坐标表达简单图形",
                value: "体会可以用坐标表达简单图形",
                children: [
                  {
                    label: "根据坐标描点、根据点写坐标",
                    value: "根据坐标描点、根据点写坐标",
                  },
                  {
                    label: "点坐标找规律",
                    value: "点坐标找规律",
                  },
                ],
              },
              {
                label: "在平面上，运用方位角和距离刻画两个物体的相对位置",
                value: "在平面上，运用方位角和距离刻画两个物体的相对位置",
                children: [
                  {
                    label: "方位角",
                    value: "方位角",
                  },
                ],
              },
            ],
          },
          {
            label: "图形的运动与坐标",
            value: "图形的运动与坐标",
            children: [
              {
                label:
                  "在平面直角坐标系中，以坐标轴为对称轴，能写出一个已知顶点坐标的多边形的对称图形的顶点坐标，知道对应顶点坐标之间的关系",
                value:
                  "在平面直角坐标系中，以坐标轴为对称轴，能写出一个已知顶点坐标的多边形的对称图形的顶点坐标，知道对应顶点坐标之间的关系",
                children: [
                  {
                    label: "坐标系中的对称-点关于坐标轴对称",
                    value: "坐标系中的对称-点关于坐标轴对称",
                  },
                  {
                    label: "坐标系中的对称-图形的对称",
                    value: "坐标系中的对称-图形的对称",
                  },
                  {
                    label: "坐标系的对称作图",
                    value: "坐标系的对称作图",
                  },
                  {
                    label: "坐标系中的对称-点关于特殊直线对称",
                    value: "坐标系中的对称-点关于特殊直线对称",
                  },
                  {
                    label: "一次函数图象关于坐标轴对称",
                    value: "一次函数图象关于坐标轴对称",
                  },
                  {
                    label: "一次函数图象关于任意直线对称",
                    value: "一次函数图象关于任意直线对称",
                  },
                  {
                    label: "一次函数图象关于角平分线对称",
                    value: "一次函数图象关于角平分线对称",
                  },
                  {
                    label: "一次函数关于平行于坐标轴的直线对称",
                    value: "一次函数关于平行于坐标轴的直线对称",
                  },
                  {
                    label: "一次函数图象部分对称",
                    value: "一次函数图象部分对称",
                  },
                  {
                    label: "二次函数图象关于坐标轴对称",
                    value: "二次函数图象关于坐标轴对称",
                  },
                  {
                    label: "二次函数关于平行坐标轴的直线对称",
                    value: "二次函数关于平行坐标轴的直线对称",
                  },
                  {
                    label: "二次函数图象部分对称",
                    value: "二次函数图象部分对称",
                  },
                ],
              },
              {
                label:
                  "在平面直角坐标系中，能写出一个已知顶点坐标的多边形沿坐标轴方向平移一定距离后图形的顶点坐标，知道对应顶点坐标之间的关系",
                value:
                  "在平面直角坐标系中，能写出一个已知顶点坐标的多边形沿坐标轴方向平移一定距离后图形的顶点坐标，知道对应顶点坐标之间的关系",
                children: [
                  {
                    label: "坐标系中的平移-点的平移",
                    value: "坐标系中的平移-点的平移",
                  },
                  {
                    label: "坐标系中的平移-图形的平移",
                    value: "坐标系中的平移-图形的平移",
                  },
                  {
                    label: "坐标系的平移作图",
                    value: "坐标系的平移作图",
                  },
                ],
              },
              {
                label:
                  "在平面直角坐标系中，探索并了解将一个多边形依次沿两个坐标轴方向平移后所得到的图形和原来图形具有平移关系，体会图形顶点坐标的变化",
                value:
                  "在平面直角坐标系中，探索并了解将一个多边形依次沿两个坐标轴方向平移后所得到的图形和原来图形具有平移关系，体会图形顶点坐标的变化",
                children: [
                  {
                    label: "坐标系中的平移-点的平移",
                    value: "坐标系中的平移-点的平移",
                  },
                  {
                    label: "坐标系中的平移-图形的平移",
                    value: "坐标系中的平移-图形的平移",
                  },
                  {
                    label: "坐标系的平移作图",
                    value: "坐标系的平移作图",
                  },
                  {
                    label: "一次函数平移变换",
                    value: "一次函数平移变换",
                  },
                  {
                    label: "二次函数平移变换",
                    value: "二次函数平移变换",
                  },
                ],
              },
              {
                label:
                  "在平面直角坐标系中，探索并了解将一个多边形的顶点坐标 (有一个顶点为原点)分别扩大或缩小相同倍数时所对应的图形与原图形是位似的",
                value:
                  "在平面直角坐标系中，探索并了解将一个多边形的顶点坐标 (有一个顶点为原点)分别扩大或缩小相同倍数时所对应的图形与原图形是位似的",
                children: [
                  {
                    label: "位似图形的性质",
                    value: "位似图形的性质",
                  },
                  {
                    label: "位似应用",
                    value: "位似应用",
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    label: "统计与概率",
    value: "统计与概率",
    children: [
      {
        label: "抽样与数据分析",
        value: "抽样与数据分析",
        children: [
          {
            label: "体会抽样的必要性",
            value: "体会抽样的必要性",
            children: [
              {
                label: "全面调查与抽样调查的定义",
                value: "全面调查与抽样调查的定义",
              },
              {
                label: "全面调查与抽样调查的区别与联系",
                value: "全面调查与抽样调查的区别与联系",
              },
              {
                label: "总体、个体、样本及样本容量",
                value: "总体、个体、样本及样本容量",
              },
              {
                label: "判断是否适合全面调查",
                value: "判断是否适合全面调查",
              },
              {
                label: "判断是否适合抽样调查",
                value: "判断是否适合抽样调查",
              },
            ],
          },
          {
            label: "通过实例认识简单随机抽样",
            value: "通过实例认识简单随机抽样",
            children: [
              {
                label: "选择合适的调查对象、方法",
                value: "选择合适的调查对象、方法",
              },
              {
                label: "抽样调查的可靠性",
                value: "抽样调查的可靠性",
              },
            ],
          },
          {
            label: "进一步经历收集、整理、描述、分析数据的活动",
            value: "进一步经历收集、整理、描述、分析数据的活动",
            children: [
              {
                label: "收集数据",
                value: "收集数据",
              },
            ],
          },
          {
            label: "了解数据处理的过程",
            value: "了解数据处理的过程",
            children: [
              {
                label: "根据数据绘制统计表",
                value: "根据数据绘制统计表",
              },
              {
                label: "统计图的选择",
                value: "统计图的选择",
              },
              {
                label: "频率、频数",
                value: "频率、频数",
              },
              {
                label: "组距、组数",
                value: "组距、组数",
              },
              {
                label: "频数（率）分布表",
                value: "频数（率）分布表",
              },
              {
                label: "根据频数（率）分布绘制频数直方图",
                value: "根据频数（率）分布绘制频数直方图",
              },
            ],
          },
          {
            label: "能用计算器处理较为复杂的数据",
            value: "能用计算器处理较为复杂的数据",
            children: [
              {
                label: "计算器的使用",
                value: "计算器的使用",
              },
            ],
          },
          {
            label: "会制作扇形统计图",
            value: "会制作扇形统计图",
            children: [
              {
                label: "绘制扇形统计图",
                value: "绘制扇形统计图",
              },
            ],
          },
          {
            label: "能用统计图直观、有效地描述数据",
            value: "能用统计图直观、有效地描述数据",
            children: [
              {
                label: "扇形统计图求百分比",
                value: "扇形统计图求百分比",
              },
              {
                label: "扇形统计图求圆心角度数",
                value: "扇形统计图求圆心角度数",
              },
              {
                label: "利用扇形统计图求对应数据",
                value: "利用扇形统计图求对应数据",
              },
              {
                label: "条形统计图",
                value: "条形统计图",
              },
              {
                label: "折线统计图",
                value: "折线统计图",
              },
              {
                label: "条形统计图、扇形统计图与折线统计图的区别与联系",
                value: "条形统计图、扇形统计图与折线统计图的区别与联系",
              },
              {
                label: "统计图综合应用",
                value: "统计图综合应用",
              },
            ],
          },
          {
            label: "理解平均数、中位数、众数的意义",
            value: "理解平均数、中位数、众数的意义",
            children: [
              {
                label: "平均数/加权平均数",
                value: "平均数/加权平均数",
              },
              {
                label: "中位数",
                value: "中位数",
              },
              {
                label: "众数",
                value: "众数",
              },
            ],
          },
          {
            label: "能计算中位数、众数、 加权平均数",
            value: "能计算中位数、众数、 加权平均数",
            children: [
              {
                label: "平均数/加权平均数",
                value: "平均数/加权平均数",
              },
              {
                label: "中位数",
                value: "中位数",
              },
              {
                label: "众数",
                value: "众数",
              },
            ],
          },
          {
            label: "知道平均数、中位数、众数、加权平均数是对数据集中趋势的描述",
            value: "知道平均数、中位数、众数、加权平均数是对数据集中趋势的描述",
            children: [
              {
                label: "平均数/加权平均数",
                value: "平均数/加权平均数",
              },
              {
                label: "中位数",
                value: "中位数",
              },
              {
                label: "众数",
                value: "众数",
              },
              {
                label: "统计量的选择",
                value: "统计量的选择",
              },
            ],
          },
          {
            label: "体会刻画数据离散程度的意义",
            value: "体会刻画数据离散程度的意义",
            children: [
              {
                label: "极差",
                value: "极差",
              },
              {
                label: "方差",
                value: "方差",
              },
              {
                label: "标准差",
                value: "标准差",
              },
            ],
          },
          {
            label: "会计算一组简单数据的离差平方和、方差",
            value: "会计算一组简单数据的离差平方和、方差",
            children: [
              {
                label: "方差",
                value: "方差",
              },
            ],
          },
          {
            label: "通过实例，了解频数和频数分布的意义",
            value: "通过实例，了解频数和频数分布的意义",
            children: [
              {
                label: "频率、频数",
                value: "频率、频数",
              },
            ],
          },
          {
            label: "能画频数直方图",
            value: "能画频数直方图",
            children: [
              {
                label: "根据频数（率）分布绘制频数直方图",
                value: "根据频数（率）分布绘制频数直方图",
              },
            ],
          },
          {
            label: "能利用频数直方图解释数据中蕴含的信息",
            value: "能利用频数直方图解释数据中蕴含的信息",
            children: [
              {
                label: "频率、频数",
                value: "频率、频数",
              },
              {
                label: "组距、组数",
                value: "组距、组数",
              },
            ],
          },
          {
            label: "体会样本与总体的关系",
            value: "体会样本与总体的关系",
            children: [
              {
                label: "用样本估计总体",
                value: "用样本估计总体",
              },
            ],
          },
          {
            label: "知道可以用样本平均数估计总体平 均数",
            value: "知道可以用样本平均数估计总体平 均数",
            children: [
              {
                label: "用样本估计总体",
                value: "用样本估计总体",
              },
            ],
          },
          {
            label: "知道可以用样本方差估计总体方差",
            value: "知道可以用样本方差估计总体方差",
            children: [
              {
                label: "用样本估计总体",
                value: "用样本估计总体",
              },
            ],
          },
          {
            label: "能解释数据分析的结果",
            value: "能解释数据分析的结果",
            children: [
              {
                label: "统计综合",
                value: "统计综合",
              },
            ],
          },
          {
            label: "能根据结果作出简单的判断和预测，并能进行交流",
            value: "能根据结果作出简单的判断和预测，并能进行交流",
            children: [
              {
                label: "统计综合",
                value: "统计综合",
              },
            ],
          },
          {
            label: "通过表格、折线图、趋势图等，感受随机现象的变化趋势",
            value: "通过表格、折线图、趋势图等，感受随机现象的变化趋势",
            children: [
              {
                label: "折线统计图",
                value: "折线统计图",
              },
            ],
          },
        ],
      },
      {
        label: "随机事件的概率",
        value: "随机事件的概率",
        children: [
          {
            label:
              "能通过列表、画树状图等方法列出简单随机事件所有可能的 结果，以及指定随机事件发生的所有可能结果",
            value:
              "能通过列表、画树状图等方法列出简单随机事件所有可能的 结果，以及指定随机事件发生的所有可能结果",
            children: [
              {
                label: "概率的定义",
                value: "概率的定义",
              },
              {
                label: "几何概型",
                value: "几何概型",
              },
              {
                label: "树形图",
                value: "树形图",
              },
              {
                label: "列表法",
                value: "列表法",
              },
              {
                label: "列举法求概率",
                value: "列举法求概率",
              },
              {
                label: "游戏公平性",
                value: "游戏公平性",
              },
            ],
          },
          {
            label: "了解随机事件的概率 。",
            value: "了解随机事件的概率 。",
            children: [
              {
                label: "随机事件",
                value: "随机事件",
              },
              {
                label: "可能性的大小",
                value: "可能性的大小",
              },
              {
                label: "不可能事件",
                value: "不可能事件",
              },
              {
                label: "必然事件",
                value: "必然事件",
              },
              {
                label: "概率的定义",
                value: "概率的定义",
              },
              {
                label: "几何概型",
                value: "几何概型",
              },
              {
                label: "树形图",
                value: "树形图",
              },
              {
                label: "列表法",
                value: "列表法",
              },
              {
                label: "列举法求概率",
                value: "列举法求概率",
              },
              {
                label: "游戏公平性",
                value: "游戏公平性",
              },
            ],
          },
          {
            label: "知道通过大量重复试验，可以用频率估计概率",
            value: "知道通过大量重复试验，可以用频率估计概率",
            children: [
              {
                label: "用频率估计概率",
                value: "用频率估计概率",
              },
            ],
          },
        ],
      },
    ],
  },
];
