import { TreeDataItem } from "ant-design-vue/es/tree/Tree";

const treeData: TreeDataItem[] = [
  {
    title: "数与代数",
    key: "0-0",
    children: [
      {
        title: "数与式",
        key: "0-0-0",
        children: [
          {
            title: "有理数",
            key: "0-0-0-0",
            children: [
              {
                title: "理解负数的意义(例64)",
                key: "0-0-0-0-0",
              },
              {
                title: "理解有理数的意义",
                key: "0-0-0-0-1",
              },
              {
                title: "能用数轴上的点表示有理数",
                key: "0-0-0-0-2",
              },
              {
                title: "能比较有理数的大小",
                key: "0-0-0-0-3",
              },
              {
                title: "借助数轴理解相反数和绝对值的意义",
                key: "0-0-0-0-4",
              },
              {
                title: "掌握求有理数的相反数和绝对值的方法",
                key: "0-0-0-0-5",
              },
              {
                title: "理解乘方的意义",
                key: "0-0-0-0-6",
              },
              {
                title:
                  "掌握有理数的加、减、乘、除、乘方及简单的混合运算(以三步以内为主)",
                key: "0-0-0-0-7",
              },
              {
                title: "理解有理数的运算律",
                key: "0-0-0-0-8",
              },
              {
                title: "能运用运算律简化运算",
                key: "0-0-0-0-9",
              },
              {
                title: "能运用有理数的运算解决简单问题",
                key: "0-0-0-0-10",
              },
            ],
          },
          {
            title: "实数",
            key: "0-0-0-1",
            children: [
              {
                title: "了解无理数和实数",
                key: "0-0-0-1-0",
              },
              {
                title: "知道实数由有理数和无理数组成",
                key: "0-0-0-1-1",
              },
              {
                title: "了解实数与数轴上的点一一对应",
                key: "0-0-0-1-2",
              },
              {
                title: "能用数轴上的点表示实数",
                key: "0-0-0-1-3",
              },
              {
                title: "能比较实数的大小",
                key: "0-0-0-1-4",
              },
              {
                title: "能借助数轴理解相反数和绝对值的意义",
                key: "0-0-0-1-5",
              },
              {
                title: "会求实数的相反数和绝对值。",
                key: "0-0-0-1-6",
              },
              {
                title: "了解平方根、算术平方根、立方根的概念",
                key: "0-0-0-1-7",
              },
              {
                title: "会用根号表示数的平方根、算术平方根、立方根",
                key: "0-0-0-1-8",
              },
              {
                title: "了解乘方与开方互为逆运算",
                key: "0-0-0-1-9",
              },
              {
                title: "会用平方运算求百以内完全平方数的平方根",
                key: "0-0-0-1-10",
              },
              {
                title:
                  "会用立方运算求千以内完全立方数(及对应的负整数) 的立方根",
                key: "0-0-0-1-11",
              },
              {
                title: "会用计算器计算平方根和立方根",
                key: "0-0-0-1-12",
              },
              {
                title: "能用有理数估计一个无理数的大致范围",
                key: "0-0-0-1-13",
              },
              {
                title: "了解近似数",
                key: "0-0-0-1-14",
              },
              {
                title: "在解决实际问题中，能用计算器进行近似计算",
                key: "0-0-0-1-15",
              },
              {
                title: "会按问题的要求进行简单的近似计算(例65)",
                key: "0-0-0-1-16",
              },
              {
                title: "了解二次根式、最简二次根式的概念",
                key: "0-0-0-1-17",
              },
              {
                title: "了解二次根式(根号下仅限于数)加、减、乘、除运算法则",
                key: "0-0-0-1-18",
              },
              {
                title: "会用二次根式、最简二次根式进行简单的四则运算",
                key: "0-0-0-1-19",
              },
            ],
          },
          {
            title: "代数式",
            key: "0-0-0-2",
            children: [
              {
                title: "借助现实情境了解代数式，进一步理解用字母表示数的意义",
                key: "0-0-0-2-0",
              },
              {
                title: "能分析具体问题中的简单数量关系，并用代数式表示",
                key: "0-0-0-2-1",
              },
              {
                title: "能根据特定的问题查阅资料，找到所需的公式",
                key: "0-0-0-2-2",
              },
              {
                title: "会把具体数代入代数式进行计算",
                key: "0-0-0-2-3",
              },
              {
                title: "了解整数指数幂的意义和基本性质",
                key: "0-0-0-2-4",
              },
              {
                title: "会用科学记数法表示数(包括在计算器上表示)",
                key: "0-0-0-2-5",
              },
              {
                title: "理解整式的概念",
                key: "0-0-0-2-6",
              },
              {
                title: "掌握合并同类项和去括号的法则",
                key: "0-0-0-2-7",
              },
              {
                title: "能进行简 单的整式加减运算",
                key: "0-0-0-2-8",
              },
              {
                title:
                  "能进行简单的整式乘法运算(多项式乘法仅限于 一次式之间和一次式与二次式的乘法)",
                key: "0-0-0-2-9",
              },
              {
                title: "理解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²",
                key: "0-0-0-2-10",
              },
              {
                title:
                  "了解乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²的几何背景",
                key: "0-0-0-2-11",
              },
              {
                title:
                  "能利用乘法公式(a+b)(a-b)=a²-b²,(a±b)²=a²±2ab+b²进行简单的计算和推理",
                key: "0-0-0-2-12",
              },
              {
                title:
                  "能用提公因式法、公式法(直接利用公式不超过二次)进行因 式分解(指数为正整数)",
                key: "0-0-0-2-13",
              },
              {
                title: "了解分式和最简分式的概念",
                key: "0-0-0-2-14",
              },
              {
                title: "能利用分式的基本性质进行约分和通分",
                key: "0-0-0-2-15",
              },
              {
                title: "能对简单的分式进行加、减、乘、除运算",
                key: "0-0-0-2-16",
              },
              {
                title: "了解代数推理(例66)",
                key: "0-0-0-2-17",
              },
            ],
          },
        ],
      },
      {
        title: "方程与不等式",
        key: "0-0-1",
        children: [
          {
            title: "方程与方程组",
            key: "0-0-1-0",
            children: [
              {
                title: "能根据现实情境理解方程的意义",
                key: "0-0-1-0-0",
              },
              {
                title: "能针对具体问题列出方程",
                key: "0-0-1-0-1",
              },
              {
                title: "理解方程解的意义",
                key: "0-0-1-0-2",
              },
              {
                title: "经历估计方程解的过程",
                key: "0-0-1-0-3",
              },
              {
                title: "掌握等式的基本性质",
                key: "0-0-1-0-4",
              },
              {
                title: "能解一元一次方程和可化为一元一次方程的分式方程",
                key: "0-0-1-0-5",
              },
              {
                title: "掌握消元法",
                key: "0-0-1-0-6",
              },
              {
                title: "能解二元一次方程组",
                key: "0-0-1-0-7",
              },
              {
                title: "*能解简单的三元一次方程组",
                key: "0-0-1-0-8",
              },
              {
                title: "理解配方法",
                key: "0-0-1-0-9",
              },
              {
                title:
                  "能用配方法、公式法、因式分解法解数字系数的 一元二次方程",
                key: "0-0-1-0-10",
              },
              {
                title:
                  "会用一元二次方程根的判别式判别方程是否有实根及两个实根是否相等",
                key: "0-0-1-0-11",
              },
              {
                title: "了解一元二次方程的根与系数的关系(例67)",
                key: "0-0-1-0-12",
              },
              {
                title: "能根据具体问题的实际意义，检验方程解的合理性",
                key: "0-0-1-0-13",
              },
            ],
          },
          {
            title: "不等式与不等式组",
            key: "0-0-1-1",
            children: [
              {
                title: "结合具体问题，了解不等式的意义",
                key: "0-0-1-1-0",
              },
              {
                title: "结合具体问题，探索不等式的基本性质",
                key: "0-0-1-1-1",
              },
              {
                title: "能解数字系数的一元一次不等式",
                key: "0-0-1-1-2",
              },
              {
                title: "能在数轴上表示出数字系数的一元一次不等式的解集",
                key: "0-0-1-1-3",
              },
              {
                title: "会用数轴确定两个一元一次不等式组成的不等式组的解集",
                key: "0-0-1-1-4",
              },
              {
                title:
                  "能根据具体问题中的数量关系，列出一元一次不等式，解决简单的问题",
                key: "0-0-1-1-5",
              },
            ],
          },
        ],
      },
      {
        title: "函数",
        key: "0-0-2",
        children: [
          {
            title: "函数的概念",
            key: "0-0-2-0",
            children: [
              {
                title: "探索简单实例中的数量关系和变化规律",
                key: "0-0-2-0-0",
              },
              {
                title: "了解常量、变量的意义",
                key: "0-0-2-0-1",
              },
              {
                title: "了解函数的概念和表示法",
                key: "0-0-2-0-2",
              },
              {
                title: "能举出函数的实例",
                key: "0-0-2-0-3",
              },
              {
                title: "能结合图象对简单实际问题中的函数关系进行分析(例68)",
                key: "0-0-2-0-4",
              },
              {
                title: "能确定简单实际问题中函数自变量的取值范围",
                key: "0-0-2-0-5",
              },
              {
                title: "会求函数值",
                key: "0-0-2-0-6",
              },
              {
                title:
                  "能用适当的函数表示法刻画简单实际问题中变量之间的关系， 理解函数值的意义(例69)。",
                key: "0-0-2-0-7",
              },
              {
                title: "结合对函数关系的分析，能对变量的变化情况进行初步讨论。",
                key: "0-0-2-0-8",
              },
            ],
          },
          {
            title: "一次函数",
            key: "0-0-2-1",
            children: [
              {
                title: "结合具体情境体会一次函数的意义",
                key: "0-0-2-1-0",
              },
              {
                title: "能根据已知条件确定一次函数的表达式(例70)",
                key: "0-0-2-1-1",
              },
              {
                title: "会运用待定系数法确定一次函数的表达式",
                key: "0-0-2-1-2",
              },
              {
                title: "能画一次函数的图象",
                key: "0-0-2-1-3",
              },
              {
                title:
                  "根据图象和表达式$y= kx+b(k\\neq 0)  $ 探索并理解k>0 和 k<0时图象的变化情况",
                key: "0-0-2-1-4",
              },
              {
                title: "理解正比例函数",
                key: "0-0-2-1-5",
              },
              {
                title: "体会一次函数与二元一次方程的关系",
                key: "0-0-2-1-6",
              },
              {
                title: "能用一次函数解决简单实际问题",
                key: "0-0-2-1-7",
              },
            ],
          },
          {
            title: "二次函数",
            key: "0-0-2-2",
            children: [
              {
                title: "通过对实际问题的分析，体会二次函数的意义",
                key: "0-0-2-2-0",
              },
              {
                title: "能画二次函数的图象",
                key: "0-0-2-2-1",
              },
              {
                title: "通过图象了解二次函数的性质",
                key: "0-0-2-2-2",
              },
              {
                title: "知道二 次函数系数与图象形状和对称轴的关系",
                key: "0-0-2-2-3",
              },
              {
                title: "会求二次函数的最大值或最小值",
                key: "0-0-2-2-4",
              },
              {
                title: "能确定二次函数为最大值或最小值时相应自变量的值",
                key: "0-0-2-2-5",
              },
              {
                title: "能解决与二次函数的最大值或最小值相关的实际问题(例71)",
                key: "0-0-2-2-6",
              },
              {
                title: "知道二次函数和一元二次方程之间的关系",
                key: "0-0-2-2-7",
              },
              {
                title: "会利用二次函数的图象求一元二次方程的近似解",
                key: "0-0-2-2-8",
              },
            ],
          },
          {
            title: "反比例函数",
            key: "0-0-2-3",
            children: [
              {
                title:
                  "结合具体情境体会反比例函数的意义(例72),能根据已知条 件确定反比例函数的表达式。",
                key: "0-0-2-3-0",
              },
              {
                title: "能根据已知条件确定反比例函数的表达式",
                key: "0-0-2-3-1",
              },
              {
                title: "能画反比例函数的图象",
                key: "0-0-2-3-2",
              },
              {
                title:
                  "根据图象和表达式$y=\\frac{k}{x} (k\\neq0) $探索并理解k>0和 k<0时图象的变化情况",
                key: "0-0-2-3-3",
              },
              {
                title: "能用反比例函数解决简单实际问题",
                key: "0-0-2-3-4",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    title: "图形与几何",
    key: "0-1",
    children: [
      {
        title: "图形的性质",
        key: "0-1-0",
        children: [
          {
            title: "点、线、面、角",
            key: "0-1-0-0",
            children: [
              {
                title:
                  "通过实物和模型，了解从物体抽象出来的几何体、平面、直线 和点等概念",
                key: "0-1-0-0-0",
              },
              {
                title: "会比较线段的长短",
                key: "0-1-0-0-1",
              },
              {
                title: "理解线段的和、差，以及线段中点的意义",
                key: "0-1-0-0-2",
              },
              {
                title: "掌握基本事实：两点确定一条直线",
                key: "0-1-0-0-3",
              },
              {
                title: "掌握基本事实：两点之间线段最短",
                key: "0-1-0-0-4",
              },
              {
                title: "理解两点间距离的意义",
                key: "0-1-0-0-5",
              },
              {
                title: "能度量和表达两点间的距离",
                key: "0-1-0-0-6",
              },
              {
                title: "理解角的概念",
                key: "0-1-0-0-7",
              },
              {
                title: "能比较角的大小",
                key: "0-1-0-0-8",
              },
              {
                title: "认识度、分、秒等角的度量 单位",
                key: "0-1-0-0-9",
              },
              {
                title: "能进行简单的单位换算，会计算角的和、差",
                key: "0-1-0-0-10",
              },
              {
                title: "能用尺规作图:作一个角等于已知角",
                key: "0-1-0-0-11",
              },
              {
                title: "能用尺规作图:作一个角的平分线。",
                key: "0-1-0-0-12",
              },
            ],
          },
          {
            title: "相交线与平行线",
            key: "0-1-0-1",
            children: [
              {
                title: "理解对顶角、余角、补角等概念",
                key: "0-1-0-1-0",
              },
              {
                title:
                  "探索并掌握对顶角相等、同角(或等角)的余角相等、同角(或等角)的补角相等的性质",
                key: "0-1-0-1-1",
              },
              {
                title: "理解垂线、垂线段等概念",
                key: "0-1-0-1-2",
              },
              {
                title: "能用三角板或量角器过一点画已知 直线的垂线",
                key: "0-1-0-1-3",
              },
              {
                title:
                  "能用尺规作图：作一条线段的垂直平分线；过一点作已知直线 的垂线(例73)。",
                key: "0-1-0-1-4",
              },
              {
                title:
                  "掌握基本事实：同一平面内，过一点有且只有一条直线与已知 直线垂直",
                key: "0-1-0-1-5",
              },
              {
                title: "理解点到直线的距离的意义",
                key: "0-1-0-1-6",
              },
              {
                title: "能度量点到直线的距离",
                key: "0-1-0-1-7",
              },
              {
                title: "识别同位角、内错角、同旁内角",
                key: "0-1-0-1-8",
              },
              {
                title: "理解平行线的概念",
                key: "0-1-0-1-9",
              },
              {
                title:
                  "掌握平行线基本事实I:   过直线外一点有且只有一条直线与这 条直线平行",
                key: "0-1-0-1-10",
              },
              {
                title:
                  "掌握平行线基本事实Ⅱ:两条直线被第三条直线所截，如果同 位角相等，那么这两条直线平行",
                key: "0-1-0-1-11",
              },
              {
                title:
                  "探索并证明平行线的判定定理：两条直线被第三条直线所截， 如果内错角相等(或同旁内角互补),那么这两条直线平行",
                key: "0-1-0-1-12",
              },
              {
                title:
                  "掌握平行线的性质定理I:    两条平行直线被第三条直线所截， 同位角相等",
                key: "0-1-0-1-13",
              },
              {
                title: "*了解平行线的性质定理I的证明(例74)",
                key: "0-1-0-1-14",
              },
              {
                title:
                  "探索并证明平行线的性质定理Ⅱ:两条平行直线被第三条直线 所截，内错角相等(或同旁内角互补)",
                key: "0-1-0-1-15",
              },
              {
                title: "能用三角板和直尺过已知直线外一点画这条直线的平行线",
                key: "0-1-0-1-16",
              },
              {
                title: "能用尺规作图：过直线外一点作这条直线的平行线",
                key: "0-1-0-1-17",
              },
              {
                title: "了解平行于同一条直线的两条直线平行",
                key: "0-1-0-1-18",
              },
            ],
          },
          {
            title: "三角形",
            key: "0-1-0-2",
            children: [
              {
                title: "理解三角形及其内角、外角、中线、高线、角平分线等概念",
                key: "0-1-0-2-0",
              },
              {
                title: "了解三角形的稳定性",
                key: "0-1-0-2-1",
              },
              {
                title: "探索并证明三角形的内角和定理",
                key: "0-1-0-2-2",
              },
              {
                title:
                  "掌握三角形的内角和的推论：三角形的外 角等于与它不相邻的两个内角的和",
                key: "0-1-0-2-3",
              },
              {
                title: "证明三角形的任意两边之和大于第三边",
                key: "0-1-0-2-4",
              },
              {
                title: "理解全等三角形的概念",
                key: "0-1-0-2-5",
              },
              {
                title: "能识别全等三角形中的对应边、对应角",
                key: "0-1-0-2-6",
              },
              {
                title: "掌握基本事实：两边及其夹角分别相等的两个三角形全等",
                key: "0-1-0-2-7",
              },
              {
                title: "掌握基本事实：两角及其夹边分别相等的两个三角形全等",
                key: "0-1-0-2-8",
              },
              {
                title: "掌握基本事实：三边分别相等的两个三角形全等",
                key: "0-1-0-2-9",
              },
              {
                title:
                  "证明定理：两角分别相等且其中一组等角的对边相等的两个三 角形全等",
                key: "0-1-0-2-10",
              },
              {
                title: "理解角平分线的概念",
                key: "0-1-0-2-11",
              },
              {
                title:
                  "探索并证明角平分线的性质定理：角平 分线上的点到角两边的距离相等；反之，角的内部到角两边距离相等 的点在角的平分线上",
                key: "0-1-0-2-12",
              },
              {
                title: "理解线段垂直平分线的概念",
                key: "0-1-0-2-13",
              },
              {
                title:
                  "探索并证明线段垂直平分线的性 质定理：线段垂直平分线上的点到线段两端的距离相等；反之，到线 段两端距离相等的点在线段的垂直平分线上",
                key: "0-1-0-2-14",
              },
              {
                title: "理解等腰三角形的概念",
                key: "0-1-0-2-15",
              },
              {
                title:
                  "探索并证明等腰三角形的性质定理： 等腰三角形的两个底角相等；底边上的高线、中线及顶角平分线重合",
                key: "0-1-0-2-16",
              },
              {
                title:
                  "探索并掌握等腰三角形的判定定理：有两个角相等的三角形是等 腰三角形",
                key: "0-1-0-2-17",
              },
              {
                title:
                  "探索等边三角形的性质定理：等边三角形的各角都等于 $60^\\circ$",
                key: "0-1-0-2-18",
              },
              {
                title:
                  "探索等边三角形的判定定理：三个角都相等的三角形(或有一个角是$60^\\circ$的等腰三角形)是等边三角形",
                key: "0-1-0-2-19",
              },
              {
                title: "理解直角三角形的概念",
                key: "0-1-0-2-20",
              },
              {
                title:
                  "探索并掌握直角三角形的性质定理：直角三角形的两个锐角互余，直角三角形斜边上的中线等于斜边的一 半",
                key: "0-1-0-2-21",
              },
              {
                title: "掌握有两个角互余的三角形是直角三角形",
                key: "0-1-0-2-22",
              },
              {
                title: "探索勾股定理及其逆定理",
                key: "0-1-0-2-23",
              },
              {
                title: "能运用勾股定理及其逆定理解决一些简单的实际 问题。",
                key: "0-1-0-2-24",
              },
              {
                title: "探索并掌握判定直角三角形全等的“斜边、直角边”定理",
                key: "0-1-0-2-25",
              },
              {
                title: "了解三角形重心的概念",
                key: "0-1-0-2-26",
              },
              {
                title:
                  "能用尺规作图：已知三边、两边及其夹角、两角及其夹边作三 角形",
                key: "0-1-0-2-27",
              },
              {
                title: "能用尺规作图：已知底边及底边上的高线作等腰三角形",
                key: "0-1-0-2-28",
              },
              {
                title: "能用尺规作图：已知一直角边和斜边 作直角三角形",
                key: "0-1-0-2-29",
              },
            ],
          },
          {
            title: "四边形",
            key: "0-1-0-3",
            children: [
              {
                title:
                  "了解多边形的概念及多边形的顶点、边、内角、外角与对 角线",
                key: "0-1-0-3-0",
              },
              {
                title: "探索并掌握多边形内角和与外角和公式",
                key: "0-1-0-3-1",
              },
              {
                title:
                  "理解平行四边形、矩形、菱形、正方形、梯形的概念，以及它 们之间的关系",
                key: "0-1-0-3-2",
              },
              {
                title: "了解四边形的不稳定性",
                key: "0-1-0-3-3",
              },
              {
                title:
                  "探索并证明平行四边形的性质定理：平行四边形的对边相等、 对角相等、对角线互相平分",
                key: "0-1-0-3-4",
              },
              {
                title:
                  "探索并证明平行四边形的判定定理：一 组对边平行且相等的四边形是平行四边形；两组对边分别相等的四边  形是平行四边形；对角线互相平分的四边形是平行四边形。",
                key: "0-1-0-3-5",
              },
              {
                title: "理解两条平行线之间距离的概念",
                key: "0-1-0-3-6",
              },
              {
                title: "能度量两条平行线之间的 距离",
                key: "0-1-0-3-7",
              },
              {
                title:
                  "探索并证明矩形、菱形的性质定理：矩形的四个角都是直角， 对角线相等；菱形的四条边相等，对角线互相垂直",
                key: "0-1-0-3-8",
              },
              {
                title:
                  "探索并证明矩形、菱形的判定定理：三个角是直角的四边形是矩形，对角线相等的平行四边形是矩形；四边相等的四边形是菱形，对角线互相垂直的平行四边形是菱形。正方形既是矩形，又是菱形",
                key: "0-1-0-3-9",
              },
              {
                title: "理解矩形、菱形、正  方形之间的包含关系",
                key: "0-1-0-3-10",
              },
              {
                title: "探索并证明三角形的中位线定理",
                key: "0-1-0-3-11",
              },
            ],
          },
          {
            title: "圆",
            key: "0-1-0-4",
            children: [
              {
                title: "理解圆、弧、弦、圆心角、圆周角的概念",
                key: "0-1-0-4-0",
              },
              {
                title: "了解等圆、等弧的 概念",
                key: "0-1-0-4-1",
              },
              {
                title: "探索并掌握点与圆的位置关系",
                key: "0-1-0-4-2",
              },
              {
                title:
                  "探索并证明垂径定理：垂直于弦的直径平分弦以及弦所对的两条弧",
                key: "0-1-0-4-3",
              },
              {
                title:
                  "探索圆周角与圆心角及其所对弧的关系，知道同弧(或等弧) 所对的圆周角相等",
                key: "0-1-0-4-4",
              },
              {
                title:
                  "了解并证明圆周角定理及其推论：圆周角等于它 所对弧上的圆心角的一半；直径所对的圆周角是直角，$90^\\circ$的圆周角 所对的弦是直径；圆内接四边形的对角互补",
                key: "0-1-0-4-5",
              },
              {
                title: "了解三角形的内心与外心",
                key: "0-1-0-4-6",
              },
              {
                title: "了解直线与圆的位置关系",
                key: "0-1-0-4-7",
              },
              {
                title: "掌握切线的概念(例75)",
                key: "0-1-0-4-8",
              },
              {
                title: "能用尺规作图：过不在同一直线上的三点作圆",
                key: "0-1-0-4-9",
              },
              {
                title: "能用尺规作图：作三角形的外 接圆、内切圆",
                key: "0-1-0-4-10",
              },
              {
                title: "能用尺规作图：作圆的内接正方形和内接正六边形",
                key: "0-1-0-4-11",
              },
              {
                title: "* 能用尺规作图：过圆外一点作圆的切线(例76)。",
                key: "0-1-0-4-12",
              },
              {
                title: "* 探索并证明切线长定理：过圆外一点的两条切线长相等。",
                key: "0-1-0-4-13",
              },
              {
                title: "会计算圆的弧长",
                key: "0-1-0-4-14",
              },
              {
                title: "会计算扇形的面积",
                key: "0-1-0-4-15",
              },
              {
                title: "了解正多边形的概念及正多边形与圆的关系",
                key: "0-1-0-4-16",
              },
            ],
          },
          {
            title: "定义、命题、定理",
            key: "0-1-0-5",
            children: [
              {
                title: "通过具体实例，了解定义、命题、定理、推论的意义",
                key: "0-1-0-5-0",
              },
              {
                title: "结合具体实例，会区分命题的条件和结论",
                key: "0-1-0-5-1",
              },
              {
                title: "了解原命题及其逆命题的概念",
                key: "0-1-0-5-2",
              },
              {
                title: "会识别两个互逆的命题",
                key: "0-1-0-5-3",
              },
              {
                title: "知道原命题成立其逆命题不一 定成立",
                key: "0-1-0-5-4",
              },
              {
                title: "知道证明的意义和证明的必要性(例77)",
                key: "0-1-0-5-5",
              },
              {
                title: "知道数学思维要合乎逻辑(例78)",
                key: "0-1-0-5-6",
              },
              {
                title: "知道可以用不同的形式表述证明的过程",
                key: "0-1-0-5-7",
              },
              {
                title: "会用综合法的证明格式",
                key: "0-1-0-5-8",
              },
              {
                title: "了解反例的作用",
                key: "0-1-0-5-9",
              },
              {
                title: "知道利用反例可以判断一个命题是错误的(例79)",
                key: "0-1-0-5-10",
              },
              {
                title: "通过实例体会反证法的含义(例74)",
                key: "0-1-0-5-11",
              },
            ],
          },
        ],
      },
      {
        title: "图形的变化",
        key: "0-1-1",
        children: [
          {
            title: "图形的轴对称",
            key: "0-1-1-0",
            children: [
              {
                title:
                  "通过具体实例理解轴对称的概念，探索它的基本性质：成轴对 称的两个图形中对应点的连线被对称轴垂直平分",
                key: "0-1-1-0-0",
              },
              {
                title:
                  "能画出简单平面图形(点、线段、直线、三角形等)关于给定对称轴的对称图形",
                key: "0-1-1-0-1",
              },
              {
                title: "理解轴对称图形的概念",
                key: "0-1-1-0-2",
              },
              {
                title: "探索等腰三角形、矩形、菱形、正多 边形、圆的轴对称性质",
                key: "0-1-1-0-3",
              },
              {
                title: "认识并欣赏自然界和现实生活中的轴对称图形",
                key: "0-1-1-0-4",
              },
            ],
          },
          {
            title: "图形的旋转",
            key: "0-1-1-1",
            children: [
              {
                title:
                  "通过具体实例认识平面图形关于旋转中心的旋转。探索它的基本性质：一个图形和旋转得到的图形中，对应点到旋转中心距离相等，两组对应点分别与旋转中心连线所成的角相等(例80)。",
                key: "0-1-1-1-0",
              },
              {
                title: "了解中心对称、中心对称图形的概念",
                key: "0-1-1-1-1",
              },
              {
                title:
                  "探索中心对称、中心对称图形的基本性质： 成中心对称的两个图形中，对应点的连线经过对称中心，且被对称中心平分。",
                key: "0-1-1-1-2",
              },
              {
                title: "探索线段、平行四边形、正多边形、圆的中心对称性质",
                key: "0-1-1-1-3",
              },
              {
                title: "认识并欣赏自然界和现实生活中的中心对称图形",
                key: "0-1-1-1-4",
              },
            ],
          },
          {
            title: "图形的平移",
            key: "0-1-1-2",
            children: [
              {
                title:
                  "通过具体实例认识平移，探索它的基本性质：一个图形和它经过平移所得的图形中，两组对应点的连线平行(或在同一条直线上) 且相等",
                key: "0-1-1-2-0",
              },
              {
                title: "认识并欣赏平移在自然界和现实生活中的应用",
                key: "0-1-1-2-1",
              },
              {
                title: "运用图形的轴对称、旋转、平移进行图案设计",
                key: "0-1-1-2-2",
              },
            ],
          },
          {
            title: "图形的相似",
            key: "0-1-1-3",
            children: [
              {
                title: "了解比例的基本性质、线段的比、成比例的线段",
                key: "0-1-1-3-0",
              },
              {
                title: "通过建筑、 艺术上的实例了解黄金分割",
                key: "0-1-1-3-1",
              },
              {
                title: "通过具体实例认识图形的相似",
                key: "0-1-1-3-2",
              },
              {
                title: "了解相似多边形和相似比",
                key: "0-1-1-3-3",
              },
              {
                title:
                  "掌握基本事实：两条直线被一组平行线所截，所得的对应线段成比例",
                key: "0-1-1-3-4",
              },
              {
                title:
                  "了解相似三角形的判定定理：两角分别相等的两个三角形相似；两边成比例且夹角相等的两个三角形相似；三边成比例的两个三角形相似",
                key: "0-1-1-3-5",
              },
              {
                title: "*了解相似三角形判定定理的证明",
                key: "0-1-1-3-6",
              },
              {
                title:
                  "了解相似三角形的性质定理：相似三角形对应线段的比等于相似比；面积比等于相似比的平方",
                key: "0-1-1-3-7",
              },
              {
                title: "了解图形的位似",
                key: "0-1-1-3-8",
              },
              {
                title: "知道利用位似可以将一个图形放大或缩小",
                key: "0-1-1-3-9",
              },
              {
                title: "会利用图形的相似解决一些简单的实际问题(例81)",
                key: "0-1-1-3-10",
              },
              {
                title:
                  "利用相似的直角三角形，探索并认识锐角三角函数 (sin A, cos A,tan A)",
                key: "0-1-1-3-11",
              },
              {
                title: "知道$30^\\circ,45^\\circ,60^\\circ$角的三角函数值",
                key: "0-1-1-3-12",
              },
              {
                title: "会使用计算器由已知锐角求它的三角函数值",
                key: "0-1-1-3-13",
              },
              {
                title: "会使用计算器由已知三角函数值求它的对应锐角",
                key: "0-1-1-3-14",
              },
              {
                title: "能用锐角三角函数解直角三角形",
                key: "0-1-1-3-15",
              },
              {
                title: "能用锐角三角函数的知识解决一些简单的实际问题",
                key: "0-1-1-3-16",
              },
            ],
          },
          {
            title: "图形的投影",
            key: "0-1-1-4",
            children: [
              {
                title: "通过丰富的实例，了解中心投影和平行投影的概念",
                key: "0-1-1-4-0",
              },
              {
                title: "会画直棱柱、圆柱、圆锥、球的主视图、左视图、俯视图",
                key: "0-1-1-4-1",
              },
              {
                title: "能判断简单物体的视图",
                key: "0-1-1-4-2",
              },
              {
                title: "会根据视图描述简单的几何体",
                key: "0-1-1-4-3",
              },
              {
                title: "了解直棱柱、圆锥的侧面展开图",
                key: "0-1-1-4-4",
              },
              {
                title: "能根据展开图想象和制作模型",
                key: "0-1-1-4-5",
              },
              {
                title: "通过实例，了解上述视图与展开图在现实生活中的应用",
                key: "0-1-1-4-6",
              },
            ],
          },
        ],
      },
      {
        title: "图形与坐标",
        key: "0-1-2",
        children: [
          {
            title: "图形的位置与坐标",
            key: "0-1-2-0",
            children: [
              {
                title: "理解平面直角坐标系的有关概念",
                key: "0-1-2-0-0",
              },
              {
                title: "能画出平面直角坐标系",
                key: "0-1-2-0-1",
              },
              {
                title: "在给定的平面直角坐标系中，能根据坐标描出点的位置",
                key: "0-1-2-0-2",
              },
              {
                title: "在给定的平面直角坐标系中，能由点的位置写出坐标。",
                key: "0-1-2-0-3",
              },
              {
                title:
                  "在实际问题中，能建立适当的平面直角坐标系，描述物体的位置",
                key: "0-1-2-0-4",
              },
              {
                title:
                  "对给定的正方形，会选择合适的平面直角坐标系，写出它的顶点坐标",
                key: "0-1-2-0-5",
              },
              {
                title: "体会可以用坐标表达简单图形",
                key: "0-1-2-0-6",
              },
              {
                title: "在平面上，运用方位角和距离刻画两个物体的相对位置",
                key: "0-1-2-0-7",
              },
            ],
          },
          {
            title: "图形的运动与坐标",
            key: "0-1-2-1",
            children: [
              {
                title:
                  "在平面直角坐标系中，以坐标轴为对称轴，能写出一个已知顶点坐标的多边形的对称图形的顶点坐标，知道对应顶点坐标之间的关系",
                key: "0-1-2-1-0",
              },
              {
                title:
                  "在平面直角坐标系中，能写出一个已知顶点坐标的多边形沿坐标轴方向平移一定距离后图形的顶点坐标，知道对应顶点坐标之间的关系",
                key: "0-1-2-1-1",
              },
              {
                title:
                  "在平面直角坐标系中，探索并了解将一个多边形依次沿两个坐标轴方向平移后所得到的图形和原来图形具有平移关系，体会图形顶点坐标的变化",
                key: "0-1-2-1-2",
              },
              {
                title:
                  "在平面直角坐标系中，探索并了解将一个多边形的顶点坐标 (有一个顶点为原点)分别扩大或缩小相同倍数时所对应的图形与原图形是位似的",
                key: "0-1-2-1-3",
              },
            ],
          },
        ],
      },
    ],
  },
  {
    title: "统计与概率",
    key: "0-2",
    children: [
      {
        title: "抽样与数据分析",
        key: "0-2-0",
        children: [
          {
            title: "体会抽样的必要性",
            key: "0-2-0-0",
          },
          {
            title: "通过实例认识简单随机抽样(例83)",
            key: "0-2-0-1",
          },
          {
            title: "进一步经历收集、整理、描述、分析数据的活动",
            key: "0-2-0-2",
          },
          {
            title: "了解数据处理的过程",
            key: "0-2-0-3",
          },
          {
            title: "能用计算器处理较为复杂的数据",
            key: "0-2-0-4",
          },
          {
            title: "会制作扇形统计图",
            key: "0-2-0-5",
          },
          {
            title: "能用统计图直观、有效地描述数据",
            key: "0-2-0-6",
          },
          {
            title: "理解平均数、中位数、众数的意义",
            key: "0-2-0-7",
          },
          {
            title: "能计算中位数、众数、 加权平均数(例84)",
            key: "0-2-0-8",
          },
          {
            title: "知道平均数、中位数、众数、加权平均数是对数据集中趋势的描述",
            key: "0-2-0-9",
          },
          {
            title: "体会刻画数据离散程度的意义",
            key: "0-2-0-10",
          },
          {
            title: "会计算一组简单数据的离差平方和、方差",
            key: "0-2-0-11",
          },
          {
            title: "经历数据分类的活动",
            key: "0-2-0-12",
          },
          {
            title: "知道按照组内离差平方和最小的原则对数据进行分类的方法(例85)",
            key: "0-2-0-13",
          },
          {
            title: "通过实例，了解频数和频数分布的意义",
            key: "0-2-0-14",
          },
          {
            title: "能画频数直方图",
            key: "0-2-0-15",
          },
          {
            title: "能利用频数直方图解释数据中蕴含的信息",
            key: "0-2-0-16",
          },
          {
            title: "体会样本与总体的关系",
            key: "0-2-0-17",
          },
          {
            title: "知道可以用样本平均数估计总体平 均数",
            key: "0-2-0-18",
          },
          {
            title: "知道可以用样本方差估计总体方差",
            key: "0-2-0-19",
          },
          {
            title: "会计算四分位数",
            key: "0-2-0-20",
          },
          {
            title: "了解四分位数与箱线图的关系(例86)",
            key: "0-2-0-21",
          },
          {
            title: "感悟百分 位数的意义",
            key: "0-2-0-22",
          },
          {
            title: "能解释数据分析的结果",
            key: "0-2-0-23",
          },
          {
            title: "能根据结果作出简单的判断和预测，并能进行交流",
            key: "0-2-0-24",
          },
          {
            title: "通过表格、折线图、趋势图(例87)等，感受随机现象的变化趋势",
            key: "0-2-0-25",
          },
        ],
      },
      {
        title: "随机事件的概率",
        key: "0-2-1",
        children: [
          {
            title:
              "能通过列表、画树状图等方法列出简单随机事件所有可能的 结果，以及指定随机事件发生的所有可能结果",
            key: "0-2-1-0",
          },
          {
            title: "了解随机事件的概率 (例88)。",
            key: "0-2-1-1",
          },
          {
            title: "知道通过大量重复试验，可以用频率估计概率",
            key: "0-2-1-2",
          },
        ],
      },
    ],
  },
];

export default treeData;
